{"Computational Technologies for Fashion Recommendation: A Survey": "YUJUAN DING, The Hong Kong Polytechnic University ZHIHUI LAI ∗ , Shenzhen University and Shenzhen Institute of Artificial Intelligence and Robotics for Society P.Y. MOK, The Hong Kong Polytechnic University TAT-SENG CHUA, National University of Singapore Fashion recommendation is a key research field in computational fashion research and has attracted considerable interest in the computer vision, multimedia, and information retrieval communities in recent years. Due to the great demand for applications, various fashion recommendation tasks, such as personalized fashion product recommendation, complementary (mix-and-match) recommendation, and outfit recommendation, have been posed and explored in the literature. The continuing research attention and advances impel us to look back and in-depth into the field for a better understanding. In this paper, we comprehensively review recent research efforts on fashion recommendation from a technological perspective. We first introduce fashion recommendation at a macro level and analyse its characteristics and differences with general recommendation tasks. We then clearly categorize different fashion recommendation efforts into several sub-tasks and focus on each sub-task in terms of its problem formulation, research focus, state-of-the-art methods, and limitations. We also summarize the datasets proposed in the literature for use in fashion recommendation studies to give readers a brief illustration. Finally, we discuss several promising directions for future research in this field. Overall, this survey systematically reviews the development of fashion recommendation research. It also discusses the current limitations and gaps between academic research and the real needs of the fashion industry. In the process, we offer a deep insight into how the fashion industry could benefit from the computational technologies of fashion recommendation. Additional Key Words and Phrases: Fashion Recommendation, Fashion Survey, Personalized Recommendation, Compatibility Modeling, Outfit Recommendation", "ACMReference Format:": "Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua. 2021. Computational Technologies for Fashion Recommendation: A Survey. 1, 1 (October 2021), 43 pages. https://doi.org/10.1145/1122445.1122456", "1 INTRODUCTION": "Fashion was considered important in France as early as the 15th century and has swept the globe ever since [147]. Over the past centuries, industrialization, globalization, democratization, and the development of technology ∗ Corresponding Author This work was supported in part by the Natural Science Foundation of China under Grant 61976145 and Grant 62272319. It is also supported by NExT++. P. Y. Mok is supported in part by the Research Grants Council of the Hong Kong SAR under Grant 152112/19E and by the Innovation and Technology Commission of Hong Kong, under grant ITP/028/21TP. Authors' addresses: Yujuan Ding, dingyujuan385@gmail.com, Department of Computing, The Hong Kong Polytechnic University, Hong Kong SAR, China; Zhihui Lai, lai_zhi_hui@163.com, College of Computer Science and Software Engineering, Shenzhen University, Shenzhen Institute of Artificial Intelligence and Robotics for Society, Shenzhen, China; P.Y. Mok, tracy.mok@polyu.edu.hk, School of Fashion and Textiles, The Hong Kong Polytechnic University, Hong Kong SAR, China; Tat-Seng Chua, dcscts@nus.edu.sg, School of Computing, National University of Singapore, Singapore. Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. © 2021 Association for Computing Machinery. XXXX-XXXX/2021/10-ART $15.00 https://doi.org/10.1145/1122445.1122456 , Vol. 1, No. 1, Article . Publication date: October 2021. 2 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua have increased the demand for fashion, and have naturally invigorated the fashion industry [111]. Fashion today is an essential aspect of culture and life, and the fashion industry is one of the most important parts of the global economy. More recently, the advent and development of the Internet have provoked a storm of digital transformation in all segments of the economy, including fashion. Nowadays, consumers increasingly shop for apparel or footwear online as they seek greater convenience, novelty, and personalization. Such digital transformation produces a huge demand for supporting technologies such as fashion recommendation. It also boosts the development of related research fields [23, 38]. Fashion recommendation refers to the task of providing suitable suggestions to facilitate the decision-making process related to fashion, which can benefit both the consumers and the fashion business. For example, in online fashion shopping, consumers want to easily find the items they like and experience personalized services, which need the help of recommendation tools considering the large scale of fashion items available. In addition, consumers lacking a sense of fashion may need appropriate dressing or matching advice, which is another form of fashion recommendation. From the business perspective, effective recommendation tools help fashion retailers better understand the styling preference of their customers so that they can suggest the right products or outfits for them at the right time, which can optimize the conversion, Average Order Value (AOV) and repeat purchase rate in the end. Fashion recommendation has already become prevalent in modern life as a large percentage of people rely upon advice from their friends, families, or sales staff in fashion shopping [39, 89]. Such a decision-making pattern demonstrates the importance of an effective recommender system in fashion, which acts as a shopping assistant to offer personalized suggestions to customers. Early in 2013, more than 85 % of Amazon sales revenue was related to the personalized recommendation technology 1 . Empowering product detail pages with smart recommendation engines is becoming common in fashion and apparel e-commerce since they help open new revenue channels and boost up-selling and cross-selling opportunities. This trend has exploded particularly in the last few years with the boost of AI-driven recommendation technologies. Nowadays, most leading fashion retailers have equipped their online platforms with advanced recommendation functions. ZARA, H&M, MACY'S and ASOS 2 can now provide relevant recommendations on the product detail pages, which recommends similar and matching products, or even outfit suggestions. There have been many technological startups running fashion recommendation-relevant businesses. For example, Style Advisor from WideEye 3 is a solution that enables retailers to automatize the complete-the-look process and make this expandable to their entire catalog. It inspires shoppers with high-quality outfit recommendations and increases their shopping basket. Stylitics 4 provides a service of automatically displaying outfit ideas on the product page during customers' browsing. There are others including Suggestyny 5 which offers style-specific fashion item recommendations and Easysize 6 which recommends size and fit for apparel and shoes. As we can see, fashion recommendation has now become a critical technology that is ubiquitous in the whole fashion industry, especially the retailing section. The prosperous industrial application is owing to the steady research development. The number of research publications on fashion recommendation has been continuously increasing over the years, providing strong evidence that this research area is rapidly developing. In particular, with the accumulation of fashion-related data, many conventional tasks in fashion domain now can be analysed from a data science or computing perspective. Fashion recommendation methods are usually developed based on a wide range of fundamental research [2, 32, 136, 172]. For example, for personalized fashion recommendations, Collaborative Filtering (CF) 1 https://www.mckinsey.com/industries/retail/our-insights/how-retailers-can-keep-up-with-consumers# 2 https://www.zara.com/, https://www.hm.com/, https://www.macys.com/, https://www.asos.com/ 3 https://wideeyes.ai/style-advisor/ 4 https://stylitics.com/products/e-commerce/ 5 https://www.suggestyny.com/ 6 https://www.easysize.me/ , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey 3 • usually serves as a basis for the development of advanced methods that can effectively explore users' fashion preferences [47, 181]. For the complementary recommendation task, metric learning ideas and methods are commonly adopted to learn the compatibility space(s), in which compatibility between items can be measured and further used as the criteria for complementary recommendation [157, 158]. In recent years, deep learning (DL) has shown impressive performance in many research fields. The influence of DL has been stellar in the field of information retrieval and recommender systems [7, 189, 195], including fashion recommendation. DL-based methods permeate the whole of the fashion recommendation area. For example, for outfit recommendation, graph neural networks (GNNs) [73] and recurrent neural networks (RNNs) [53] are widely applied to model the outfits consisting of multiple fashion items [85]. Also, Transformers have been adopted to model the user interaction with items in chronological order [13]. While some advanced technologies have achieved great success in other recommendation contexts, they are still under-explored in fashion recommendation. For example, the Knowledge Graph (KG) technology is powerful to incorporate high-order and multi-relational connectivities between users, items and the other affiliated attributes with a hybrid structure [65, 161], and causal reasoning is another promising tool for the recommendation for tacking several issues such as bias, fairness and explainability [83, 170, 171]. However, these technologies have not been explored much in the fashion domain so far. All these deep learning advances are expected to perform more important roles in future fashion recommendation research, which will be discussed in the remaining part of this survey. How does this survey differ from others? Due to the great significance of fashion recommendation to the academia and industry, it has attracted much research attention in the information retrieval, multimedia analysis, and computer vision communities. In recent years, workshops and tutorials on fashion recommendations have been held at top-tier conferences. For example, WWW 2019 held a tutorial on Concept to Code: Deep Learning for Fashion Recommendation . SysRec, the specific conference about recommender systems, has been holding the recsys X fashion workshop every year since 2019. These evidences suggest that fashion recommendation has been becoming an independent and active area with great research value. Even though fashion recommendation has been attracting increasing research attention, surveys or reviews specifically focusing on this topic are limited. The are several review papers on recommender systems in the literature [4, 21, 168, 184, 189], but them pay no special attention on the fashion domain. From another perspective, surveys focusing on computational fashion review fashion recommendation as a subset. [10, 11, 16, 34, 38, 113, 140, 166]. For example, Cheng et al. [16] categorize fashion recommendations into three groups, i.e., fashion compatibility, outfit matching, and hairstyle suggestion. They review each group of studies covering approaches, datasets, and evaluation. Gu et al. [38] review fashion recommendation and fashion compatibility as two independent research areas belonging to high-level fashion applications. Despite these efforts in summarizing fashion recommendation research, they cover only a limited part of this research area and lack comprehensiveness and in-depth analysis. It is reasonable since fashion recommendation is not the main focus of these surveys. Currently, most fashion-related surveys from a computing perspective pay more attention to Computer Vision (CV) problems in fashion, while less to recommendation problems. There is also a survey that specifically focuses on apparel recommender systems [39]. However, it is from the perspective of design rather than technologies and algorithms. Another relevant survey published recently investigates clothing matching [187] and pays special focus on deep learning-based approaches. However, it is rather brief and covers only around 40 papers in total. Moreover, it only investigates fashion-matching recommendations while ignoring other sub-tasks. From the above analysis, we can see that this paper differs greatly from all the previous surveys. To the best of our knowledge, this is the first survey that specifically focuses on fashion recommendations with advanced machine learning, data mining, and computer vision technologies. It aims to sort out the research area of computational fashion recommendation by organizing, reviewing, and summarizing relevant research papers and resources. Specifically, it groups existing studies into several sub-tasks and systematically reviews each sub-task, which has not been done in any existing work. Furthermore, this survey explores fashion recommendations in a , Vol. 1, No. 1, Article . Publication date: October 2021.", "4 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua": "more detailed, in-depth, and comprehensive manner by elaborating specific problems, solutions and limitations. It also discusses specific challenges of fashion recommendation and poses promising research directions for follow-on studies. How do we collect the paper? We use the Google Scholar engine to search for relevant academic papers with several keywords including fashion recommendation, outfit recommendation, fashion compatibility, etc. We also explore high-profile conferences and journals in recent years to find relevant papers, including the ACMMM, KDD, WWW,CVPR, ICCV, ECCV, AAAI, SIGIR, ICDM, IJCAI, and TMM, to name just a few. Several papers published in workshops of top-tier conferences or pre-published in arXiv are also included. However, considering the reliability of the references and resources, this survey is mainly based on formal publications in well-recognized conferences and journals (most are listed above). We believe that there exist a lot more publications that are relevant to our topic in the literature, but summarizing and reviewing mainstream publications enable us to make sound analysis and discussion, which can better elaborate the development of the targeted fashion recommendation area. Contribution of this survey. The goal of this survey is to thoroughly review the literature on computational fashion recommendations. It provides a panorama through which readers can quickly understand the research area of fashion recommendation. The key contributions of this survey are as follows: · It reviews the fashion recommendation research under a proper categorization of tasks, each has a distinct problem formulation and research focus. Moreover, it summarizes experimental settings under this topic including model input, dataset, and evaluation protocols, which can help researchers new to this area to make an easy start to their studies. · It discusses the challenges and uniqueness of fashion, also how it differs from recommendations in general or other domains, which have been overlooked in most previous research papers. · It systematically summarizes existing methods for each fashion recommendation sub-task, demonstrating its developing directions. On top of that, it discusses research limitations in each sub-task, offering a comprehensive survey on methodology. · It emphasizes several important perspectives and remaining gaps in the research of fashion recommendation, and also points out promising directions for future work in this area. · It analyses the industrial needs and academic research outcomes, which facilitates discussions on how the fashion industry can really benefit from the development of recommendation and other relevant technologies. Structure of this survey. In the rest of this survey, we first give an overview of fashion recommendation in Section 2. In Section 3 to Section 6, we introduce and summarize the literature on specific research areas: personalized fashion recommendation, complementary recommendation, outfit recommendation, and other special fashion recommendations. We review each sub-task systematically by introducing the problem formulation and the state-of-the-art development. In Section A.1, we introduce the important experimental settings in fashion recommendation, including the model input and evaluation protocols, as well as the existing datasets. Furthermore, we provide an in-depth discussion to provide more insights on this research topic and also propose potential future directions in Section 8. Lastly, we summarize the whole survey and give the conclusion in Section 9.", "2 OVERVIEW OF FASHION RECOMMENDATION AND SUB-TASKS": "Fashion recommendation generally refers to tasks that recommend fashion-related objects to certain or unspecified users. The research problem can be different when focusing on different aspects. As a result, studies on fashion recommendation are very diverse in the literature in terms of different research targets or problem formulations. As we know, recommendation is a type of high-level tasks in the field of fashion analysis and it is usually supported by low-level research such as clothing parsing, attribute recognition, and others [16, 38]. It is therefore formulated as a CV-related task at the early stage of its development [62, 137, 196] when most studies actually focus on extracting semantic information from fashion images. With fundamental CV problems gradually being addressed, , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 5 it is recognized more widely that the user-item or item-item relationships, as well as their relationships with content information, are more important research focuses. To this end, fashion recommendation is more frequently formulated as an information retrieval (IR) or data mining (DM) problem. In this survey, our main attention is paid to research with IR/DM formulations. This section gives an overview of the fashion recommendation area by: 1) discussing its uniqueness; 2) introducing key terms and concepts in the context of fashion recommendation; and 3) demonstrating the categorization of specific tasks in this area.", "2.1 Uniqueness of Recommendation in Fashion Domain": "In general, a recommender system [64, 126] aims to provide personalized online product or service recommendations to users by predicting their interest in an item based on given information of the items and users, as well as the interactions histories. Applications of recommender systems include recommendation of movies, music, television programs, books, documents, websites, conferences, scenic tourism spots, learning materials, etc [22, 70, 120, 139, 156]. They cover the areas of e-commerce, e-learning, e-library, e-government, and e-business services [104]. From this perspective, fashion recommendation can partly be seen as a specific application of recommender systems in e-commerce. There is no doubt that fashion is personalized, as most recommendation systems are designed for [154]. But beyond that, fashion recommendation may also need to consider fashionability or compatibility in different situations. The purpose of recommendation in fashion is not only to help users with over-choice [189], but also to provide styling or dressing advice for them [5, 20, 39, 40]. For example, for the complementary recommendation task, the main research problem is to model the compatibility between fashion items. There are more domain-specific challenges in fashion recommendation, which may result from the differences between fashion recommendation and recommendation in the general domain as summarized below: · Visual information matters more in the fashion domain than in most other domains. The very intuitive phenomenon is that one will not buy clothes or other fashion items without seeing them, physically or in a picture. Visual appearance plays an important role in the decision-making process of users when shopping for fashion items. Therefore, how to take good advantage of fashion product images to effectively leverage visual information is a key factor in fashion recommendation [181]. · Attributes are rich and fine-grained. Usually, fashion items have abundant attributes, many of which can influence the users' appreciation of the items greatly. Important attributes such as styles and colors have been explored in previous studies and found to be effective in helping improve the recommendation performance. [116]. However, on the other hand, fashion attributes are detailed and not easy to effectively incorporate, which is another main challenge in fashion recommendation. · Personalization is not the only criterion. Fashion recommendation studies not only the personalized fashion preference of users, but also the compatibility level between fashion items, or even the fashionability of single products. Since the research goal can be different from general recommendations, the problem formulation can be different and diverse when focusing on different aspects. · Exceptional data sparsity. Although sparsity is a widely acknowledged challenge in recommender systems, it is even more significant in the fashion domain as the item set is so huge. Svendsen has pointed out that the principle of fashion is NEW [147]. Unlike books or music, fashion items are updated very fast and constantly accumulates. Each item may have only been chosen by very few or even no users, which makes the interaction density of items very small. Therefore, existing methods, such as CF, that count on modeling the interactions between the user and item may not be less effective in the fashion domain [59].", "2.2 Terms or Concepts Frequently Used in Fashion Recommendation": "Some terms are frequently used in this survey and other fashion recommendation papers, which are briefly introduced here to help the readers understand this research area more easily without any confusion. In the , Vol. 1, No. 1, Article . Publication date: October 2021. 6 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua Fig. 1. Categorization of fashion recommendation tasks. Personalization Fashion recommendation Product recommendation Outfit recommendation Personalized product recommendation Personalized  Complementary product recommendation Complementary product recommendation Compatible outfit recommendation Personalized compatible outfit recommendation Compatibility Personalization Compatibility Personalization SECTION 3 Personalized recommendation SECTION 4 Complementary recommendation SECTION 5 Outfit recommendation fashion recommendation context, we usually have the user , who is the person we make the recommendation for. In the retailing context, a user usually refers to a customer while in other contexts such as fashion styling the user can be a client. The item specifically denotes the fashion product, which could be an item of clothing, a pair of shoes, a handbag, or other fashion-related products. An outfit is usually composed of multiple items from different categories, such as the combination of a top, a bottom, and a pair of shoes. The attributes generally denote features of the user/item that characterize them from certain angles. For example, if the color of the item is white, the color is one attribute of the item, and the corresponding attribute value is white in this case. Commonly explored item attributes include category , brand , color , pattern , price , material , size , style , etc. In terms of the user, possible attributes include occupation , body shape , color , etc. Taking occupation as an example, the corresponding attribute value can be a teacher . Other user attributes include body shape , age , color , etc. However, due to privacy considerations, user attributes have been barely explored in existing research. The attributes of either the user or item are also called the side information (or associated/affiliated information) in many other recommendation papers [162]. User preference/taste generally refers to what styles of product he/she likes, which is usually subjective and abstract. In the recommendation studies, it is actually reflected by the user's appreciation of different items or outfits, and whether he/she selects the item/outfit or not, which is hard to explain explicitly. Compatibility is a term frequently used to describe the relationship between two fashion items and specifically measures whether the two items complement/match each other.", "2.3 Categorization of Fashion Recommendation Tasks": "In the literature, we can find a large number of papers working on the same topic of Fashion Recommendation but focusing on quite different problems. For example, all the three papers [59, 68, 196] have Fashion Recommendation in their titles, but their problem formulation, proposed methods, experimental settings, including testing data and evaluation protocols are completely different. Specifically, Kang et al. [68] work on the task to recommend fashion items for given users by exploring the personal preference of users. Hu et al. [59] study how to effectively recommend fashion items for specific users, meanwhile to match with given items and make a good outfit. Zhou et al. [196], instead, study the task of recommending similar or compatible items for a given item. As we can see, , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 7 Table 1. Representative papers for various sub-tasks the term Fashion Recommendation refers to different research problems in different contexts or different research settings. Understanding the classification, or different variants, of fashion recommendation tasks is crucial for beginners in this area, which is also the preliminary objective of this survey. The variety of fashion recommendation actually results from the broad concept of 'recommendation', which can be interpreted in different ways. For example, tasks of recommending fashion items for certain users or to match with certain items can both be called fashion recommendation. As illustrated in Fig. 1, based on what to recommend, fashion recommendation can be categorized into two groups, i.e. , product recommendation and outfit recommendation. Fashion product recommendation generally refers to the tasks in which a single piece of fashion item is recommended. In comparison, fashion outfit recommendation aims to recommend a set of well-matched fashion items, which is more unique in the fashion domain. Considering the different recommendation requirements, product-level fashion recommendation can be further divided into personalized and complementary recommendations. The former focuses on personal preference modeling while the latter focuses on item compatibility modeling. Personalization modeling can also be involved in the complementary recommendation tasks to simultaneously explore the personal preference and item compatibility for more targeted functions. Different from product-level recommendation, fashion outfit recommendation is a more complicated and domain-specific task, which has attracted considerable research attention and produced a decent amount of literature. Outfit recommendation can also be divided into non-personalized and personalized varieties. The non-personalized outfit recommendation mainly works on the compatibility modeling of outfits, which focuses more at the level of set instead of pair. Similarly, the personalized outfit recommendation tries to explore additional outfit-level personal preference, which is usually beyond the simple combination of product-level preferences. There are other existing fashion recommendation studies tackling additional challenges on top of the typical user preference or item compatibility modeling. Some of them may focus on the recommendation task with special requirements or more detailed factors, such as the occasion-based / weather-based fashion recommendation or size recommendation. In Table 1, we summarize the representative papers addressing different sub-tasks, including P ersonalized F ashion product R ecommendation ( PFR ), C omplementary F ashion R ecommendation ( CFR ), F ashion O utfit R ecommendation ( FOR ) and S pecial F ashion R ecommendation ( SPR ).", "3 PERSONALIZED FASHION RECOMMENDATION": "P ersonalized F ashion product R ecommendation ( PFR ) aims to provide personal fashion suggestions for users, in most cases, suggestions about fashion products [45, 46, 68]. The goal of PFR is similar to that of personalized recommendation in the general domain, which is to explore personal preferences of users from their historical behaviors. Therefore, solutions for general personalized recommendation can be applied to address similar problems in the fashion domain. Nevertheless, PFR has its uniqueness in several aspects: 1) the visual features are very important to describe fashion items; 2) items that a user interacts with, together or at different times, are , Vol. 1, No. 1, Article . Publication date: October 2021. 8 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua Pre-trained Hierarchical visual features visual features Trainable visual Visual features Style Aesthetic and features visual features Global visual features and detailed attribute features Pre-trained visual features Hierarchical visual features Trainable visual features Visual evolution Style features Global visual features and Aesthetic and visual features detailed attribute features Fig. 2. Major development of personalized fashion recommendation based on basic BPR framework by emphasizing visual information. Listed methods in the figure from left to right: [47], [45], [68], [46], [98], [181], [54]. likely to be related; 3) fashion products are usually seasonal and trend-aware, so customers' general preferences change obviously over the seasons; and 4) the total number of fashion items is usually very large and long-tailed in most cases. New items are constantly emerging, which makes the data sparsity issue even more severe. Because of its uniqueness along with challenges, PFR has attracted special research attention in the literature.", "3.1 Problem Formulation": "Letting U and I denote the sets of user and item, containing 𝑁 𝑢 users and 𝑁 𝑖 items respectively. Each user 𝑢 is associated with an item set I + 𝑢 with which 𝑢 has interacted. In addition to those implicit feedback data, there is usually content information for the description of items, such as the images X ∈ R 𝑁 𝑖 × 𝐿 × 𝑊 × 𝐻 . The goal is to train a recommendation model 𝑓 which can predict the personalization score of any item 𝑖 for a given user 𝑢 , i.e. , 𝑠 𝑢,𝑖 = 𝑓 ( 𝑢, 𝑖 ) based on the modeled user preference. Given a user 𝑢 , by ranking the personalization scores of all candidate items 𝑠 𝑢,𝑖 1 > 𝑠 𝑢,𝑖 2 , ..., > 𝑠 𝑢,𝑖 𝑁 𝑡 , the model can generate a recommendation list [ 𝑖 1 , 𝑖 2 , 𝑖 3 , ..., 𝑖 𝑁 𝑡 ] specifically for 𝑢 , in which the items that 𝑢 likes more rank higher. 𝑁 𝑡 is the length of the recommendation list.", "3.2 General Methods": "Collaborative filtering is still the mainstream framework for PFR. Bayesian Personalized Ranking (BPR) [123] is an algorithm that aims to optimize the personalized ranking based on the implicit feedback (viewing, purchasing, etc.) of users with the system. Combined with the most basic matrix factorization (MF) model [75], MF-BPR has been a benchmark personalized recommendation algorithm, being simple, easily applicable but effective in many recommendation scenarios. Specifically, MF models the probability of user-item interaction with the dot-product operation based on the user and item representation as follows [75]:  where 𝛼 is the global bias, 𝛽 𝑢 and 𝛽 𝑖 are the bias specifically for 𝑢 and 𝑖 . 𝒆 𝑢 and 𝒆 𝑖 are embeddings of the user 𝑢 and item 𝑖 respectively. The model is trained by the BPR algorithm in a pairwise ranking manner as:  where 𝐷 = { 𝑢, 𝑖, 𝑗 | 𝑖 ∈ I + 𝑢 , 𝑗 ∈ I 𝑢 } , 𝚯 denotes all trainable parameters and 𝜆 is the hyper-parameter to balance the weight of regularization. The rationale of MF-BPR is to rank those items catering to the user (having interacted) as high and those the user is not interested in (having not interacted) as low. In the definition of the training set 𝐷 , I + 𝑢 and I 𝑢 denote the positive and negative items set for 𝑢 . In practice, I + 𝑢 is usually the collection of items that the 𝑢 has interacted with, showing the user's interest in these items, which therefore is definite. However, the negative item set is not explicitly defined since users do not label items they are not interested in. In this case, the common assumption in here is that items not being interacted by the user construct a negative set for the user, i.e., I 𝑢 = I - I + 𝑢 . Most existing PFR methods are developed based on the CF framework. However, since fashion is a domain in which visual factors are largely at play, most existing methods put effort into improving the incorporation of evolution , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 9 Fig. 3. Representative personalized fashion recommendation models. (a) Visual Bayesian Personalized Ranking (VBPR) [47]; (b) Introducing aesthetic features [181]; (c) Learning semantic attribute visual space [54]; (d) Bridging user comments with visual regions [14]. (a) (b) (c) (d) Hidden Dimension Sleeves Length Long Hidden   Dimension Unobser Neckline Hidden Dimension Trousers Length (a) Global Visual Space Semantic Attribute Visual Space 4096X 1 Item Arch. by Krizhevsky et al. Latent Factors Biases DXI Pretrained Embedding Prediction Deep CNN Item Visual Item Visual Features Factors Factors Factors User Pe-traied Predczon Ine Great material, loose fit around the waist By Maureen Button on November 2, 2017 Slze: Medium/US 8-10 Color: Black Verifed Purchase A Great material , loose fit around the waist. Nice wide Ineckopening; very stylish looking: absolutely love this tunic By Arazon Customer on November 30, 2017 Size: Small/ÙS 4-6 Color: Wine Verified Purchase B Nice quality  incredibly soft (especially the blue one) and really nice pocket ize. Received numerous compliments on this visual information to enhance recommendation performance. It is the common sense that \"One wouldn't buy a t-shirt from Amazon without seeing the item\" [47], demonstrating the influence of the visual appearance of items on users' purchase decisions in fashion. From another perspective, incorporating visual factors of fashion products can also alleviate the cold start issue [46, 47, 68], which is a serious problem in the fashion domain than in others as new fashion products are emerging more frequently as mentioned before. With these considerations, the development of PFR methods mainly goes along with the development of visual representation incorporation (as shown in Fig. 2) , which includes several main stages as follows: · Bayesian personalized ranking with visual features . He et al. [47] firstly propose the visual personalized ranking model ( VBPR ) to uncover visual and latent factors simultaneously by introducing the visual factors of users and items to the user-item interaction prediction as follows:  As shown in Fig. 3 (a), they project the high-dimensional CNN feature of fashion items to lower-dimensional 'visual rating\" space to obtain the visual factor of 𝑖 : 𝜽 𝑖 = Wv 𝑖 , where v 𝑖 is the CNN features and W is the projection matrix. Experimental results show that the recommendation performance was boosted with the introduction of visual factors. The authors also suggest that such performance boost is more significant on the clothing dataset than other categories such as phones, further demonstrating the special importance of visual information to the fashion domain. In another work, He et al. [45] propose to enhance the visual representation by encoding CNN features with different category-aware projections: 𝜽 ( 𝑐 ) 𝑖 = W ( 𝑐 ) v 𝑖 . They use a hierarchical embedding architecture which accounts for both high-level (colorfulness, darkness) and subtle (casualness) visual characteristics simultaneously, therefore achieving a better performance. , Vol. 1, No. 1, Article . Publication date: October 2021. 10 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua · VBPR with trainable features . To improve the incorporation of visual information, Kang et al. [68] propose to train the image representation and recommender system jointly rather than directly applying the pretrained visual features to the recommendation models. The experimental results in their work show that the introduction of the generative image model facilitates the recommendation performance on several clothing recommendation datasets significantly. From another perspective, He et al. [46] propose to consider the visual evolution in the recommendation model, trying to make the model not only visual-aware but also fashion-aware. Specifically, they build scalable models to capture temporal dynamics to help estimate users' personalized rankings with a one-class collaborative filtering framework. · VBPR with fashion-related features . The aforementioned methods encode fashion images into general visual representations, which is criticised for lacking fashion-specific information, such as aesthetics. Yu et al. [181] claim that when purchasing fashion products, consumers are not only concerned with 'what is the product\", but also with 'is the product good-looking\". Therefore, they propose to incorporate aesthetic features into the VBPR framework (Fig. 3 (b)), which are extracted from an additional aesthetic visual assessment model. Experimental results demonstrate the performance improvement of the recommendation model, proving the importance of aesthetic modeling in fashion recommendation. Similarly, Liu et al. [98] propose to incorporate the style features extracted by the DeepStyle model to enhance PFR. Instead of solely using global visual features, Hou et al. [54] propose to enhance the understanding of fashion items by incorporating attribute features. They introduce a semantic attribute space where each dimension corresponds to a semantic attribute and aim to learn users' fine-grained preference in various dimensions (Fig. 3 (c)). According to the experimental results, this method achieves a significant performance improvement over the VBPR. It is also able to generate explanations for the recommendation results, which makes the recommendation more convincing. Likewise, in order to introduce more explanation to the recommendation results, Chen et al. [14, 15] propose to link user comments with specific visual regions in the image (Fig. 3 (d)). They propose a model to explore the detailed interest of the users in terms of the visual part of the items to provide a reason for the recommendation. · Other efforts. To address the cold-start issue, Bracher et al. [8] propose to leverage both the visual features and 'expert labels\" to describe items, modeling more semantic information, which is proven more effective for the cold-start recommendation settings. From the training perspective, instead of using the standard BPR framework, Chong et al. [17] propose a novel minimax ranking-based learning scheme for the visual-aware recommendation and achieved state-of-the-art performance. They take advantage of both the visual features and co-purchase data, simultaneously maximizing the preference discrepancy between positive and negative items and minimizing the gap between positive and co-purchased items.", "3.3 Sequential Methods": "Different from the methods in the previous subsection targeting personalized recommendation only, Ding et al. [24, 25] work on the sequential fashion recommendation problem, which considers the sequential order of users' interactions with items and therefore can make the recommendation happen in the right time. Compared to the non-sequential recommendation introduced above, it models the item-item transition in addition to the user-item interaction for exploring the patterns of user behaviors. To this end, Ding et al. [25] propose to specify the transition between items by introducing the instant user intents, which can be substitute , match or others . In particular, they predicted the user's intent and based on the intent prediction results to predict the next item the user is likely to interact with. They leverage the intent modeling with basic translation-based sequential recommendation models [44]. In another work, Ding et al. [24] try to exploit the high-level user-item and item-item connectivity based on the basic tensor decomposition-based model FPMC [124], which effectively tackles the data sparsity problem and boost the overall recommendation performance. , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 11", "3.4 Summary": "As stated before, the visual factor is particularly important in the fashion domain. Therefore, existing methods of PFR emphasize the use of the visual information of fashion items and keep trying more effective ways to leverage it into the basic collaborative filtering frameworks. As illustrated in Fig. 2, the development of this specific research field goes along with the development of visual representation incorporation, from the very preliminary general visual feature as fixed additional information [47], to the trainable global and detailed visual features [54]. The recommendation performance keeps increasing with this development. Research from other perspectives also makes contribution in other ways, such as enhancing the credibility of the recommendation with explanations [54] or improving the accuracy by taking more advantage of behavioral correlations [24]. Despite the achievement of the existing research, there are still limitations in this field. The first limitation is in only focusing on visual features while ignoring other factors that are also unique and important in the fashion domain, such as seasonality. On top of that, fashion trend is another important aspect that has been overlooked in previous research, yet has a great impact on the recommendation performance [23, 24, 108, 117]. Moreover, exploring more dependencies and relations between user behaviors, even different types of behaviors (click or purchase), to better analyze and understand users would also be a promising direction for the next step in the development of PFR.", "4 COMPLEMENTARY FASHION RECOMMENDATION": "C omplementary F ashion R ecommendation ( CFR ) refers to the task of recommending compatible fashion item(s) to match with a given one, which is one of the mainstream research tasks in the field of fashion recommendation. In some papers, this task is also named fashion coordination/coordinates recommendation or mix-and-match recommendation [37, 61, 69]. The criterion for CFR is the compatibility between items. In the context of fashion analysis, compatibility measures whether two items in different categories (rarely in the same category) match/complement each other. Since compatibility is an abstract concept and difficult to be defined, mainstream CFR methods try to explore it from a large amount of available item-matching data. Such a task is named compatibility modeling , which is exactly the key research problem for CFR tasks [157], also the main focus in this section of the review. In general, a complementary recommendation is made according to the compatibility measurements between items. However, in reality, the quality of item matches is subject to the appreciation of people who are choosing or wearing them. In other words, personalization could play a role in the CFR, posing the P ersonalized C omplementary F ashion R ecommendation ( PCFR ). It integrates the modeling of both item compatibility and personal preference, therefore is more complicated, and has been relatively less studied so far. In this section, we cover more on the non-personalized CFR since it is one of the basic problems in fashion tasks and lays the foundation for many other high-level fashion recommendation tasks. For PCFR, we make brief reviews and discussions.", "4.1 Fashion Compatibility Definition": "As mentioned above, fashion compatibility represents how compatible when two or multiple items are together, in other words, whether the combination of items makes a good match/outfit. Since compatibility is a subjective concept, items matched well to one person might be not to another person. However, from the data perspective, if two items are frequently combined together in high-quality outfits, they can be deemed as compatible, otherwise not [42, 143, 157]. The way of items being combined together can be different in different situations. For example, users select several items to form an outfit, which usually happens in fashion community platforms such as Polyvore, or users just wear multiple items together, which can be found on social media. On top of these common situations, we can find another definition of compatibility posed in the Amazon Styles and Substitutes , Vol. 1, No. 1, Article . Publication date: October 2021. 12 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua dataset [110]. It defines two compatible items 𝑖 and 𝑗 as (1) 𝑖 and 𝑗 are frequently bought together or (2) customers who bought 𝑖 also bought 𝑗 [158]. This definition also follows the logic that two items being combined together are compatible, except here being combined is based on the users' purchase or click behaviors. However, in the fashion domain, compatible items should be those that are worn together well instead of bought together. Therefore, this definition is deemed to be less appropriate for the fashion domain, which has also attracted relatively less follow-up research attention. In this section, our review covers both definitions but focuses more on the first one because it is more reasonable and specific for the fashion domain.", "4.2 Problem Formulation": "Let I be the item set with 𝑁 𝑖 items. Each item 𝑖 ∈ I has a set of compatible items I + 𝑖 , in which each item 𝑗 + is well matched with 𝑖 . The goal of compatibility modeling is to build a predictive model 𝑓 that estimates the compatibility score 𝑠 𝑖 𝑗 = 𝑓 ( 𝑖, 𝑗 ) between any two given items ( 𝑖 and 𝑗 ). For any item 𝑖 , an effective model 𝑓 should be able to predict the score between 𝑖 and its compatible item 𝑗 + ∈ I + 𝑖 higher than that with its incompatible item 𝑗 -∈ I 𝑖 , and I 𝑖 = I - I + 𝑖 . A CFR model can therefore recommend proper items for a given item 𝑖 by ranking the compatibility scores of all candidate items. If personalization is considered, user information and user-item interactions are required. Let U be the user set, in which each user 𝑢 is interacted with multiple well-matched item pairs ( 𝑖, 𝑗 ) , producing a set of triplets T = {( 𝑢, 𝑖, 𝑗 )|Y( 𝑢,𝑖,𝑗 ) = 1 } , Y ∈ R 𝑁 𝑢 × 𝑁 𝑖 × 𝑁 𝑖 represents the user-item pair interaction tensor. The target of PCFR is to train a model 𝑔 able to score any triplet 𝑠 𝑢,𝑖,𝑗 = 𝑔 ( 𝑢, 𝑖, 𝑗 ) based on the personalization and compatibility measure. Given a user 𝑢 and an item 𝑖 , an effective model should score the suitable item 𝑗 + higher than unsuitable ones 𝑗 -, i.e. , 𝑠 𝑢,𝑖,𝑗 + > 𝑠 𝑢,𝑖,𝑗 -, where ( 𝑢, 𝑖, 𝑗 + ) ∈ T and ( 𝑢, 𝑖, 𝑗 - ) ∉ T .", "4.3 Complementary Fashion Recommendation Methods": "The key to achieving high-quality complementary recommendation is the effective modeling of compatibility between items. In order to make a clear introduction, we categorize existing methods for compatibility modeling into three main groups: 1) topic model-based methods; 2) metric learning methods; and 3) graph-based methods 7 . It needs to mention that such a method categorization covers the majority of existing methods in this sub-area but still leaves a few that do not belong to any one of the three, which we will also introduce as other methods at the end of this sub-section. Moreover, many methods are developed based on more than one basic technology or idea, our categorization is based on the main paradigm that each method follows. 4.3.1 Topic Model-based Methods. Early-stage studies address the compatibility modeling problem with topic models, specifically, the adapted Latent Dirichlet Allocation (LDA) methods [61, 62, 197]. LDA is a probabilistic generative model which has been successfully used for a wide variety of applications including information retrieval, collaborative filtering, and image modeling. It has also been applied in the fashion domain for other relevant tasks such as style analysis [55, 155]. From the perspective of topic modeling, a fashion outfit can be seen as a documents covering several main topics and attributes can be seen as words . As shown in Fig. 4 (d), the idea is that well-matched item pairs will have a certain topic proportion, meaning different items should have close topic proportions to make a good match together. Iwata et al. [61] proposed to use LDA to learn co-occurrence information about visual features in top and bottom regions in full-body street photos to capture the coordinates. They tested the proposed method with three relevantly small datasets, which has been criticized as not being enough to ascertain the effectiveness of the method [62]. Combined with Gaussian Mixture Models (GMM), Jagadeesh et al. [62] learn topic patterns of different fashion items, aka, compatibility in a more efficient manner. When the model is well learned, given a query item, such as a shirt, the model firstly predicts the topic distribution and accordingly samples Markov Chain to generate 7 We focus on pairwise compatibility modeling in this section and leave the outfit-level compatibility to the next section. , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 13 Fig. 4. Four representative methods for pairwise fashion compatibility modeling. (a) Learning global compatibility space [158]; (b) Applying decision tree [175]; (c) Graph-based method to leverage context information [18]; (d) Topic modeling method [61] (a) (b) (c) (d) Style space fullbody vsual features topic visual query topl photos for each region proportions teatures photo don't fit CNN bottom CNN CNN own bottom topic photos model @ db-0 Loss do BPR~Training Prediction Score recommended bottom Joint Modeling find bottom that has the recommend closest topic proportions to Tij = system the query top Attentive Decision Rules Reweighting Attribute-based Decision Rule Embedding CNN ves yes Compatibility Decoder yes scorC yes Tree Tree Tree Item images Item attributes Item attributes Light-blue Stripe Jeans High-rise Sleeveless new transformed samples to retrieve the nearest complementary items for matching. In comparison, Zhou et al. [197] propose a more complicated method, which trains two hybrid topic models for the upper-body and lower-body clothes respectively to obtain the clothing representations, and then measures the compatibility with another collocation topic model. But the idea of a collocation topic model to capture compatibility patterns is quite similar to the previous two. We can also observe that with the development of relevant technologies, visual features used in these three representative methods keep upgrading, from color histograms to CNN features, which enhances the model from another perspective. However, these topic model-based methods apply the straightforward probabilistic model, which makes the performance rely more on the quality and choice of item features, i.e. , the input of the model instead of the model design. 4.3.2 Metric Learning Methods. Alarge number of methods tackling the compatibility learning problem follow an established metric-learning paradigm [48, 77, 145, 173] with three main steps: (1) collect a large dataset of compatible (and non-compatible) items; (2) propose a parameterized similarity function; and (3) train the parameterized function to make compatible fashion items more 'similar' than non-compatible ones. The 'similarity' actually means compatibility, which is measured based on the learned representation of fashion items. Such representation space is therefore also called compatibility space. Following this paradigm, early-stage methods [158] try to learn a general latent space based on visual features, in which the distance can measure the compatibility of any two fashion items, as shown in Fig. 4 (a). However, such a simple one-compatibility space learning model may be less expressive, therefore, He et al. [48] propose a multi-space learning model and adopt the mixtures-of-expert framework to obtain multiple notions for more comprehensive item features, which achieves more robust compatibility prediction. From another perspective, Lin et al. [92] propose to learn the multi-modal compatibility between two , Vol. 1, No. 1, Article . Publication date: October 2021. 14 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua items by combining the compatibility measure in each modal. Different from pairwise learning methods, Chen et al. [12] extend traditional triplet neural networks to learn the compatibility patterns from well-collocated and bad-collocated samples, changing the common pairwise learning scheme into triplet-wise. These early-stage methods treat compatibility as a form of similarity , which is not necessarily correct since compatibility is NOT transitive as similarity is. For example, if item 𝑖 is close to both 𝑗 and 𝑘 when mapped into a general latent space, meaning 𝑖 is compatible with both items, 𝑗 and 𝑘 would be close too in the latent space. In that case, 𝑗 and 𝑘 would be compatible, which is apparently not true when 𝑗 and 𝑘 belong to the same category. To fix this limitation, type-specific space learning methods are proposed [48, 157], which aims to learn spaces relating to item types/categories, or the type pairs. There are also cases where category information of items is not available. For these cases, Tan et al. [148] propose a method of learning implicit substitute compatibility spaces to emphasize different semantic information ( e.g. , type pair). Such an idea is quite similar to He et al. [48] mentioned above. They suggest that the learned implicit sub-spaces are able to capture compatibility between items specifically conditioned in certain semantic concepts, such as color or detailed design. The experimental results demonstrate a better performance compared to the basic Siamese Net-based method [158], as well as some of those learning explicit type-aware spaces [157]. 4.3.3 Graph-based Methods. Graph techniques have been widely applied for fashion compatibility modeling for their power to model unstructured data and relationships in different ways. The first way is to use knowledge graph embedding learning techniques to model category-specific compatibility relations. Yang et al. [176] propose a translation-based method (TransNFCM) using TransE to model pairwise item compatibility (between item 𝑖 and 𝑗 ) based on the embeddings of items ( e 𝑖 and e 𝑗 ) and a category-comp-category relation embedding ( r 𝑐 𝑖 𝑐 𝑗 ) as:  Following this work, Li et al. [84] propose to apply TransR instead of the TransE operation and a new negative sampling strategy, which achieve better compatibility learning performance. Another motivation for applying graph methods is to leverage more connectivity for the enhancement of the item representation learning [18, 174]. Most pairwise compatibility learning models only rely on item information and pairwise compatibility relation, while overlooking the context information, such as the connectivity with other items co-existing in the outfits. To effectively leverage the context information, Cucurull et al. [18] propose a model based on Graph Auto-encoder (GAE) [73] which applies convolutional message passing and information aggregation as shown in Fig. 4 (c). Other than the matching (compatible) relationship, Yang et al. [174] propose to consider more heterogeneous relationships to incorporate richer extra-connectivity. Specifically, they encode the items and the connectivity using a graph modeling different relationships between items, such as purchased together by user or also viewed by user in this work. Experimental results validate the effectiveness of such a technical improvement. The additional relationships leveraged help to characterize the structural properties of items in a real-world e-commerce environment, and can thereby enhance the compatibility relationship modeling. 4.3.4 Other Methods. On top of the three main groups of methods, Yang et al. [175] propose a non-metric method based on the decision tree. Their method enables the incorporation of rich attribute information of fashion items and connects item-level compatibility with specific attributes, offering an explicit and interpretable solution for the target problem. Boosted tree models are applied and defined as an ensemble of 𝑇 decision trees. They obtain the embedding of the 𝑡 -th decision rule by combining the decision state embedding of all attributes:  where fi a 𝑧 = a 𝑧 + s 𝑧 is the decision state of the 𝑧 -th attribute that combines attribute embedding a 𝑧 and its decision embeddings s 𝑧 , 𝑍 is the total number of attributes. The proposed model manages to explicitly model the high-order attribute interactions. The final prediction is made by combining the visual and rule features (referring , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 15 to Fig 4 (b)). The experimental results show that this method achieves good accuracy and interpretability. Also targeting better interpretability, as well as improving the recommendation accuracy, Song et al. [142] propose to distill the matching knowledge from the matching dataset and inject the knowledge into the model to refine the compatibility space learning and achieve improved performance. Another promising direction to improve complementary recommendation performance is jointly learning complementary recommendation models with other relevant tasks. For example, Dong et al. [31] propose to join the try-on task with the compatibility modeling, seeking to use the try-on appearance to guide and improve the outfit compatibility evaluation. Liu et al. [95] employ generative adversarial networks (GANs) to sketch a compatible template as the auxiliary link between fashion items to enhance the item compatibility modeling with the item-template modeling. Moreover, Lin et al. propose to combine fashion image [92] and comment generation [91] respectively with the compatibility modeling task and prove these generation tasks can enhance the compatibility modeling through joint learning. To better sort out the pairwise compatibility modeling research, we summarize representative papers in this area that have been published in recent years in mainstream conferences and journals in Table AI in Appendix, in which we categorize the method of each paper to different groups from the perspectives of input, dataset and evaluation setting. Please see Appendix for more information.", "4.4 Personalized Complementary Fashion Recommendation Methods": "PCFRis defined as the problem to recommend suitable fashion items for a given user and item. Since recommended items need to be compatible with the given item and meanwhile preferred by the given user, both compatibility and personalization play important roles in this task. Different from the methods reviewed in Section 3 and the above sub-section which only consider one-side requirement (personalized or compatible), PCFR needs to explore two types of relations from the data: user-item interaction and item-item compatibility. To address the problem, Song et al. [144] propose a VBPR-based framework that includes pairwise compatibility modeling between fashion items, with the personalized compatibility score as  where 𝑠 𝑖 𝑗 and 𝑠 𝑢𝑗 are compatibility and personalized score respectively. The personalized score 𝑠 𝑢𝑗 can be obtained in the same way as in Eqn. 3. For the compatibility score, they use a similar dot-product operation to calculate based on multi-modal content features as:  where v and w are visual and textural features for corresponding items, 𝜋 is the hyper-parameter to balance two parts, so as the 𝜇 in Eqn. 6. A following work [128] brought more interpretability to the GP-BPR model by leveraging more item attributes and attribute-level user-item and item-item relationship modeling. Despite the effectiveness, these methods only consider the linear combination of two objectives of modeling, i.e. , personalization and compatibility, which is straightforward. In fact, from the experimental results of GP-BPR [144], we can observe some imbalance between the two parts of modeling. Such a result seems reasonable since the two objectives to model are separate from different perspectives yet are coupling when observed in specific behaviors. Just like other tasks making predictions with multiple factors, PCFR needs to capture the personalization and compatibility patterns coupling in real-world data, which may raise many challenges, including but not limited to the imbalance learning problem.", "4.5 Summary": "CFR has experienced great development in the past few years and turned into one of the basic tasks in the computational fashion area. The key problem in CFR is modeling the compatibility between fashion items, which has been formulated in different ways and addressed with methods based on different types of techniques, such , Vol. 1, No. 1, Article . Publication date: October 2021. 16 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua as metric learning, topic models, graph models, decision trees, and so on. After years of development along with advanced computational technologies, the performance of CFR methods have been generally improved. However, most of the existing methods of compatibility modeling are completely data-driven and try to fit the fashion-matching data to explore the implicit compatibility patterns. Even though data-driven solutions provide new perspectives in fashion compatibility evaluation besides the traditional human-centered ways of evaluation, they are heavily dependent on the data, which might result in biased or bad results. For example, currently, the most commonly applied datasets are Amazon and Polyvore. For the Amazon dataset, we have mentioned in Section 4.1 that the definition of compatibility is not appropriate for the fashion domain. Based on this dataset, models can only learn to predict items that would get clicked or bought together, not get matched together. The other group of datasets, i.e. , the Polyvore datasets, contains outfits generated by different online users, which are therefore not necessarily highly compatible as assumed. Under this circumstance, purely data-driven models can hardly explore good compatible patterns and make good recommendations. In fact, there might be some general rules that fashion experts or professionals follow when they evaluate compatibility on item collocations, for example, the match of colors, categories, or printings. Such matching rules have also been used in computational fashion recommendation studies. Zhou et al. [196] apply them to define matching categories and attributes so that they can make CFR based on item images, which turns the key research problem into accurate detection of categories and attributes. Such a solution has its limitations. On one hand, defining matching rules requires strong expertise in fashion, which can only be accomplished by fashion professionals with subjectivity. On the other hand, even though the defined rules are solid, they can only measure the compatibility between items from a single or partial perspective, unable to provide comprehensive compatibility measurements. Nevertheless, it offers inspiration that data-driven methods might be able to take advantage of this domain knowledge by introducing some solid rules. An existing attempt [142] employs the teacher-student network scheme with an attentive knowledge distillation component to distill and incorporate matching rules to facilitate the neural network-based compatibility learning model. From another perspective, most existing methods follow an implicit modeling scheme, which limits the explanations and persuasiveness of the recommendation models. Incorporating external domain knowledge maybe a possible solution to address it here. Besides, considering content-level compatibility [128], learning specific reasons for the judgment of compatibility [198] or other methods are all promising and achieved good preliminary results, but still leave large possible spaces to explore. Moreover, most existing methods simply adopt some general solutions or bring more fine-grained features to the overall recommendation models to add interpretability. However, few of them exposed matching laws from a data perspective, which will make a real contribution from the computer science perspective to addressing the CFR problem.", "5 FASHION OUTFIT RECOMMENDATION": "F ashion O utfit R ecommendation ( FOR ) generally refers to recommending a set of fashion items to users that match well with each other, which relies on effective outfit compatibility modeling. Depending on whether the personal tastes of the various users are considered, FOR can be further divided into non-personalized and personalized FOR. On top of outfit compatibility, P ersonalized FOR ( PFOR ) models users' personal preference towards outfits, which has attracted increasing research focus in recent years since personalization plays a key role in most fashion-related tasks. Unlike the personalized fashion recommendation reviewed above, which only explores the users' preferences towards a single fashion item, PFOR focuses on modeling users' tastes toward a combination of fashion items. In early research [28, 137], outfits are treated as the minimum unit of analysis, and specific items in the outfit are not considered. For example, images of people dressed in outfits are frequently studied to investigate the fashionability or suitability of the outfits. More recently, FOR research incorporates , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 17 item-level details. The user preference towards outfits is related to the specific preference towards single items in the outfit but beyond the simple combination of item-level preference.", "5.1 Problem Formulation": "Let U , O , I denote the user, outfit and item sets respectively. Each outfit 𝑜 ∈ O is a set of items { 𝑖 𝑜 1 , 𝑖 𝑜 2 , ..., 𝑖 𝑜 | 𝑜 | } , where 𝑖 𝑜 ∗ ∈ I . Each user 𝑢 is interacted with a set of outfit O + 𝑢 = { 𝑜 𝑢 1 , 𝑜 𝑢 2 , ..., 𝑜 𝑢 | O + 𝑢 | } , where 𝑜 𝑢 ∗ ∈ O . Outfit compatibility modeling aims to train a model 𝑓 to measure the compatibility of a set of fashion items to tell whether they can make a good outfit. A common task setting is to predict the item for a subset of outfit 𝑜 with one item missing. Specifically, given ˆ 𝑜 = { 𝑖 𝑜 1 , 𝑖 𝑜 2 , ...𝑖 𝑜 | 𝑜 | -1 } , the model needs to predict the missing item by measuring and ranking the compatibility of the completed outfits filled with a given item 𝑖 : 𝑓 ( 𝑖 | ˆ 𝑜 ) . The task is to rank candidate item 𝑖 which is compatible with ˆ 𝑜 higher than those that are not, which means 𝑓 ( 𝑖 | ˆ 𝑜 ) > 𝑓 ( 𝑗 | ˆ 𝑜 ) , 𝑖 ∪ ˆ 𝑜 ∈ O and 𝑗 ∪ ˆ 𝑜 ∉ O . PFOR aims to recommend a list of outfits to a user, each consisting of a set of compatible fashion items. To this end, it needs to train a model 𝑔 that can predict the personalization score between the given user 𝑢 and the outfit 𝑜 as 𝑠 𝑢,𝑜 = 𝑔 ( 𝑢, 𝑜 ) , measuring whether the outfit is preferred by the user. Since 𝑜 = { 𝑖 𝑜 1 , 𝑖 𝑜 2 , ...𝑖 𝑜 𝑁 𝑜 } , items in the outfit are treated as input of the function in many cases, turning the prediction model into 𝑠 𝑢,𝑜 = 𝑔 ( 𝑢, 𝑜, 𝑖 𝑜 1 , 𝑖 𝑜 2 , ...𝑖 𝑜 𝑛 𝑜 ) . An effective model should be able to predict a list of outfits [ 𝑜 1 , 𝑜 2 , ..., 𝑜 𝑁 𝑡 ] for a given user 𝑢 , in which the outfits are ranked by personalization scores, consistent with the user preference.", "5.2 Outfit Compatibility Modeling Methods": "Outfit compatibility modeling can be seen as an extension task of pairwise compatibility modeling (the focus of Section 4). It aims to predict the compatibility score for a given outfit, namely a set of items, which is also known as outfit composition evaluation. The general pipeline of outfit composition evaluation is to extract the effective feature for every item in the outfit and then calculate the overall compatibility score based on all item features. As shown in Fig. 5, we detail the whole pipeline into three procedures: item embedding generation, outfit modeling, and compatibility discrimination. 5.2.1 Item Embedding Generation. Item embedding generation, also called item feature extraction, aims to represent content information of items with effective representations, which can be achieved based on the either uni-modal or multi-modal item information. One common way is to extract multimedia features from visual and textual information. Many existing outfit compatibility modeling methods [19, 42, 90, 165] adopt this method and apply Visual Semantic Embedding (VSE) technology [74] to better integrate the two-modal features. Such an item embedding generation process is involved in the other two tasks too, i.e. , personalized recommendation, and complementary recommendation, which therefore can be seen as a general problem in the area of fashion recommendation. We, therefore, discuss it in an independent part in Section A.1. In this section, since Outfit is the focus, we emphasise the outfit modeling methods in existing work. 5.2.2 Outfit Modeling. Outfit modeling specifically means the procedure that aggregates item-level representations to obtain the holistic representation of the outfit, which can be seen as a multi-instance pooling process. Different technologies can be applied to implement such a multi-object modeling and aggregation process. In existing work, the preliminary non-parametric feature concatenation, average pooling operation, and advanced neural network tools such as RNN, GNN, and Attention mechanism, have all been applied. Here we summarize existing work with regard to different outfit pooling methods they apply. · Non-parametric Pooling methods are commonly used in different tasks for their merits of being feasible, easy-to-use, and efficient. In outfit modeling, non-parametric pooling methods such as concatenation [150] and element wise reduction [82] have been used. However, these simple aggregation methods may fail to model the complex dependency among outfit items, therefore would require more complicated techniques. , Vol. 1, No. 1, Article . Publication date: October 2021.", "18 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua": "Fig. 5. General pipeline for outfit compatibility learning, which roughly includes three steps: 1) item embedding generation, 2) outfit modeling based on item embeddings, and 3) outfit compatibility modeling. Item embedding generation Outfit modeling Text encoding Image encoding RNN GNN Transformer Single or multi-modal € Rdr", "Compatibility discrimination": "Classification or Regression Outfit-level or Item-level Compatible? min Binary Classifier Feature Concat X4 · Sequence Modeling are widely applied for outfits. The rationale to apply sequence models is to learn the dependency between compatible fashion items when given a pseudo order among items. By modeling the whole ordered item sequence, the outfit representation can be obtained, which contains compatibility information of the outfit. If the sequence models are well-trained, they are able to predict missing items in the outfit or predict compatibility for any given outfit. Specifically, Han et al. [42] propose to apply the bidirectional Long ShortTerm Memory (LSTM) model for the outfit, considering a collection of clothing items as a sequence with specific order. They input the features of each fashion item into the corresponding time step of the LSTM structure. This work contributes to the research field by effectively taking advantage of the representation power of LSTM, thereby providing a feasible solution to model the multiple items composition. Several follow-up papers propose variant approaches with similar RNN frameworks [30, 66, 115]. For example, Li et al. [82] adapt RNN as a pooling model to encode variable numbers of fashion items and obtain the outfit representation. However, it has been acknowledged in recent studies that modeling fashion outfits as sequences are not appropriate as the items in the outfit should be order-less. · Graph Modeling methods, instead, treat fashion outfits as unordered sets of items and model them with Graph based on the compatibility and other relations. As mentioned before, simply averaging pooling or other linear aggregation cannot exploit the complex relations among multiple items, while sequence modeling encodes some order information that does not exist. In comparison, graph modeling offers a more sophisticated way to explore dense and complex relations among items, therefore has attracted significant research attention in recent years and shown preferable performance. In specific, Cui et al. [19] construct a Fashion Graph in which each node represents a category and each edge represents the interaction between two nodes. By putting each item into its corresponding node, an outfit can be represented as a subgraph of Fashion Graph , and the task of modeling outfit compatibility can be accordingly converted to a graph inference problem. Specifically, they propose Node-wise graph neural networks (NGNN) to model the node interactions and learn node representation, further obtaining the outfit representation after item aggregation. Experimental results show that this performance is better than the LSTM-based model applied in Han et al. [42]. Similarly, Feng et al. [36] construct an Outfit Composition Graph taking item cluster center as nodes, which is achieved through the aggregation of color, shape, texture, and other item embeddings. The edges (connectivity between different clusters) are determined by the observed pairwise item-matching relations in different clusters. The final composition score of the graph can be inferred from the graph. Singhal et al. [138] build a type-conditioned graph autoencoder to learn a compatibility measure conditioned on type and context. They also introduce an attentive autoencoder that learns a style measure of compatibility through an outfit-level style representation. The whole model is trained with a reinforcement learning manner to learn a unified measure of compatibility. Liu et al. [100] and Li et al. [81] also apply the graph structure to model the outfits. Zheng et al. [194] proposed , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 19 a disentangled graph learning method to explore implicit fine-grained compatibility between items. It also incorporates try-on analysis to evaluate the overall compatibility of outfits. To explore modality-specific compatibility, Song et al. [141] proposed the modality-oriented graph learning method. · Attention Mechanism Modeling is another feasible way to achieve unordered set modeling, applicable for the modeling of outfits and exploring the inherent outfit structures. Chen et al. [13] adapt Transformer, a transduction model relying on self-attention to build the Fashion Outfit Model (FOM) for the modeling of multiple fashion items in the outfits. It learns outfit compatibility by the masked items prediction task, which inputs item set (outfit) with one position masked and predicts the item for it accordingly. Sarkar et al. [129] embrace a similar idea of applying a Transformer encoder for outfit modeling and propose OutfitTransformer. Differently, for the outfit compatibility prediction task, they introduce an outfit token to capture a global outfit representation in the Transformer structure, which encodes the compatibility relationships among all the items in the outfit. Different from the above two methods borrowing the Transformer architecture, Yang et al. [178] propose a Mixed Category Attention Net (MCAN) that integrates category information to model the dependency and relations between items with the self-attention net (SAN). Li et al. [87] propose a Content Attentive Neural Network (CANN) that models the comprehensive compositional coherence of both the global contents and semantic contents among items in the outfit. The model is able to outperform RNN-based [42] and pairwise-based compatibility models [157] for the outfit compatibility prediction task. There are some other outfit modeling ways on top of the above four groups, for example, Multi-Layer Perceptron (MLP) [165], but contribute quite a small portion. Since outfit modeling is quite a key technical part in the whole area of fashion recommendation, we summarize mainstream methods for the task and categorize them with different outfit modeling ways in Table AII in Appendix. The corresponding input and evaluation settings for each work are also listed with the taxonomies given in Table 2 Section A.1. From the summary we observe that early studies adopt non-parametric pooling or sequence modeling while the recent methods prefer graph and attention modeling, which have been discussed to be more appropriate and have better expressive ability. From the comparison between experimental results with different methods, the graph, and attention methods can generally achieve better performance compared to the former two in terms of outfit compatibility prediction or missing item prediction for outfits. Putting aside the improper outfit modeling with orders, the RNN models are powerful for modeling data with chronological dependency while the outfit structures are obviously not. Moreover, items can be related in various ways, but RNN models can only capture sharing outfit relationships, which may degrade its performance in this task. In comparison, graph or attention models are more flexible and powerful to model multiple types of item relationships as well as content information. However, one big concern is how to effectively train powerful models given limited data resources. From another perspective, these two types of methods need more computational space and time compared to the RNN-series methods and thus are less efficient. Moreover, when compatibility modeling is not the only objective in the task, such as PFOR, designing too complicated outfit modeling model might not worth it, sometimes just as effective as the average pooling operation based on our empirical observations. 5.2.3 Compatibility Discrimination. When the outfit structure is properly modeled, the next problem is how to predict its compatibility accordingly, which is usually dependent on the way to model outfits. For most sequence modeling/Transformer methods [13, 30, 42, 66], the compatibility of the whole outfit is mostly evaluated by the average of the probability of item in each position:  where 𝑛 = | 𝑜 | is the length of outfit 𝑜 , 𝑃𝑟 (·|·) is the conditional probability that has been produced by the sequence model, and 𝑥 𝑡 denotes the output of the 𝑡 step. The specific calculation varies for different methods. For example, , Vol. 1, No. 1, Article . Publication date: October 2021. 20 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua Fig. 6. Two common pipelines (orange and blue) for personalized outfit preference modeling. The orange one models the user-outfit compatibility based on the item-level user preference while the blue one directly models that based on the outfit and user representations. User-Outfit compatibility User-Item compatibility Outfit representation Item-level score aggregation Compatibility calculation 𝑢 𝑖 1 𝑖 2 𝑖 3 𝑖 4 𝑜 𝑠 ( 𝑢 , 𝑖 1 ) … 𝑠 ( 𝑢 , 𝑜 ) 𝐴𝑔𝑔𝑡 ( 𝑠 𝑢 , 𝑖 𝑡 ) 𝐹 ( 𝑢 , 𝑜 ) 𝐹 ( 𝑢 , 𝑖 1 ) 𝐴𝑔𝑔𝑡 ( 𝑖 𝑡 ) Outfit representation generation/refining Item-level compatibility calculation for Bi-LSTM models, two-directional predictions are included for the probability measurement [42]. In another work when category information is bonded with item representation for the outfit modeling, the joint distribution of the category and item tuple is considered to measure the outfit compatibility [178]. On top of sequential probability evaluation, outfit compatibility can be modeled based on the item-wise compatibility [19]:  where 𝑓 and 𝑔 are two perception networks to model the weights and compatibility score for each item, 𝜎 and 𝛼 are leaky relu and sigmoid activation functions. The two parts in the multiplication model the importance of the item in the outfit and the compatibility level of the item respectively. Li et al. [82] treat the outfit evaluation as a binary classification problem and device a compatibility predictor on the outfit representation as:  where 𝑒 𝑜 ∈ R 𝑑 is the representation of outfit 𝑜 , 𝑦 𝑜 is the ground truth outfit compatibility measurement of 𝑜 , 𝑦 = 1 means compatible and 𝑦 = 0 means not.", "5.3 Personalized Outfit Recommendation Methods": "PFOR aims to recommend well-matched outfits to users that cater to their personal tastes. In the early stage, outfits are usually treated as the minimum unit to analyse. For example, Simo-Serra et al. [137] make use of a Conditional Random Field (CRF) to evaluate the fashionability of fashion photos by analyzing the outfits (garment worn by people), people, and photo settings (background scene). They then make outfit recommendation based on the fashionability scores. Zheng et al. [193] also investigates the personalized fashion recommendation problem solely based on the outfit images. With the area developed, current mainstream PFOR methods consider the intra-outfit item compatibility and the user's outfit preference. In other words, the compatibility of outfits and between users and outfits both need to be modeled. Existing approaches usually address the two modeling objectives separately. Outfit compatibility modeling has been introduced in the previous sub-section, leaving the rest of user-outfit compatibility modeling, which is equivalent to exploring the user preference for outfits. It is achieved in two general ways, as briefly illustrated in Fig. 6. The first common way (the orange lines in Fig. 6) evaluates the user preference for outfits based on the integration of item-level preference on the items [30, 59, 90, 106] while the second way (the blue lines) obtains the outfit level representation based on item information first and then measures the user-outfit compatibility based on outfit and user representations [84, 90, 186]. Hu et al. [59] conducted an early study on PFOR and propose a tensor factorization-based method, which basically follows the first pipeline shown in Fig. 6. The proposed method learns the personalized user preference , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 21 for each item and the item-item compatibility in the outfit at the same time through functional tensor factorization. Lu et al. [106] then apply a similar strategy to model the relationship between users, outfits, and items, except that they aim to obtain a binary representation of these objects to deliver better personalized outfit recommendation. For the personalized capsule wardrobe creation task, which can be formulated similarly to PFOR, Dong et al. [30] leverage the user body shape to the modeling of item compatibility among outfits, successfully train a model to provide body shape-aware PFOR. From another perspective, Lin et al. [90] propose an attentional fusion method that calculates the personalized item scores for the outfit first and then applies an attention pooling layer to generate the personalized outfit score. Following the second scheme of user-outfit modeling, Lin et al. [90] propose to fuse the item embeddings in the outfit with a personalized attention mechanism to generate the outfit embedding. They also conduct comparison studies for different settings with compatibility scoring at different stages, corresponding to the two pipelines we summarize in Fig. 6. The experimental results show that generating outfit representations first and scoring based on user and outfit representations (the blue line pipeline in Fig. 6) may achieve better personalized outfit recommendation performance than early scoring the user-item compatibility. However, the experimental results also suggest that evaluating the user-item compatibility first could be more helpful for the cold-start scenarios. Rather than generating outfit representation completely based on items, Li et al. [81] assign each outfit an outfit id to take better advantage of the collaborative signals between users and outfits. To enhance the outfit representation, they apply message passing on the outfit-item graph to aggregate item information into outfit representation. They use the collaborative filtering strategy to model the user-outfit compatibility after obtaining an enhanced representation. On top of the common item information, a very recent work [186] leverages the knowledge graph with rich item- and outfit-level attributes to further enhance the outfit representation. They also exploit outfit information to enhance the user representation, which helps their method to achieve state-of-the-art PFOR performance.", "5.4 Outfit Generation Methods": "Fashion Outfit Generation (FOG) can be regarded as a pre-task of FOR, which is commonly defined in two forms: 1) generating the outfit images from scratch [3, 63, 127, 180], and 2) making a collocation of items to generate the outfit. The first task focuses on image generation rather than outfit composition [100, 197]. In this paper, we only discuss the second task because the first task is a complete CV problem, not the focus of this survey. The basic standard for FOG is completeness across categories and exclusiveness within the category, while the quality of the generated outfit is determined by the compatibility among the items [26]. It is formulated as a retrieval problem in many existing work. Chen et al. [13] propose a transformer-based FOG model that encodes user preference in OG. They specifically generate the items in the outfit step-by-step in an auto-regressive manner, which consumes the previously generated items as input. Li et al. [80] apply a similar iterative generation procedure. At each step, they rank all candidate items of the chosen type based on coherence and item-item compatibility. Lin et al. [90] first train a fashion compatibility model which can generate item embedding involving compatibility information. Then they interactively expand the outfit by adding items that are closest to the outfit. A special form of FOG is the capsule wardrobe creation [30, 56]. Capsule wardrobe is a concept that uses a minimal quantity of clothing to create many outfits. Therefore, the task is to build a minimal clothing set from which items can be combined together and generate good-quality outfits. Hsiao et al. [56] cast the capsule wardrobe creation as a subset selection problem which selects a subset from a large set of candidates that maximize compatibility and versatility. They define objective functions based on these two objectives and develop an EM-like iterative approach for optimization. In a further step, Dong et al. [30] propose to consider profiles in the model with a combinatorial optimization framework which jointly integrates garment and user modeling. , Vol. 1, No. 1, Article . Publication date: October 2021. 22 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua", "5.5 Summary": "OR has experienced significant development in the last few years attributed to the research efforts from the information retrieval and multimedia communities. The task has been established and addressed in many different ways based on advanced neural network technologies. However, the research on FOR is still in its nascent stage and has several limitations. First, the outfit compatibility modeling and PFOR tasks are tackled in isolation. In several studies, compatibility modeling serves as a pre-training process to generate an initial representation of fashion items for the main FOR task [13]. Most state-of-the-art studies involve item-level compatibility modeling and outfit-level user preference modeling as two separate sub-tasks and evaluate their proposed models on these two sub-tasks independently. Second, the evaluation for FOR is not quite solid so far. For example, Li et al. [81] target the modeling of outfitlevel user preference and apply the ranking evaluation on different methods, similar to general personalized fashion recommendation. However, such an evaluation does not suit generation-based FOR, in which the compatibility level of the generated outfit is not guaranteed. In the generation-based FOR by Chen et al. [13], online evaluation is applied, while it is not applicable to all studies, therefore obstructing the technical development to some extent. Third, in existing FOG methods, the outfits are generated iteratively, for example, auto-regressively consuming a previously generated item as the input of the next [13]. Such methods still assume that the outfit is in order, which is inappropriate, as pointed out in many papers [19, 35]. There is a need to develop better FOG models which can create the item set in parallel rather than one by one.", "6 SPECIAL FASHION RECOMMENDATION": "Faced with various application scenarios and requirements, several special research topics have also been posed and studied in the field of fashion recommendation, which will be introduced briefly in this section.", "6.1 Recommendation Based on Body Shapes": "Body shape has been widely ignored in fashion recommendation until recent years. It is an important factor that affects what garments will best suit a given person [50, 51, 57]. In real-world applications, body shape-aware recommendation will be especially meaningful as people always want the clothes to fit their bodies well. There are two key problems in this task: 1) How to estimate the body shape of a given user and 2) how to make a proper recommendation for the estimated body shape. Hidayati et al. [52] study the correlations underlying body shapes and clothing styles based on the celebrity body measurements and dressing images. They first build a body shape model which can classify the types of body shapes with the body measurements. After that, a body-style map is constructed to model the correlations between clothing styles and body shapes, to discover the dominant style for certain body shape types. In the following work, Sattar et al. [130] expand the scope of recommendation from celebrities to ordinary people. They propose a multi-photo method to estimate the shape of each user and try to investigate the relationship between body shape and clothing category in a supervised manner from a labeled dataset. However, their investigated body types are only twoaverage shape and above average , which is far from enough to make meaningful body shape-aware studies. In comparison, Hsiao et al. [56] propose a visual body-aware embedding method that encodes fashion items with attributes and CNN features and encodes the human body with estimated SMPL [102] parameters and vital statistics. The item and body representation are then mapped into the joint embedding that measures body-clothing affinities. Dong et al. [30] determine the body shape of the users by inferring their essential body measurements from the historical clothing they have bought. They model the compatibility between the body shape and items to achieve personalized outfit recommendation. Body shape-aware fashion recommendation is a prospective research area which is still at its early stage. Since the topic covers both the human body shape and personal preference modeling problems, both data and , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 23 technical requirements are higher. From the data perspective, the collected datasets are usually on a small scale as the human body shape information is not easy to acquire. From the technical perspective, such a task may need cross-area techniques such as implicit feedback analysis in information retrieval and 3D human geometry estimation in graphics, which is a big challenge, leaving the problem under-explored so far.", "6.2 Size Recommendation": "The topic of understanding the item size and fit on a personalized level has gained momentum in the research community, especially from the industry. Research has shown that size and fit are among the most influential factors driving e-commerce customer satisfaction in the fashion domain [118]. Data-driven size recommendation aims to predict whether the product size is suitable for the user by analyzing the historical purchase record of the user. In the literature, skip-gram based method [1], hierarchical Bayesian method [41], graphic method [153] and etc have been proposed for size recommendation. More recently, Sheikh et al. [133] propose a deep learning-based content-collaborative method to make the size/fit prediction; Dogani et al. [29] propose a Product Size Embedding (PSE) model to learn a latent representation for all the possible size variations of products and customers' sizing preferences using solely purchase data and brand information; Karessli et al. [71] explore the size/fit pattern based on the sales and size-related returns data with a weakly supervised learning framework. Specifically, they propose a teacher-student framework with curriculum learning where the statistical model acts as the teacher and a CNN-based model (SizeNet) acts as the student that aims to learn size issue indicators from the fashion images. Another group of studies investigates the fits of clothing based on 3D human body [119, 153], enabling to predict how the specific garments fit or drape on the body as a function of size. Size recommendation problem is more challenging in practice than expected due to the lack of standard on size systems for fashion items such as garments and footwear. Size systems are variants in different regions and brands, which requires the size recommendation methods to not only model the relation between size and user but also explore the underlying complicated conversion logic in item sizing. One possible solution here is to combine the prior domain knowledge or certain rules instead of building the size recommendation system based solely on interaction data. For example, since the size measurement standard is known to be highly sensitive to brands, developing a brand-specific recommender system might be a more practical direction in real applications.", "6.3 Recommendation with Special Requirements": "As concerns specific requirements, various fashion recommendation tasks focusing on some detailed specific requirements have been explored in the literature, for example, recommending clothes based on the weather condition, or for special occasions. Unlike general fashion recommendation, which takes general requirements to make a recommendation, such as user preference or item compatibility, these tasks consider more additional conditions, aiming to make more specific and practical recommendations [99, 101, 134, 159]. For example, for the weather-oriented recommendation problem, Liu et al. [101] propose a system that can automatically recommend the most suitable clothing from the user's personal clothing album, or intelligently suggest the best paired one with the user-specified reference clothing. Their model devices an additional module to train a function that can score the compatibility between the outfit images and weather conditions. So far, considering the weather in recommendation has not attracted much research attention. On one hand, it is hard to evaluate how suitable outfits are for specific weather, which means valid training data is difficult to acquire. On the other hand, the research significance of it is disputed since ordinary people could be able to avoid making big mistakes in dressing according to the weather. In comparison, the recommendation for specific scenarios , occasions , locations or scene is of more applicable significance. An early work of Liu et al. [99] studied two occasion-conditioned fashion recommendation problems: predicting the suitable outfit image given the occasion and predicting a specific fashion item to pair with a given , Vol. 1, No. 1, Article . Publication date: October 2021. 24 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua item given the occasion. They propose a latent Support Vector Machine (SVM)-based model treating clothing attributes as latent variables, with which to model the feature-occasion, attribute-occasion, and attribute-attribute potential. Similarly, Zhang et al. [190] work on the location-oriented recommendation, which seeks to recommend outfits for users for specific travel destinations. From the outfit image perspective, Kang et al. [69] propose that Scene in the outfit image has an impact on the appearance of the whole look, therefore should be considered when recommending fashion product for a given partial outfit. To address the task, they propose to measure both the item-outfit and item-scene compatibility with a category-aware visual attention mechanism. Similarly, Ma et al. [109] study the dressing for occasion problem by analyzing a large number of dressing images on Instagram, trying to derive the relationships between the clothing and occasions. Since the study is mostly based on clothing images, the performance is heavily dependent on the visual analysis of images such as clothing recognition. Existing work on the recommendation with special conditions mostly model the target conditions together with the general objective, for example, the compatibility between items or the personal preference of users. Therefore, we can summarize these methods as conditional recommenders. With similar a framework, we can take any influential factors into account when building the fashion recommender system.", "7 INPUT, EVALUATION AND DATASET FOR FASHION RECOMMENDAITON": "Input, evaluation, and dataset are important sections for empirical analysis in all algorithmic studies, including the study of fashion recommendation methods. In most papers reviewed above, the introduction of input, evaluation, and dataset can be found at the beginning of the experimental sections. Because of the variety of fashion recommendation tasks, the input and evaluation settings are diverse applied in different literature. There have been also a large number of datasets proposed. In this section, we summarize these three important experimental settings based on existing work, hoping to provide instructions for readers to help with their own fashion recommendation studies.", "7.1 Input of Fashion Recommendation Models": "Input is the data used to train the models in the machine learning context. For the fashion recommendation problem, input usually contains the user-item (U-I) interaction records or item-item (I-I) matching relationships, as well as side information of uses or items. For different sub-tasks in fashion recommendation, the data requirement could be different. Most existing PFR models are built based on U-I interaction records and visual information of fashion items. As summarized in Section 3, PFR methods are developed with the incorporation of visual input updating. On one hand, the visual information keeps being enhanced, from global to detail, keeping the input updated. On the other hand, the way of visual information incorporation has been upgraded from pre-defined features to joint-learning ones. The input is more varied for CFR and FOR tasks. First, similar to in PFR, item-item matching relationship or outfit composition data is the basic input for most models, which is essential for the exploration of implicit compatibility patterns between item pairs or in the outfits. On top of that, since these two tasks focus more on fashion items, as well as item relationships, various content information of items from different modalities is widely used. Visual information is still dominant and has been flexibly incorporated into different models. For example, end-to-end models take item images directly as the input while some other models may use the prepared visual features extracted with shallow or deep neural network methods. Another widely adopted modality is text, which contains information resulting from multiple sources, such as descriptive sentences from retailers and review comments from consumers. Textual information can be applied just similar as visual features, with either the natural language input directly or high-level textual features pre-extracted by the language models. In general, the image of an item shows intuitively the look of the item and all its visual features, while textural descriptions may highlight some key features, including those that are not visible, such as brand or material. , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 25 Table 2. Different groups of pairwise and outfit compatibility modeling methods; Common settings of the input and evaluation in fashion recommendation experiments. PCR, FITB and OP are short for Pairwise Complementary Recommendation, Fill-InThe-Blank and Outfit Compatibility Prediction respectively. AUC denotes the Area Under the ROC Curve. Other than the vision and language modalities, some high-level semantic information such as category or other attributes can also be leveraged in many studies of CFR or FOR. We summarize commonly applied input for item/outfit description in Table. 2. Since the input of different models is more complicated and varied in CFR and FOR tasks than in PFR, to further organize existing work in these two tasks, we list the input of representative models for the two tasks in Table AI and Table AII respectively in Appendix. From the summary we observe that existing work in complementary/outfit recommendation can be categorized into two groups based on the input data: uni-modal models and multi-modal models by considering one or multiple modalities information as input. One particular problem in models with multi-modal input is the fusion of multi-modal content features, which can be grouped into two types: 1) pre-score and post-score fusions. Pre-score fusion methods try to obtain multi-modal features as comprehensive description of items first and then apply general projection layer for interaction/compatibility prediction [19, 42, 90, 165]. In comparison, post-score methods measure interaction/compatibility scores with regard to one modality and then combine the modality-specific scores together to obtain the overall multi-modal scores [143, 144, 174]. Laenen et al. [78] conducted comparative empirical studies to specifically explore the multi-modal feature fusion problem. Their results suggest that multi-modal item representation might be more effective in outfit recommendation than uni-modal. Moreover, more sophisticated information fusions, e.g., the attention-based fusion methods, generate better item representation for outfit recommendation and bring more interpretability to the recommendation results as a by-product. However, this study focuses only on the vision-text fusion, while the fusion of more modalities or other forms of input is still not involved.", "7.2 Fashion Recommendation Evaluation": "Evaluation is an important perspective to understand a research area. Due to the specificness and variability of fashion recommendation, we find a large number of different evaluation settings in existing work, especially for complementary/outfit recommendation. After a careful survey, we systematically organize different evaluations of this research area from three perspectives: evaluation task, metric and ground truth. 7.2.1 Evaluation Task. Personalized fashion recommendation, including product recommendation (Section 3) and outfit recommendation (Section 5) is usually evaluated with the personalized ranking task. Specifically, given a user, the target is to predict an item for him/her, which is exactly the same as in the personalized recommendation in the general domain. In comparison, there are more evaluation tasks for complementary/outfit recommendation (Section 4 and 5). As shown in Fig. 7, the most common evaluations in literature are (a) pairwise complementary recommendation (PCR), (b) Fill-In-The-Blank (FITB) [42], and (c) Outfit compatibility Prediction (OP). PCR requires predicting the most compatible item(s) for a given item (Fig. 7 (a)) while the other two are for , Vol. 1, No. 1, Article . Publication date: October 2021. 26 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua Fig. 7. Three common evaluation tasks in fashion recommendation: (a) Pairwise Complementary Recommendation (PCR), (b) Fill-In-The-Blank (FITB), and (c) Outfit compatibility Prediction (OP) ？ ？ ？ pick score (a) (b) (c) (OP) ⚫ Evaluation setting: predicting the item(s) to match the given item, filling in the blank to complete the outfit, predicting outfit compatibility (a) pairwise complementary recommendation (PCR), Fill in the blank (FITB), Outfit compatibility prediction ⚫ Evaluation metrics: AUC, top ­ k ranking metrics (MRR, NDCG, Precision…), prediction error ⚫ Evaluation ground ­ truth: data, human (user study, online experiment) the evaluation of outfit compatibility modeling. Specifically, FITB needs to predict the right item from multiple choices (usually four) to complete the outfit with one item missing (Fig. 7 (b)). The right item means the one that is most compatible with the given items in the outfit. This is a practical scenario in real life when people want to pick a single item to complete their look. Another task, the OP, aims to score a given set of fashion items according to the overall compatibility level to tell if they make a good outfit (Fig. 7 (c)). 7.2.2 Evaluation Metric. Regardless of evaluation settings, there are two types of evaluation in terms of metrics calculation: pairwise comparison and Top-K ranking. The most widely used metric for the pairwise comparison setting is the Area Under the ROC Curve (AUC) [9, 125]. ROC is short for Receiver Operating Characteristic, and its curve demonstrates the accuracy of the tested learning model in predicting the positive target from two given candidates. With AUC as the evaluation metric, the testing data needs to be prepared with pairwise samples, each consisting of a positive and negative candidate. This metric is most commonly combined with the OP evaluation task to be applied in outfit compatibility modeling studies. Top-K ranking evaluation is very commonly applied in recommendation tasks. The evaluated model first predicts a list of items (the length of the list is K) to be recommended. Then, different ranking metrics can be used to evaluate the quality of the recommended list from multiple perspectives. For example, Recall@K results demonstrate the portion of positive items that get recommended among all positive items while Precision@K results show what portion of recommended items are positive ones. Other widely used metrics include MRR@K and NDCG@K. This evaluation way is most commonly used in personalized fashion recommendation, and also in a few complementary recommendation studies. The FITB evaluation with accuracy is a special type of Top-K evaluation, which calculate the Top-1 accuracy of the item prediction for the blank. 7.2.3 Evaluation Ground-Truth. In most situations, researchers save a part of the collected data for the use of evaluation, which is usually labeled properly according to the tasks. For example, for the FITB task, the test set consists of pre-defined outfits, which are all deemed as compatible. For each test outfit, one item would be randomly selected as the prediction target (positive) and removed, leaving the blank to get filled by the recommendation model to test. In this case, the ground truth is available for all test data. However, such an evaluation protocol requires additional labeling efforts, which is not applicable when lacking such labels. Meanwhile, such ground truth could be biased. For example, the composed outfit in the test set could be built by a random user in the fashion community website ( e.g. Polyvore), which means the ground truth is just the opinion of one person and can hardly perform a fair evaluation. To address these limitations, human evaluation has been applied. For example, to evaluate personalized recommendation models, online experiments can be conducted. Providing recommendations for users during their online activities in e-fashion platforms and recording the click-through rate (CTR) can effectively evaluate the quality of the personalized recommendations [13] in a real-time manner. Moreover, to better evaluate , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 27 compatibility learning-involved models, such as complementary recommendation or outfit composition models, some studies invite fashion experts/professionals to manually score the item pairs/outfit recommended by models regarding the compatibility [149, 196], making the evaluation results more sound. There is no doubt that human evaluation will perform more robust and comprehensive results. However, it is restricted by the labour cost and cannot applied in large-scale, which degrades the robustness and comprehensiveness of the evaluation results instead. Evaluation protocols applied in mainstream complementary and outfit recommendation research are also summarized in Appendix.", "7.3 Fashion Recommendation Dataset": "To support fashion recommendation research, a large number of datasets have been constructed based on various data sources for various tasks. E-commerce platforms and online fashion communities are the two main data sources for fashion recommendation research. E-commerce data records real user-item interactions, which naturally support the research of personalized fashion recommendation. Meanwhile, the data from fashion community websites, including social media, provides more domain-specific information such as outfit composition and style evolution, which can be applied for complementary or outfit recommendation research. Due to the page limit, we summarize available datasets in Sec. A.1 in Appendix, where readers can find more details about fashion recommendation datasets.", "8 OPEN CHALLENGES AND FUTURE RESEARCH DIRECTIONS": "Whilst the existing research has established a solid foundation for fashion recommendation, this section outlines several promising prospective research directions. We also elaborate on several open issues, which we believe are critical to advance the present state of this field.", "8.1 Bringing More Explanation": "Explanability is a crucial yet challenging aspect of recommender systems that greatly affects the persuasiveness and user satisfaction of recommendation [154]. Currently, most fashion recommendation models cannot explain why certain items are appealing to the user, why two items match well, or why one outfit is good while the others are not. Several attempts have been made to enable more interpretability. For example, to explain the reasons for matching, Yang et al. [175] propose to learn the interpretable matching patterns that lead to a good match with regard to specific attributes. Hou et al. [54] take advantage of semantic attributes to build an explainable fashion recommender system for personalized item recommendation. They link the user preference on items with specific attributes using a fine-grained preferences attention module. Efforts have also been made to explain the recommendation results with textual comments or descriptions [91, 143]. The explanations or interpretations in recommendation are mostly from two perspectives, explaining the process in the models or generating an additional explanation for the recommendation results [132, 151, 169]. As we can see, in the specific fashion recommendation tasks, whether we analyse the process or the results, the explanations are mostly related to the attributes of items. Exploiting rich attribute information and linking it with the recommendation results is no doubt a natural and promising direction in fashion recommendation considering that user preference and matching patterns in fashion are highly related to detailed fashion attributes. In light of the particular importance of visual information in this domain, several methods focus on exploring visually the explanation for the recommendation [14, 15, 54, 167]. However, the existing work only focuses on the item perspective. We should investigate further whether the patterns of users' behaviors or the connection patterns of items can be interpreted to provide an explanation. From the technology perspective, the attention mechanism and knowledge graph (KG) are two powerful tools to create explanations. The attention weights usually give insights about the inner workings of the models by , Vol. 1, No. 1, Article . Publication date: October 2021. 28 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua probing the weight and activation [189]. This offers a more intuitive understanding of the models [54, 169]. The knowledge graph, on the other hand, empowers the model with explanability by leveraging affiliated information and jointly learning the KG and recommendation task. Such a scheme can bridge the recommendation results with specific aspects in different relations, thereby offering an explanation. For example, with an attentive attributeaware knowledge graph, Zhan et al. [186] are able to characterize the user's fine-grained interests with regard to the attributes of the outfits, giving a clear explanation of the user's preference on outfits. However, although KG has been effectively applied, it is still limited in leveraging additional affiliated information and enhancing representation learning. More advanced technologies, such as machine reasoning, have been successfully applied in relevant tasks to improve explainability [152, 191]. Combined with knowledge graphs, machine reasoning could be the next frontier for fashion recommendation in terms of not only improving the explainability, but also achieving higher-level interactive or conversational recommendation tasks [79]. Causal explanation learning, which has been successfully applied in the recommendation to provide a post-hoc explanation for the black-box sequential recommendation mechanisms via causal analysis [170], can be another prospective way to achieve explainable recommendation.", "8.2 Exploring and Incorporating Domain Knowledge": "The mainstream methods for fashion recommendation fit the observed data and make predictions accordingly, which overlook the rich domain knowledge. On the one hand, these methods suffer from poor interpretability as they explore the pattern in the data completely implicitly. On the other hand, ignoring additional knowledge limits the recommendation accuracy. The domain knowledge discussed here involves not only the affiliated information but also expert knowledge or rules. The latter widely exists in the fashion domain but is barely considered in previous studies. For example, traditionally, fashion matching is a human-centered task that relies on the expertise and experience of fashion stylists [20]. In general, fashion stylists will evaluate the compatibility of two fashion items (or an outfit) from multiple dimensions, such as color or texture. They might also think about the overall styles, for example, if hip-hop ripped jeans go well with a feminine blouse. They will also consider the user perspective with respect to their body shape, color, lifestyle, etc. [20]. Although such evaluation is subjective to some extent, there are many basic or general rules that are available on many platforms such as fashion magazines, blogs, or even YouTube videos. If this domain knowledge is effectively extracted and incorporated into the approaches developed for specific tasks, it can supplement the completely data-driven approaches and compensate for their potential deficiencies. For example, when the available data is insufficient or biased, the learned model will lack generalization and perform poorly in testing. Moreover, exploring fashion knowledge, such as matching rules, can also enhance the explanation and reliability of the recommendation results. There are two challenges to bringing fashion domain knowledge into recommendation: 1) how to construct such knowledge; and 2) how to leverage it in different models. For the first challenge, since the knowledge is usually conveyed implicitly via different types of media, extracting structural and applicable knowledge requires extensive technologies in multi-media analysis. For the second challenge, since leveraging additional information can inevitably affect the training of the data-driven approaches, it is necessary to ensure that the incorporated knowledge is able to refine the data-fitting results rather than working completely against it and degrading the performance. Among the existing work, Ma et al. [109] focus on the fashion knowledge extraction problem and work it based on social media data. Their work explores the occasion, person, and clothing discovery from multiple modalities of images, texts, and metadata with a multi-task learning framework. Song et al. [142] for the first time incorporate fashion domain knowledge in clothing matching. Specifically, they present an attentive knowledge distillation scheme to encode the knowledge to the traditional neural networks to boost the compatibility modeling performance. Apart from these attempts, the relevant studies are still limited. On the one hand, many data sources are available and valuable for fashion knowledge extraction but have not been focused , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 29 on yet. On the other hand, more advanced technologies need to be developed to extract the best of the available knowledge to facilitate specific fashion recommendation tasks.", "8.3 Modeling Heterogeneous Content Information and Multiple Behaviors": "Fashion recommendation is a task that needs to process heterogeneous data, including implicit feedback records, user profiles, item attributes, review text, item combination relationships, and other auxiliary information. However, most of the existing methods fail to utilize the various types of side information in a comprehensive manner and take full advantage of the available data. Many of them build the recommender system relying on the implicit feedback or the observed item combination data, mostly with visual information. Considering the exciting recent advances in graph neural networks (GNNs), modeling the heterogeneous data in fashion recommendation tasks with heterogeneous graphs [164, 188] is a promising direction. In a heterogeneous graph, different types of nodes (users, items, attributes, etc) can be related in different ways (interacting, affiliated, etc.). GNNs have been applied in several tasks, such as compatibility modeling and outfit recommendation. In compatibility modeling, several methods use a graph to model multiple relations between fashion items to enhance the item representation by conducting information propagation and aggregation on the graphs [18, 174]. For outfit recommendation, the graph is usually used to encode the outfit with several items and to obtain the outfit representation [19, 81, 90]. In addition, the knowledge graph has been successfully applied to incorporate attributes and facilitate the outfit preference prediction [186]. However, the use of graph technologies in fashion recommendation is still under-explored. The first challenge here is how to design such a graph for different specific tasks that can effectively incorporate as much useful information as possible. Furthermore, how to jointly model the abundant auxiliary information to facilitate the recommendation task, for example, the user preference or item compatibility modeling, is another challenging aspect. To address these challenges, effective heterogeneous graph learning or multi-task learning approaches should be developed.", "8.4 Solid Benchmark and Evaluation": "In the previous sections, we have mentioned that both the compatibility modeling and outfit recommendation tasks lack high-quality benchmarks. In various studies, tens of datasets are used for the same task, which makes it hard to fairly evaluate different methods and analyse the development of the research field. To facilitate the research in the mentioned tasks, standard task settings, as well as an evaluation dataset and metrics should be developed. For compatibility modeling, most of the existing work is based on Polyvore datasets but uses different versions of data with different statistics. In fact, one or several benchmark datasets can be developed based on the existing Polyvore datasets to at least fix the evaluation part of the data. For the outfit recommendation task, both the datasets and the task need a standard, for example, whether the outfits are pre-defined. On top of the need to improve the benchmarks, current evaluation schemes need improvement too. For personalized fashion recommendation, the existing work generally applies a small negative set evaluation. However, there have been studies arguing that small negative set evaluations can lead to unfair evaluation results [76]. As a result, in the general domain, full rank evaluation has been widely applied in recent years [49, 163]. However, full rank evaluation is in some way not applicable to the fashion domain as the item set is large-scale (tens of thousands or even millions). Applying full-rank evaluation will require substantial computer power and may not even be applicable. More importantly, the values of the generally used metrics such as recall@10 or ndcg@10 will be too small to effectively evaluate the methods. Therefore, a proper evaluation scheme needs to be designed for this task. , Vol. 1, No. 1, Article . Publication date: October 2021. 30 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua", "8.5 Understanding Better the Needs of Fashion Industry and Users": "The ultimate goal of fashion recommendation technology is to help the fashion industry to make wise business strategies, and users to make good purchasing or dressing decisions. Therefore, for the benefit of fashion recommendation research, on the one hand, we should enhance the benchmark and standard setting for basic tasks to support the development of fundamental techniques, as we state above. On the other hand, research on fashion recommendation should catch up with the development of the fashion industry, being aware of the real needs of the industry and where it is heading. From the business perspective, the basic idea of current fashion recommendation is to attract customers by offering the item options they might like. Such a strategy is passive to some extent. Traditional fashion marketing strategies such as promotion and advertisement can effectively facilitate the retailing business, positively creating demand from consumers rather than capturing the existing ones [33]. However, these traditional marketing strategies are usually addressed to certain customer groups, and not personalized. Therefore, the first potential direction would be to develop recommendation algorithms with marketing functions, making them able to effectively make promotions to customers like the traditional fashion marketing strategies but to customize and personalize these promotions. This is a challenging problem that needs a deep understanding of fashion marketing knowledge and to further incorporate certain theories and strategies with the data-driven recommender systems. Another big goal is omnichannel fashion recommendation. An omnichannel strategy seamlessly integrates the different sales and communication channels that the customer uses, combining the strengths of each channel [103, 107, 111]. To facilitate omnichannel retail in the technical aspect, we need to collect data from multiple channels and build data-driven recommendation models, which is a great challenge, for example, needing to extract, align and make use of user and product information across channels. Most previous studies on fashion recommendation are limited to one data channel, for example, applying e-commerce data for personalized recommendation or social media data for the mix-and-match recommendation. In other domains of recommendation, researchers have proposed learning a general user representation for multiple recommendations across platforms [182, 183] with the transfer learning [6] and continual learning [86, 185] technologies. This represents a promising direction for us to develop omnichannel fashion recommendation. Besides, there might be more technical parts required to realize the overall omnichannel recommendation. For example, how can we capture the latest fashion trends from social media [23] or the dressing knowledge [109], and then leverage them for fashion recommendation on e-commerce platforms. From another perspective, users' needs for fashion recommendation are not limited to the purchase processes, or we can say that nowadays buying new clothing is no longer the only thing that people want in terms of fashion. One report shows that Gen-Z and Millennial consumers are more eco-conscious and have a growing interest in second-hand clothes 8 . Such an area of second-hand fashion recommendation has barely been explored in the literature so far, yet has great applicable values. We can expect that such a task will have to deal with a severe sparsity and long-tail issue [179], which can make most CF-based recommendation methods fail and requires a better understanding of products semantically [43]. Another real need from ordinary users is to make the best use of their own wardrobe, which is mostly related to the existing task of, capsule wardrobe creation (see section 5 for details). Furthermore, with the increasing influence of minimalism, how to optimize the personal wardrobe by substituting minimal items is another practical problem that ordinary users care about. All in all, the development of fashion recommendation should be closely integrated with the practical needs from both the business and user perspectives. 8 https://www.businessoffashion.com/articles/retail/affirm-evolution-omnichannel-retail , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 31", "9 CONCLUSIONS": "This paper focused on the field of fashion recommendation and extensively reviewed the recent research efforts in this field. We proposed a classification scheme for organizing existing works based on the task settings, which divides all fashion recommendation studies into personalized fashion recommendation, complementary recommendation, outfit recommendation and special fashion recommendation. We comprehensively summarized the existing methods for each group of works and pointed out the limitations of the current research. By reviewing all these sub-tasks in fashion recommendation, we outlined the development of this research field. We further discussed several promising directions in fashion recommendation for future extension from different perspectives, including narrowing the gap between the real needs of the industry and the research outcomes. Overall, this survey provided a comprehensive and systematic review of the existing literature on fashion recommendation, and also offered a deep insight into how the fashion industry could benefit further from these academic developments.", "REFERENCES": "[1] G Mohammed Abdulla and Sumit Borar. 2017. Size recommendation system for fashion e-commerce. In KDD Workshop on Machine Learning Meets Fashion . [2] Abhilash Acharya, Sanjay Kumar Singh, Vijay Pereira, and Poonam Singh. 2018. Big data, knowledge co-creation and decision making in fashion industry. Int J Inf Manage 42 (2018), 90-101. [3] Kenan Emir Ak, Joo Hwee Lim, Jo Yew Tham, and Ashraf Kassim. 2019. Semantically consistent hierarchical text to fashion image synthesis with an enhanced-attentional generative adversarial network. In ICCV Workshops . 3121-3124. [4] Bushra Alhijawi, Arafat Awajan, and Salam Fraihat. 2022. Survey on the Objectives of Recommender System: Measures, Solutions, Evaluation Methodology, and New Perspectives. ACM Comput. Surv. (2022). [5] Malcolm Barnard. 2020. Fashion theory: A reader . Routledge. [6] Luca Bertinetto, João F Henriques, Jack Valmadre, Philip Torr, and Andrea Vedaldi. 2016. Learning feed-forward one-shot learners. In NeurIPS . 523-531. [7] Yi Bin, Yujuan Ding, Bo Peng, Liang Peng, Yang Yang, and Tat-Seng Chua. 2022. Entity Slot Filling for Visual Captioning. IEEE Trans. Circuits Syst. Video Technol. 32, 1 (2022), 52-62. [8] Christian Bracher, Sebastian Heinz, and Roland Vollgraf. 2016. Fashion DNA: merging content and sales data for recommendation and article mapping. arXiv preprint arXiv:1609.02489 (2016). [9] Andrew P Bradley. 1997. The use of the area under the ROC curve in the evaluation of machine learning algorithms. Pattern recognition 30, 7 (1997), 1145-1159. [10] Samit Chakraborty, Md Saiful Hoque, Naimur Rahman Jeem, Manik Chandra Biswas, Deepayan Bardhan, and Edgar Lobaton. 2021. Fashion recommendation systems, models and methods: A review. In Informatics , Vol. 8. 49. [11] Samit Chakraborty, Md Saiful Hoque, and SM Surid. 2020. A comprehensive review on image based style prediction and online fashion recommendation. J. Eng. Technol. 5, 3 (2020), 212-233. [12] Long Chen and Yuhang He. 2018. Dress fashionably: Learn fashion collocation with deep mixed-category metric learning. In AAAI . [13] Wen Chen, Pipei Huang, Jiaming Xu, Xin Guo, Cheng Guo, Fei Sun, Chao Li, Andreas Pfadler, Huan Zhao, and Binqiang Zhao. 2019. POG: Personalized outfit generation for fashion recommendation at alibaba ifashion. In KDD . 2662-2670. [14] Xu Chen, Hanxiong Chen, Hongteng Xu, Yongfeng Zhang, Yixin Cao, Zheng Qin, and Hongyuan Zha. 2019. Personalized fashion recommendation with visual explanations based on multimodal attention network: Towards visually explainable recommendation. In SIGIR . 765-774. [15] Xu Chen, Yongfeng Zhang, Hongteng Xu, Yixin Cao, Zheng Qin, and Hongyuan Zha. 2018. Visually explainable recommendation. arXiv preprint arXiv:1801.10288 (2018). [16] Wen-Huang Cheng, Sijie Song, Chieh-Yun Chen, Shintami Chusnul Hidayati, and Jiaying Liu. 2021. Fashion Meets Computer Vision: A Survey. ACM Comput. Surv. 54, 4 (2021), 72:1-72:41. [17] Xiaoya Chong, Qing Li, Howard Leung, Qianhui Men, and Xianjin Chao. 2020. Hierarchical Visual-aware Minimax Ranking Based on Co-purchase Data for Personalized Recommendation. In WWW . 2563-2569. [18] Guillem Cucurull, Perouz Taslakian, and David Vazquez. 2019. Context-aware visual compatibility prediction. In CVPR . 12617-12626. [19] Zeyu Cui, Zekun Li, Shu Wu, Xiao-Yu Zhang, and Liang Wang. 2019. Dressing as a whole: Outfit compatibility learning based on node-wise graph neural networks. In WWW . 307-317. [20] Bolanle O Dahunsi and Lucy E Dunne. 2021. Understanding professional fashion stylists' outfit recommendation process: A qualitative study. Recommender Systems in Fashion and Retail 734 (2021), 139. , Vol. 1, No. 1, Article . Publication date: October 2021. 32 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua [21] Yashar Deldjoo, Markus Schedl, Paolo Cremonesi, and Gabriella Pasi. 2020. Recommender systems leveraging multimedia content. ACM Comput. Surv. 53, 5 (2020), 1-38. [22] Qiming Diao, Minghui Qiu, Chao-Yuan Wu, Alexander J Smola, Jing Jiang, and Chong Wang. 2014. Jointly modeling aspects, ratings and sentiments for movie recommendation (JMARS). In KDD . 193-202. [23] Yujuan Ding, Yunshan Ma, Lizi Liao, Wai Keung Wong, and Tat-Seng Chua. 2022. Leveraging Multiple Relations for Fashion Trend Forecasting Based on Social Media. IEEE Trans. Multim. 24 (2022), 2287-2299. [24] Yujuan Ding, Yunshan Ma, Wai Keung Wong, and Tat-Seng Chua. 2021. Leveraging Two Types of Global Graph for Sequential Fashion Recommendation. In ICMR . 73-81. [25] Yujuan Ding, Yunshan Ma, Wai Keung Wong, and Tat-Seng Chua. 2021. Modeling Instant User Intent and Content-level Transition for Sequential Fashion Recommendation. IEEE Trans. Multim. 00, 0 (2021), 000. [26] Yujuan Ding, P.Y. Mok, Yunshan Ma, and Yi Bin. 2023. Personalized fashion outfit generation with user coordination preference learning. Information Processing & Management 60, 5 (2023), 103434. [27] Yujuan Ding, P.Y. Mok, Xun Yang, and Yanghong Zhou. 2022. Modeling Field-Level Factor Interactions for Fashion Recommendation. In ICME . 1-6. [28] Yujuan Ding and Wai Keung Wong. 2019. Fashion outfit style retrieval based on hashing method. In Artificial Intelligence on Fashion and Textiles(AIFT) . 187-195. [29] Kallirroi Dogani, Matteo Tomassetti, Saúl Vargas, Benjamin Paul Chamberlain, and Sofie De Cnudde. 2019. Learning Embeddings for Product Size Recommendations.. In SIGIR eCom Workshop . [30] Xue Dong, Xuemeng Song, Fuli Feng, Peiguang Jing, Xin-Shun Xu, and Liqiang Nie. 2019. Personalized Capsule Wardrobe Creation with Garment and User Modeling. In ACM Multimedia . 302-310. [31] Xue Dong, Jianlong Wu, Xuemeng Song, Hongjun Dai, and Liqiang Nie. 2020. Fashion Compatibility Modeling through a Multi-modal Try-on-guided Scheme. In SIGIR . 771-780. [32] Mikayla DuBreuil and Sheng Lu. 2020. Traditional vs. big-data fashion trend forecasting: an examination using WGSN and EDITED. Int. J. Fash. Des. Technol. Educ. 13, 1 (2020), 68-77. [33] Mike Easey. 2009. Fashion marketing . John Wiley & Sons. [34] Ruining Feng. 2020. To Become Fashionable: A Brief Review of Outfit Compatibility. In IEEE Conference on Telecommunications, Optics and Computer Science . 219-225. [35] Zunlei Feng, Zhenyun Yu, Yongcheng Jing, Sai Wu, Mingli Song, Yezhou Yang, and Junxiao Jiang. 2019. Interpretable Partitioned Embedding for Intelligent Multi-item Fashion Outfit Composition. ACM Trans. Multim. Comput. Commun. Appl. 15, 2s (2019), 1-20. [36] Zunlei Feng, Zhenyun Yu, Yezhou Yang, Yongcheng Jing, Junxiao Jiang, and Mingli Song. 2018. Interpretable partitioned embedding for customized multi-item fashion outfit composition. In ICMR . 143-151. [37] Sida Gu, Xiaoqiang Liu, Lizhi Cai, and Jie Shen. 2017. Fashion coordinates recommendation based on user behavior and visual clothing style. In ICCIP . 185-189. [38] Xiaoling Gu, Fei Gao, Min Tan, and Pai Peng. 2020. Fashion analysis and understanding with artificial intelligence. Inf. Process. Manag. 57, 5 (2020), 102276. [39] Congying Guan, Shengfeng Qin, Wessie Ling, and Guofu Ding. 2016. Apparel recommendation system evolution: an empirical review. Int. J. Cloth. Sci. Technol. (2016). [40] Congying Guan, Shengfeng Qin, Wessie Ling, and Yang Long. 2018. Enhancing Apparel Data Based on Fashion Theory for Developing a Novel Apparel Style Recommendation System. In WorldCIST (3) (Advances in Intelligent Systems and Computing, Vol. 747) . 31-40. [41] Romain Guigourès, Yuen King Ho, Evgenii Koriagin, Abdul-Saboor Sheikh, Urs Bergmann, and Reza Shirvany. 2018. A hierarchical bayesian model for size recommendation in fashion. In RecSys . 392-396. [42] Xintong Han, Zuxuan Wu, Yu-Gang Jiang, and Larry S Davis. 2017. Learning fashion compatibility with bidirectional lstms. In ACM Multimedia . 1078-1086. [43] Ruining He, Chen Fang, Zhaowen Wang, and Julian McAuley. 2016. Vista: A visually, socially, and temporally-aware model for artistic recommendation. In RecSys . 309-316. [44] Ruining He, Wang-Cheng Kang, and Julian McAuley. 2017. Translation-based recommendation. In RecSys . 161-169. [45] Ruining He, Chunbin Lin, Jianguo Wang, and Julian J. McAuley. 2016. Sherlock: Sparse Hierarchical Embeddings for Visually-Aware One-Class Collaborative Filtering. In IJCAI . 3740-3746. [46] Ruining He and Julian McAuley. 2016. Ups and downs: Modeling the visual evolution of fashion trends with one-class collaborative filtering. In WWW . 507-517. [47] Ruining He and Julian J. McAuley. 2016. VBPR: Visual Bayesian Personalized Ranking from Implicit Feedback. In AAAI . 144-150. [48] Ruining He, Charles Packer, and Julian McAuley. 2016. Learning compatibility across categories for heterogeneous item recommendation. In ICDM . 937-942. [49] Xiangnan He, Kuan Deng, Xiang Wang, Yan Li, Yongdong Zhang, and Meng Wang. 2020. Lightgcn: Simplifying and powering graph convolution network for recommendation. In SIGIR . 639-648. , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 33 [50] Shintami Chusnul Hidayati and Yeni Anistyasari. 2021. Body Shape Calculator: Understanding the Type of Body Shapes from Anthropometric Measurements. In ICMR . 461-465. [51] Shintami Chusnul Hidayati, Ting Wei Goh, Ji-Sheng Gary Chan, Cheng-Chun Hsu, John See, Lai-Kuan Wong, Kai-Lung Hua, Yu Tsao, and Wen-Huang Cheng. 2021. Dress With Style: Learning Style From Joint Deep Embedding of Clothing Styles and Body Shapes. IEEE Trans. Multim. 23 (2021), 365-377. [52] Shintami Chusnul Hidayati, Cheng-Chun Hsu, Yu-Ting Chang, Kai-Lung Hua, Jianlong Fu, and Wen-Huang Cheng. 2018. What dress fits me best? Fashion recommendation on the clothing style for personal body shape. In ACM Multimedia . 438-446. [53] Sepp Hochreiter and Jürgen Schmidhuber. 1997. Long short-term memory. Neural computation 9, 8 (1997), 1735-1780. [54] Min Hou, Le Wu, Enhong Chen, Zhi Li, Vincent W. Zheng, and Qi Liu. 2019. Explainable Fashion Recommendation: A Semantic Attribute Region Guided Approach. In IJCAI . 4681-4688. [55] Wei-Lin Hsiao and Kristen Grauman. 2017. Learning the latent\" look\": Unsupervised discovery of a style-coherent embedding from fashion images. In ICCV . 4203-4212. [56] Wei-Lin Hsiao and Kristen Grauman. 2018. Creating capsule wardrobes from fashion images. In CVPR . 7161-7170. [57] Wei-Lin Hsiao and Kristen Grauman. 2020. ViBE: Dressing for Diverse Body Shapes. In CVPR . 11059-11069. [58] Wei-Lin Hsiao, Isay Katsman, Chao-Yuan Wu, Devi Parikh, and Kristen Grauman. 2019. Fashion++: Minimal edits for outfit improvement. In ICCV . 5047-5056. [59] Yang Hu, Xi Yi, and Larry S Davis. 2015. Collaborative fashion recommendation: A functional tensor factorization approach. In ACM Multimedia . 129-138. [60] Cong Phuoc Huynh, Arridhana Ciptadi, Ambrish Tyagi, Amit Agrawal, L Leal-Taixé, and S Roth. 2018. CRAFT: Complementary Recommendation by Adversarial Feature Transform.. In ECCV Workshops . 54-66. [61] Tomoharu Iwata, Shinji Wanatabe, and Hiroshi Sawada. 2011. Fashion coordinates recommender system using photographs from fashion magazines. In IJCAI , Vol. 22. 2262. [62] Vignesh Jagadeesh, Robinson Piramuthu, Anurag Bhardwaj, Wei Di, and Neel Sundaresan. 2014. Large scale visual recommendations from street fashion images. In KDD . 1925-1934. [63] Anish Jain, Diti Modi, Rudra Jikadra, and Shweta Chachra. 2019. Text to Image Generation of Fashion Clothing. In International Conference on Computing for Sustainable Global Development . 355-358. [64] Dietmar Jannach, Markus Zanker, Alexander Felfernig, and Gerhard Friedrich. 2010. Recommender systems: an introduction . [65] Shaoxiong Ji, Shirui Pan, Erik Cambria, Pekka Marttinen, and Philip S. Yu. 2022. A Survey on Knowledge Graphs: Representation, Acquisition, and Applications. IEEE Trans. Neural Networks Learn. Syst. 33, 2 (2022), 494-514. [66] Yangbangyan Jiang, Qianqian Xu, and Xiaochun Cao. 2018. Outfit Recommendation with Deep Sequence Learning. In BigMM . 1-5. [67] Peiguang Jing, Shu Ye, Liqiang Nie, Jing Liu, and Yuting Su. 2019. Low-rank regularized multi-representation learning for fashion compatibility prediction. IEEE Trans. Multim. 22, 6 (2019), 1555-1566. [68] Wang-Cheng Kang, Chen Fang, Zhaowen Wang, and Julian McAuley. 2017. Visually-aware fashion recommendation and design with generative image models. In ICDM . 207-216. [69] Wang-Cheng Kang, Eric Kim, Jure Leskovec, Charles Rosenberg, and Julian McAuley. 2019. Complete the look: Scene-based comple- mentary product recommendation. In CVPR . 10532-10541. [70] Wang-Cheng Kang, Mengting Wan, and Julian McAuley. 2018. Recommendation through mixtures of heterogeneous item relationships. In CIKM . 1143-1152. [71] Nour Karessli, Romain Guigourès, and Reza Shirvany. 2019. Sizenet: Weakly supervised learning of visual size and fit in fashion images. In CVPR Workshops . 0-0. [72] Donghyun Kim, Kuniaki Saito, Samarth Mishra, Stan Sclaroff, Kate Saenko, and Bryan A. Plummer. 2021. Self-supervised Visual Attribute Learning for Fashion Compatibility. In ICCV Workshops . 1057-1066. [73] Thomas N. Kipf and Max Welling. 2017. Semi-Supervised Classification with Graph Convolutional Networks. In ICLR . [74] Ryan Kiros, Ruslan Salakhutdinov, and Richard S Zemel. 2014. Unifying visual-semantic embeddings with multimodal neural language models. arXiv preprint arXiv:1411.2539 (2014). [75] Yehuda Koren and Robert Bell. 2015. Advances in collaborative filtering. Recommender systems handbook (2015), 77-118. [76] Walid Krichene and Steffen Rendle. 2020. On sampled metrics for item recommendation. In KDD . 1748-1757. [77] Brian Kulis et al. 2012. Metric learning: A survey. Found. Trends Mach. Learn. 5, 4 (2012), 287-364. [78] Katrien Laenen and Marie-Francine Moens. 2020. A Comparative Study of Outfit Recommendation Methods with a Focus on Attention-based Fusion. Inf. Process. Manag. 57, 6 (2020), 102316. [79] Wenqiang Lei, Gangyi Zhang, Xiangnan He, Yisong Miao, Xiang Wang, Liang Chen, and Tat-Seng Chua. 2020. Interactive path reasoning on graph for conversational recommendation. In KDD . 2073-2083. [80] Kedan Li, Chen Liu, and David Forsyth. 2019. Coherent and Controllable Outfit Generation. arXiv preprint arXiv:1906.07273 (2019). [81] Xingchen Li, Xiang Wang, Xiangnan He, Long Chen, Jun Xiao, and Tat-Seng Chua. 2020. Hierarchical fashion graph network for personalized outfit recommendation. In SIGIR . 159-168. , Vol. 1, No. 1, Article . Publication date: October 2021.", "34 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua": "[82] Yuncheng Li, Liangliang Cao, Jiang Zhu, and Jiebo Luo. 2017. Mining fashion outfit composition using an end-to-end deep learning approach on set data. IEEE Trans. Multim. 19, 8 (2017), 1946-1955. [83] Yunqi Li, Hanxiong Chen, Shuyuan Xu, Yingqiang Ge, and Yongfeng Zhang. 2021. Towards personalized fairness based on causal notion. In SIGIR . 1054-1063. [84] Yang Li, Yadan Luo, and Zi Huang. 2020. Fashion Recommendation with Multi-relational Representation Learning. In PAKDD (1) (Lecture Notes in Computer Science, Vol. 12084) . 3-15. [85] Yang Li, Yadan Luo, and Zi Huang. 2020. Graph-Based Relation-Aware Representation Learning for Clothing Matching. In ADC (Lecture Notes in Computer Science, Vol. 12008) . 189-197. [86] Zhizhong Li and Derek Hoiem. 2018. Learning without Forgetting. IEEE Trans. Pattern Anal. Mach. Intell. 40, 12 (2018), 2935-2947. [87] Zhi Li, Bo Wu, Qi Liu, Likang Wu, Hongke Zhao, and Tao Mei. 2021. Learning the Compositional Visual Coherence for Complementary Recommendations. In IJCAI . Article 489, 8 pages. [88] Shuiying Liao, Yujuan Ding, and P. Y. Mok. 2023. Recommendation of Mix-and-Match Clothing by Modeling Indirect Personal Compatibility. In ICMR . ACM, 560-564. [89] Jasy Suet Yan Liew, Elizabeth Kaziunas, JianZhao Liu, and Shen Zhuo. 2011. Socially-interactive dressing room: an iterative evaluation on interface design. In CHI . 2023-2028. [90] Yusan Lin, Maryam Moosaei, and Hao Yang. 2020. OutfitNet: Fashion Outfit Recommendation with Attention-Based Multiple Instance Learning. In WWW . 77-87. [91] Yujie Lin, Pengjie Ren, Zhumin Chen, Zhaochun Ren, Jun Ma, and Maarten De Rijke. 2019. Explainable outfit recommendation with joint outfit matching and comment generation. IEEE Trans. Knowl. Data Eng. 32, 8 (2019), 1502-1516. [92] Yujie Lin, Pengjie Ren, Zhumin Chen, Zhaochun Ren, Jun Ma, and Maarten de Rijke. 2019. Improving outfit recommendation with co-supervision of fashion generation. In WWW . 1095-1105. [93] Yen-Liang Lin, Son Dinh Tran, and Larry S. Davis. 2020. Fashion Outfit Complementary Item Retrieval. In CVPR . 3308-3316. [94] Jinhuan Liu, Xuemeng Song, Zhumin Chen, and Jun Ma. 2019. Neural fashion experts: I know how to make the complementary clothing matching. Neurocomputing 359 (2019), 249-263. [95] Jinhuan Liu, Xuemeng Song, Zhumin Chen, and Jun Ma. 2020. MGCM: Multi-modal generative compatibility modeling for clothing matching. Neurocomputing 414 (2020), 215-224. [96] Jinhuan Liu, Xuemeng Song, Liqiang Nie, Tian Gan, and Jun Ma. 2020. An End-to-End Attention-Based Neural Model for Complementary Clothing Matching. ACM Trans. Multim. Comput. Commun. Appl. 15, 4 (2020), 114:1-114:16. [97] Luyao Liu, Xingzhong Du, Lei Zhu, Fumin Shen, and Zi Huang. 2018. Learning discrete hashing towards efficient fashion recommendation. Data Science and Engineering 3, 4 (2018), 307-322. [98] Qiang Liu, Shu Wu, and Liang Wang. 2017. DeepStyle: Learning user preferences for visual recommendation. In SIGIR . 841-844. [99] Si Liu, Jiashi Feng, Zheng Song, Tianzhu Zhang, Hanqing Lu, Changsheng Xu, and Shuicheng Yan. 2012. Hi, magic closet, tell me what to wear!. In ACM Multimedia . 619-628. [100] Xin Liu, Yongbin Sun, Ziwei Liu, and Dahua Lin. 2020. Learning diverse fashion collocation by neural graph filtering. IEEE Trans. Multim. 23 (2020), 2894-2901. [101] Yujie Liu, Yongbiao Gao, Shihe Feng, and Zongmin Li. 2017. Weather-to-garment: Weather-oriented clothing recommendation. In ICME . 181-186. [102] Matthew Loper, Naureen Mahmood, Javier Romero, Gerard Pons-Moll, and Michael J. Black. 2015. SMPL: a skinned multi-person linear model. ACM Trans. Graph. 34, 6 (2015), 248:1-248:16. [103] Carlota Lorenzo-Romero, María-Encarnación Andrés-Martínez, and Juan-Antonio Mondéjar-Jiménez. 2020. Omnichannel in the fashion industry: A qualitative analysis from a supply-side perspective. Heliyon 6, 6 (2020), e04198. [104] Jie Lu, Dianshuang Wu, Mingsong Mao, Wei Wang, and Guangquan Zhang. 2015. Recommender system application developments: A survey. Decis. Support Syst. 74 (2015), 12-32. [105] Zhi Lu, Yang Hu, Yan Chen, and Bing Zeng. 2021. Personalized Outfit Recommendation With Learnable Anchors. In CVPR . 12722-12731. [106] Zhi Lu, Yang Hu, Yunchao Jiang, Yan Chen, and Bing Zeng. 2019. Learning binary code for personalized fashion recommendation. In CVPR . 10562-10570. [107] Samantha Lynch and Liz Barnes. 2020. Omnichannel fashion retailing: examining the customer decision-making journey. J. Fash. Mark. Manag. (2020). [108] Yunshan Ma, Yujuan Ding, Xun Yang, Lizi Liao, Wai Keung Wong, and Tat-Seng Chua. 2020. Knowledge Enhanced Neural Fashion Trend Forecasting. In ICMR . 82-90. [109] Yunshan Ma, Xun Yang, Lizi Liao, Yixin Cao, and Tat-Seng Chua. 2019. Who, Where, and What to Wear? Extracting Fashion Knowledge from Social Media. In ACM Multimedia . 257-265. [110] Julian McAuley, Christopher Targett, Qinfeng Shi, and Anton Van Den Hengel. 2015. Image-based recommendations on styles and substitutes. In SIGIR . 43-52. [111] CHARLES MCINTYRE, TC Melewar, and CHARLES DENNIS. 2016. Multi-Channel Marketing, Branding and Retail Design. (2016). , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 35 , Vol. 1, No. 1, Article . Publication date: October 2021.", "36 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua": ", Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 37 , Vol. 1, No. 1, Article . Publication date: October 2021. 38 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua", "A APPENDIX": "Table AI. Summary of mainstream research on complementary fashion recommendation. Methods, input and evaluation settings refer to Table. 2, and '/' denotes other methods that are not listed in the table. Dataset refers to Table. AIII. , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 39 Table AII. Summary of mainstream research on outfit compatibility modeling. Methods, input and evaluation settings refer to Table. 2, and '/' denotes other methods that are not listed in the table. Dataset refers to Table. AIII.", "A.1 Dataset Summary": "A.1.1 Data Sources. E-commerce platforms and online fashion communities are the two main data sources for fashion recommendation research. E-commerce data records real user-item interactions, which naturally support the research of PFR. Meanwhile, the data from fashion community websites, including social media, provides more domain-specific information such as outfit composition and style evolution, which can be applied for CFR or OR research. So far, most existing fashion recommendation datasets were developed from the following sources: · Polyvore 1 is a fashion website that enables fashion lovers to create outfits as compositions of clothing items. Polyvore provides a large number of high-quality fashion outfits. Moreover, each item for the composition of outfit is associated with rich content information including the image, descriptive tags and text, category information etc., making it a great data source for outfit-related studies such as compatibility modeling, outfit generation and recommendation. To this end, many fashion datasets have been constructed in previous studies based on Polyvore. · Taobao 2 is a large-scale online-shopping platform, which is also the largest online fashion shopping platform in China. Fashion is one of the biggest and the oldest businesses of Taobao. A new application iFashion has been 1 https://en.wikipedia.org/wiki/Polyvore 2 https://www.taobao.com , Vol. 1, No. 1, Article . Publication date: October 2021. 40 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua created to support fashion outfit recommendation. Approximately 1.5 million content creators were actively supporting Taobao as of March 31, 2018. · Amazon 3 is one of the largest world-wide e-commerce platforms based in the US and started its business as bookseller. For now, fashion has become one of the main product categories sold on Amazon. Both the Taobao and Amazon provides real-world user-involved interaction records in online shopping context, which are of great value to develop models for practical use. · Other fashion communities sources include Lookbook, Chictopia and Instagram 4 . Other e-commerce sources include eBay, ASOS, JD 5 and some single brand websites. A.1.2 Existing Datasets. We present the organization of the existing datasets in Table AIII, which contains the publication year, the basic statistics, and a brief introduction to each dataset. From the dataset sorting, we can see that more than 30 datasets are proposed in the literature for fashion recommendation tasks, which are quite rich in kind. Although these datasets might be for different sub-tasks, the data options for some specific tasks are still too many. For example, based on Polyvore, around 14 datasets have been constructed, most of them applied for compatibility modeling or outfit recommendation. However, there is still no benchmark for certain tasks to fairly evaluate different approaches. Most existing datasets have been applied only once in evaluating the corresponding methods, which is sometimes unnecessary. Even though some methods want to emphasize certain features or information in addressing certain tasks, they could have expanded or improved the existing datasets rather than proposing a new one, usually introducing too many differences in the new dataset. For example, almost every Polyvore-based dataset has side information on the item category, but such information can be different, being fine-grained in some datasets (Li's Polyvore categorizes items into 333 categories) but coarse in others (only five categories). Such differences in details can also affect the evaluation of different methods. We can conclude that there is so far no satisfactory benchmark dataset for any sub-task in fashion recommendation. For personalized fashion recommendation, most methods have been developed based on the Amazon Review dataset [68, 110] (No. 23 in Table AIII), and are therefore more consistent in their development and more comparable. However, only applying one dataset somehow makes the results biased and unable to comprehensively evaluate the methods. Even though it is hard to find another dataset so far that has been specifically proposed for personalized fashion recommendation, we can create one based on the available extensive datasets. The iFashion dataset (No. 26 in Table AIII) was originally for the outfit recommendation task. But it provides the sequences of the user's successive clicking on items, offering real-world user-item interaction data with another type of behavior and from another source, which can serve as a great complement for the Amazon dataset (No. 23) for the personalized fashion recommendation task. For compatibility learning or complementary recommendation, as we mentioned above, although the available datasets are many, few of them have been applied more than once. In fact, most datasets are from three main sources: Polyvore, Taobao, and IQON, which have different characteristics, such as different outfit styles (western, Chinese, and Japanese). By combining the three sources of data, more solid benchmark datasets can be developed. 3 https://www.amazon.com 4 https://lookbook.nu/, https://chictopia.nu/, https://www.instagram.com/ 5 https://www.ebay.com/, https://www.asos.com/, https://www.jd.com , Vol. 1, No. 1, Article . Publication date: October 2021. Computational Technologies for Fashion Recommendation: A Survey · 41 Table AIII. Existing datasets for fashion recommendation grouped by data sources. The numbers and quantities are reported approximately. K denotes thousands and M denotes millions. Abbreviation is used to denote different item information as well, C for Category, T for Textual description, including titles, I for Image, V for Votes, A for Attributes, O for Occasion, L for Location, S for Style, and H for Hashtag or other tags. NA denotes not applicable and / denotes the information is not given in the original papers. , Vol. 1, No. 1, Article . Publication date: October 2021.", "42 · Yujuan Ding, Zhihui Lai, P.Y. Mok, and Tat-Seng Chua": "6 https://tianchi.aliyun.com/dataset/dataDetail?dataId=3326 , Vol. 1, No. 1, Article . Publication date: October 2021.", "Computational Technologies for Fashion Recommendation: A Survey · 43": ", Vol. 1, No. 1, Article . Publication date: October 2021."}
