{"A Preference-oriented Diversity Model Based on Mutual-information in Re-ranking for E-commerce Search": "Huimu Wang ∗ Mingming Li ∗ wanghuimu1@jd.com limingming65@jd.com JD.com Beijing, China Dadong Miao † Songlin Wang Guoyu Tang miaodadong@jd.com wangsonglin3@jd.com tangguoyu@jd.com JD.com Beijing, China Lin Liu Sulong Xu Jinghe Hu liulin1@jd.com xusulong@jd.com hujinghe@jd.com JD.com Beijing, China", "ABSTRACT": "", "ACMReference Format:": "Re-ranking is a process of rearranging ranking list to more effectively meet user demands by accounting for the interrelationships between items. Existing methods predominantly enhance the precision of search results, often at the expense of diversity, leading to outcomes that may not fulfill the varied needs of users. Conversely, methods designed to promote diversity might compromise the precision of the results, failing to satisfy the users' requirements for accuracy. To alleviate the above problems, this paper proposes a Preference-oriented Diversity Model Based on Mutual-information (PODM-MI), which consider both accuracy and diversity in the reranking process. Specifically, PODM-MI adopts Multidimensional Gaussian distributions based on variational inference to capture users' diversity preferences with uncertainty. Then we maximize the mutual information between the diversity preferences of the users and the candidate items using the maximum variational inference lower bound to enhance their correlations. Subsequently, we derive a utility matrix based on the correlations, enabling the adaptive ranking of items in line with user preferences and establishing a balance between the aforementioned objectives. Experimental results on real-world online e-commerce systems demonstrate the significant improvements of PODM-MI, and we have successfully deployed PODM-MI on an e-commerce search platform.", "CCS CONCEPTS": "· Information systems → Learning to rank ; Information retrieval diversity .", "KEYWORDS": "Re-ranking, Mutual-information, Diversity, E-commerce Search ∗ Both authors contributed equally to this research. † Corresponding author. Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than the author(s) must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. SIGIR '24, July 14-18, 2024, Washington, DC, USA © 2024 Copyright held by the owner/author(s). Publication rights licensed to ACM. ACM ISBN 979-8-4007-0431-4/24/07 https://doi.org/10.1145/3626772.3661359 Huimu Wang, Mingming Li, Dadong Miao, Songlin Wang, Guoyu Tang, Lin Liu, Sulong Xu, and Jinghe Hu. 2024. A Preference-oriented Diversity Model Based on Mutual-information in Re-ranking for E-commerce Search. In Proceedings of the 47th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '24), July 14-18, 2024, Washington, DC, USA. ACM, New York, NY, USA, 5 pages. https: //doi.org/10.1145/3626772.3661359", "1 INTRODUCTION": "Product Search Engine is a crucial component of E-commerce platforms. To improve the efficiency of consumer decision-making during searches, a slate containing a limited number of ranked items is often presented in the search engine. In this case, most existing ranking methods [1, 3-6, 6-8, 10, 12, 18, 19] often concentrate on predicting the click-through rate (CTR) for individual items, neglecting the critical mutual influence among contextual items and the user's demands. As a result, a re-ranking stage is introduced to rearrange the initial list from the ranking stage to meet user demands. Nevertheless, User demands are inherently dynamic, shifting based on their search patterns and interactions. Searches for broad terms typically elicit a desire for a diverse range of options, while specific queries necessitate more targeted and precise results. This behavior highlights the importance of considering both accuracy and diversity in re-ranking algorithms. However, the existing methods often demonstrate divergent priorities. In terms of precision, certain methods tend to prioritize precision over other factors, such as RNN-based models [2, 13, 19] . These methods suffer from feature information degradation with encoding distance and non-parallelizable characteristics caused by RNN [16]. Conversely, methods like context-wise re-ranking strategy [1, 15] leverage a context-wise evaluation model to capture the mutual influence among items and re-predict the CTR of each item. However, they do not directly model the diversity of user intent, resulting in a ranking that prioritizes precision over diversity and neglects the user's diverse needs. Regarding diversity, there exist effective diversity-promoting methods [3, 4]. However, these methods rely on point-wise rank scores to measure the relevance between items and user interest, without considering the interplay between contents. Although methods such as DPP extension [4, 9, 11], have addressed this issue, balancing relevance and diversity still depends on hyper-parameter tuning and may not satisfy the SIGIR '24, July 14-18, 2024, Washington, DC, USA Huimu Wang et al. diverse needs of different users. Moreover, methods based on greedy strategies may not obtain the global optimal solution. Totrack these aforementioned issues, a novel Preference-oriented Diversity Model Based on Mutual-information (PODM-MI) is proposed in this paper. Specifically, it consists of two components including a preference-oriented network (PON) and a self-adaptive model(SAM). The PON is designed to model the representation of user diversity preference and the diversity within the candidate items. In contrast, the SAM dynamically adjusts the order of candidate items to align with the user's diversity preferences. Specifically, PON employs a multi-dimensional Gaussian distribution to model both the diversity preferences of users and the representation of diversity among candidate items, deviating from conventional embedding techniques, which yields two significant benefits: enhanced robustness compared to traditional embeddings and a more comprehensive characterization of diversity uncertainty with a higher-dimensional perspective. In the search scenario, history queries and the corresponding items of users are employed to represent the diversity preferences. Upon modeling the diversity representation of users and the candidate items, the SAM module adjusts the ranking of items to align with the user's diversity preferences. More precisely, SAM enhances the consistency between the diversity preferences of users and the diversity present in the candidate items. This consistency is accomplished by the maximization of mutual information between the user's diversity preferences and the candidate items' diversity. We introduce a variational posterior estimator to derive a tractable lower bound for the mutual information objective. This is also the first application of mutual information theory in the re-ranking model. After enhancing the consistency, a utility matrix predicated on the reinforced consistency is derived, which enables the adaptive re-ranking of items to reflect user preferences, thus maintaining equilibrium between diversity and accuracy. Moreover, the model is designed for straightforward implementation as an add-on module to any existing re-ranking algorithm. The contributions of this paper can be summarized as follows: · To the best of our knowledge, this is the first work that introduces mutual information to balance diversity and accuracy for E-commerce re-ranking. · We propose a novel model that utilizes multi-dimensional Gaussian distribution to model diversity preference and adaptively matches the ranking results with user demands by maximizing the lower bound of mutual information. · We conduct extensive experiments on a real-world dataset. Experimental results show that our model achieves significant improvement over the state-of-the-art models. · PODM-MI has been successfully deployed on the home search platform in JD and brought substantial economic benefits.", "2 PROBLEM FORMULATION": "Typically, The goal of the re-ranking is to elaborately select candidate items from the input ranking list and rearrange them into the final ranking list, followed by the exhibition for users. Mathematically, with a certain user 𝑈 and a ranking list of candidate items 𝐶 = { 𝑐 𝑖 } 𝑁 𝐶 𝑖 = 1 , where 𝑐 𝑖 is the 𝑖 -𝑡ℎ item and 𝑁 𝐶 is the total number Figure 1: The framework of PODM-MI Preference Encoder Consistency enhancement Backbone Preference decoder Diversity Encoder 𝜌 ! Diversity decoder Utility Matrix Concat layer 𝜏 ! Query flow User behavior Ranking list User behavior PON PON SAM PODM-MI of items in ranking list. The task of re-ranking stage is to learn a strategy 𝜋 ∗ , 𝐶 𝜋 ∗ → 𝐹 which selects and rearranges items from 𝐶 , and present a final ranking list ( 𝐹 = GLYPH<8> 𝑓 𝑗 GLYPH<9> 𝑁 𝐹 𝑗 = 1 , 𝑁 𝐹 < 𝑁 𝐶 ) with the aim of meeting users demands such as diversity and accuracy.", "3 METHODS": "", "3.1 Overview": "We present the overview structure of PODM-MI consisting of preference-oriented network (PON) and a self-adaptive model(SAM) in Figure 1. Specifically, we take ranking list 𝐶 = { 𝑐 𝑖 } 𝑁 𝐶 𝑖 = 1 and user's permutation-level behavior (such as click behavior flow, add-to-cart behavior flow) as the input of PODM-MI. Then PON is utilized to model both the diversity preferences of users and the representation of diversity among candidate items. Next, SAM enhances the consistency between the diversity preferences of users and the diversity present in the candidate items. Subsequently, a utility matrix is then derived from this enhanced correlation, influencing the scores produced by the backbone network. This matrix is dynamically tuned to user preferences, facilitating the reordering of final ranking outcomes to better satisfy user preferences. The detailed structure of PON and SAM will be introduced separately in the following sections.", "3.2 Preference-oriented Network": "In the e-commerce search scenario, historical queries and their associated items provide an effective representation of user intent. Thus, our methodology not only employ typical behavioral patterns (click behavior flow, add-to-cart behavior flow,etc.) but also includes query trajectories to enhance the depiction of user preferences. After determining the features of the user preferences modeling, the next step is to determine the modeling method for user preferences representation. Traditional models tend to treat the dynamism of the user preferences as deterministic, yielding static user A Preference-oriented Diversity Model Based on Mutual-information in Re-ranking for E-commerce Search SIGIR '24, July 14-18, 2024, Washington, DC, USA embeddings within a latent space. This approach is inadequate for capturing the complex nature of user preferences in dynamic realworld contexts. Note that distribution representations introduce uncertainties and provide more flexibility compared with one single fixed embedding. Previous works [20, 29] have also demonstrated the superiority of representing user preferences as a distribution rather than an embedding. Therefore, we adopt a multi-dimensional Gaussian distribution, as delineated in Equation 1, to model the evolving trends of the user preferences. The multi-dimensional Gaussian distribution governed by a mean vector and one diagonal covariance matrix. To be specific, user intent has two embedding representations, which are for mean 𝜇 and covariance ˝ that obtained from preference encoder.  where 𝑥 is a n-dimensional vector representing the user preferences, 𝜇 1 is the mean vector , and ˝ 1 is the covariance matrix. Wealso model the candidate items with multi-dimensional Gaussian distribution.  where 𝑦 is a n-dimensional vector representing ranking list, 𝜇 2 is the mean vector , and ˝ 2 is the covariance matrix.", "3.3 Self-adaptive Model": "Upon modeling both the user preferences and the diversity inherent in the candidate items, the next step is to consider how to make the ranking results highly correlated with user intent. Mutual information, which gauges the shared information between two variables, can be utilized to quantify the correlation between candidate items and user preferences. By maximizing mutual information between the aforementioned two (as shown in (3)), the distribution of the candidate items is highly consistent with the distribution of user intent.  where 𝑜 𝑖 represents the given ranking list. However, estimating and maximizing mutual information is often intractable. Drawing inspiration from the literature of variational inference, we introduce a variational posterior estimator to derive a tractable lower bound for the mutual information objective:  where 𝑞 ( 𝑥 ) is the marginal distribution of 𝑞 ( 𝑥 | 𝑦 ) is the conditional distribution of 𝑋 given 𝑌 , and 𝑝 ( 𝑦 | 𝑥 ) is the conditional distribution of 𝑌 given 𝑋 . The objective function for maximizing the lower bound of mutual information can be formulated as:  After enhancing their consistency, we design a learnable utility matrix to further align the final ranking results with user preferences. The learnable matrix is obtained by taking the dot product between a learnable weight matrix and the features that have been aligned. Then we multiply the utility matrix with scores computed from backbone network. By adjusting the values of the matrix, we can control the relative importance of different items and trends in the ranking process. For example, if certain items are more suitable for user preferences, we can adjust the values of the matrix to give them more weight in the ranking process. This approach allows the ranking results to be adaptively adjusted according to user intent.", "3.4 Model Training": "The proposed model is easily deployed as a follow-up module after any ranking algorithm by directly using the existing ranking feature vectors. Therefore, The loss of mutual information can be considered as an auxiliaries loss. For example, we use the order data as label and minimize the loss function for a backbone (such as PRM[15]):  where 𝑧 𝑖 is the label (the label is positive if the item is purchased) Then the total loss for the training process is :  where 𝐿 1 is the loss function of mutual information and 𝜒 is the hyper-parameter.", "4 EXPERIMENTS": "", "4.1 Datasets and Metrics": "We collect search logs of the user for over two months from JD.com, one of China's largest B2C e-commerce websites, with the dataset size exceeding one billion and encompassing hundreds millions of items and users. For accuracy estimation, we choose Area Under ROC (Auc) to evaluate offline performance. 𝐴𝑢𝑐 𝑜𝑟𝑑 @ 𝑘 ( 𝐾 ∈ { 1 , 3 , 5 , 10 } ) denote Auc for the top-k items with respect to actual purchasing behaviors. For diversity evaluation, we use entropy to evaluate the richness of top-k items. 𝐵𝑟𝑎𝑛𝑑 / 𝑆ℎ𝑜𝑝 @ 𝑘 ( 𝐾 ∈ { 10 , 20 } ) denote the entropy related to brand and store of items. Moreover, we use UCVR (User Conversion Rate), UCTR (User Click Rate) and UV_add_cart (User Add-to-cart Rate) to evaluate online performance.", "4.2 Baselines": "In the industrial field, there are many classical methods for reranking. The most widely used work could be divided into several backbones: list-wise, evaluator-generator,etc. Without loss of generality, we select PRM [15] (considering the personalized information) as baseline with the backbone of list-wise, and EGR [14] as the representive of the backbone of evaluator-generator. Our method is a general model, which could be adapted in various versions of re-ranking framework. In this paper, we chose the PRM with PODM-MI and EGR with PODM-MI for a fair comparison.", "4.3 Implementation Details": "To ensure a fair comparison among different methods, we keep the feature columns, vocabulary size, the dimension of query/item unchanged. Specifically, we set the batch size as 1024. The learning SIGIR '24, July 14-18, 2024, Washington, DC, USA Huimu Wang et al. Table 1: Overall performance comparison on the different methods in terms of 𝑎𝑢𝑐 𝑜𝑟𝑑 @ 𝑘 and 𝑒𝑛𝑡𝑟𝑜𝑝𝑦 @ 𝑘 . Table 2: Online performance of A/B tests in JD. p-value is obtained by t-test. rate is searched from 10 -4 to 10 -2 . All models use Adagrad as the optimizer. The hyper-parameter in loss function is set to 1.", "4.4 Offline Experimental Results": "The experimental results are shown in 1. From the results, we can conclude that PODM-MI achieves a significant improvement with different backbones. Specifically: 1) Regarding precision metrics, the PODM-MI model significantly outperforms the baseline model in terms of AUC, which demonstrates that the ranking results of the model can effectively meet users' needs and illustrates its superiority and effectiveness. 2) Regarding diversity, the PODM-MI model shows varying degrees of improvement in store and brand diversity compared to other methods, indicating that the model effectively improves the diversity of ranking results. It is noteworthy that while improving diversity, precision has also been significantly improved, indicating that our model has effectively balanced precision and diversity. 3) Regarding compatibility, the PODM-MI model shows significant improvements in both performance and diversity compared to the original backbone when deployed on different backbones, indicating that our model is modular and can be easily deployed as a follow-up after any ranking algorithm.", "4.5 Online Experimental Results": "To investigate the effectiveness of the PODM-MI, we conduct online A/B testing in the JD e-commerce search engine. The online performance is compared against the previous EGR model online and is averaged over four consecutive weeks. As shown in Table.2, the performance of PODM-MI increases by 0.66% in UCVR (p-value=0), 0.26% in terms of diversity (p-value=0), and 0.24% in UCTR (pvalue=0.01). Small p-value means statistically significant, which demonstrates that PODM-MI not only enhances the likelihood of user purchases but also augments the diversity of items displayed in search results. Note that every 0.10% increase in UCVR or UCTR brings great revenues for the company, hence the improvement achieved by the PODM-MI was significant. Consequently, PODMMI has been fully integrated into the JD e-commerce search engine.", "4.6 Correlation Visualisation": "Distinct entropy values for the ranking results correspond to varied user intents. In order to assess whether the ranking results are Figure 2: The correlation visualisation high correlated with user intent, we visualized the distribution of entropy values of ranking results according to user intent using T-SNE [17] dimensionality reduction. For enhanced clustering, we categorized the entropy levels into 8 distinct groups. The results presented in Figure 2 demonstrate that the clustering of user behavior flows with different levels of result diversity is highly noticeable, with well-defined boundaries for the distribution clusters of user intent. This indicates that the proposed model has successfully captured the underlying trends of user intentions and adjusted the ranking results accordingly. Notably, the entropy values of the ranking results increase as the user's intentions become more diverse, reflecting a higher degree of diversity in the ranking outcomes. Conversely, as the user's intentions become more precise, the entropy values decrease, indicating a higher level of accuracy in the ranking results.", "5 CONCLUSIONS": "This paper proposes a preference-oriented diversity model based on mutual-information, which harmonizes accuracy and diversity in re-ranking. This is the first work that introduces mutual information to balance diversity and accuracy for E-commerce re-ranking. It consists of two components including PON and SAM. PON utilizes Multidimensional Gaussian distributions based on variational inference to model users' diversity preferences with uncertainty. SAM establishes the high correlation between the candidate items and user preferences by maximizing their mutual information. Then utility matrix allows the ranking results to be adaptively adjusted according to user preferences. Extensive experiments conducted on a real-world dataset and the successful deployment on an ecommerce search platform show that the proposed framework can significantly surpass other state-of-the-art models. A Preference-oriented Diversity Model Based on Mutual-information in Re-ranking for E-commerce Search SIGIR '24, July 14-18, 2024, Washington, DC, USA", "REFERENCES": "[1] Qingyao Ai, Keping Bi, Jiafeng Guo, and W Bruce Croft. 2018. Learning a deep listwise context model for ranking refinement. In The 41st international ACM SIGIR conference on research & development in information retrieval . 135-144. [2] Irwan Bello, Sayali Kulkarni, Sagar Jain, Craig Boutilier, Ed Chi, Elad Eban, Xiyang Luo, Alan Mackey, and Ofer Meshi. 2018. Seq2slate: Re-ranking and slate optimization with rnns. arXiv preprint arXiv:1810.02019 (2018). [3] Jaime Carbonell and Jade Goldstein. 1998. The use of MMR, diversity-based reranking for reordering documents and producing summaries. In Proceedings of the 21st annual international ACM SIGIR conference on Research and development in information retrieval . 335-336. [4] Laming Chen, Guoxin Zhang, and Eric Zhou. 2018. Fast greedy map inference for determinantal point process to improve recommendation diversity. Advances in Neural Information Processing Systems 31 (2018). [5] Qiwei Chen, Changhua Pei, Shanshan Lv, Chao Li, Junfeng Ge, and Wenwu Ou. 2021. End-to-End User Behavior Retrieval in Click-Through Rate Prediction Model. arXiv preprint arXiv:2108.04468 (2021). [6] Qiwei Chen, Yue Xu, Changhua Pei, Shanshan Lv, Tao Zhuang, and Junfeng Ge. 2022. Efficient Long Sequential User Data Modeling for Click-Through Rate Prediction. arXiv preprint arXiv:2209.12212 (2022). [7] Heng-Tze Cheng, Levent Koc, Jeremiah Harmsen, Tal Shaked, Tushar Chandra, Hrishi Aradhye, Glen Anderson, Greg Corrado, Wei Chai, Mustafa Ispir, et al. 2016. Wide & deep learning for recommender systems. In Proceedings of the 1st workshop on deep learning for recommender systems . 7-10. [8] Yu Gong, Ziwen Jiang, Yufei Feng, Binbin Hu, Kaiqi Zhao, Qingwen Liu, and Wenwu Ou. 2020. EdgeRec: recommender system on edge in Mobile Taobao. In Proceedings of the 29th ACM International Conference on Information & Knowledge Management . 2477-2484. [9] Zhe Gong, Wei-Lun Chao, Fei Sha, and Chengxiang Zhang. 2014. Practical diversified recommendations on youtube with determinantal point processes. In Proceedings of the 8th ACM Conference on Recommender systems . ACM, 281-284. [10] Huifeng Guo, Ruiming Tang, Yunming Ye, Zhenguo Li, and Xiuqiang He. 2017. DeepFM: a factorization-machine based neural network for CTR prediction. In Proceedings of the 26th International Joint Conference on Artificial Intelligence . 1725-1731. [11] Yanhua Huang, Weikun Wang, Lei Zhang, and Ruiwen Xu. 2021. Sliding spectrum decomposition for diversified recommendation. In Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery & Data Mining . 3041-3049. [12] Jianxun Lian, Xiaohuan Zhou, Fuzheng Zhang, Zhongxia Chen, Xing Xie, and Guangzhong Sun. 2018. xdeepfm: Combining explicit and implicit feature interactions for recommender systems. In Proceedings of the 24th ACM SIGKDD international conference on knowledge discovery & data mining . 1754-1763. [13] Zihan Lin, Hui Wang, Jingshu Mao, Wayne Xin Zhao, Cheng Wang, Peng Jiang, and Ji-Rong Wen. 2022. Feature-aware diversified re-ranking with disentangled representations for relevant recommendation. In Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining . 3327-3335. [14] Yue Lv, Yongfeng Zhang, Jiaxin Mao, Qingyao Ai, and Weidong Liu. 2020. Validation Set Evaluation can be Wrong: An Evaluator-Generator Approach for Maximizing Online Performance of Ranking in E-commerce. In Proceedings of the 43rd International ACM SIGIR conference on research and development in Information Retrieval, SIGIR 2020, Xi'an, China, July 25-30, 2020 . ACM, 1171-1180. https://doi.org/10.1145/3397271.3401093 [15] Changhua Pei, Yi Zhang, Yongfeng Zhang, Fei Sun, Xiao Lin, Hanxiao Sun, Jian Wu, Peng Jiang, Junfeng Ge, Wenwu Ou, et al. 2019. Personalized re-ranking for recommendation. In Proceedings of the 13th ACM conference on recommender systems . 3-11. [16] David E Rumelhart, Geoffrey E Hinton, and Ronald J Williams. 1986. Learning representations by back-propagating errors. nature 323, 6088 (1986), 533-536. [17] Laurens Van der Maaten and Geoffrey Hinton. 2008. Visualizing data using t-SNE. Journal of machine learning research 9, 11 (2008). [18] Guorui Zhou, Na Mou, Ying Fan, Qi Pi, Weijie Bian, Chang Zhou, Xiaoqiang Zhu, and Kun Gai. 2019. Deep interest evolution network for click-through rate prediction. In Proceedings of the AAAI conference on artificial intelligence , Vol. 33. 5941-5948. [19] Tao Zhuang, Wenwu Ou, and Zhirong Wang. 2018. Globally optimized mutual influence aware ranking in e-commerce search. arXiv preprint arXiv:1805.08524 (2018).", "A COMPANY PORTRAIT": "JD.com, Inc., also known as Jingdong, is a Chinese e-commerce company headquartered in Beijing. It is one of the two massive B2C online retailers in China by transaction volume and revenue, a member of the Fortune Global 500. When classified as a tech company, it is the largest in China by revenue and 7th in the world in 2021.", "B PRESENTER PROFILES": "Huimu Wang is a researcher in the Department of Search and Recommendation at JD.com Beijing. He received his doctor degree in Institute of Automation, Chinese Academy of Sciences. His research focuses on reinforcement learning and natural language processing. Mingming Li is a researcher in the Department of Search and Recommendation at JD.com Beijing. He received his doctor degree in Institute of Information Engineering, Chinese Academy of Sciences. His research focuses on information retrieval."}
