{
  "A Survey on Intent-aware Recommender Systems": "DIETMAR JANNACH, University of Klagenfurt, Austria MARKUS ZANKER, Free University of Bozen-Bolzano and University of Klagenfurt, Italy and Austria Many modern online services feature personalized recommendations. A central challenge when providing such recommendations is that the reason why an individual user accesses the service may change from visit to visit or even during an ongoing usage session. To be effective, a recommender system should therefore aim to take the users' probable intent of using the service at a certain point in time into account. In recent years, researchers have thus started to address this challenge by incorporating intent-awareness into recommender systems. Correspondingly, a number of technical approaches were put forward, including diversification techniques, intent prediction models or latent intent modeling approaches. In this paper, we survey and categorize existing approaches to building the next generation of Intent-Aware Recommender Systems (IARS). Based on an analysis of current evaluation practices, we outline open gaps and possible future directions in this area, which in particular include the consideration of additional interaction signals and contextual information to further improve the effectiveness of such systems. CCS Concepts: · Information systems → Recommender systems . Additional Key Words and Phrases: Recommender Systems, Intent-Awareness, Survey",
  "ACMReference Format:": "Dietmar Jannach and Markus Zanker. 2024. A Survey on Intent-aware Recommender Systems. ACM Trans. Recomm. Syst. 1, 1, Article 1 (January 2024), 31 pages. https://doi.org/10.1145/3700890",
  "1 INTRODUCTION": "Recommender systems play a vital role for many modern online services, e.g., in e-commerce or media streaming, where they can create substantial value both for consumers and service providers [46]. Correspondingly, a multitude of technical approaches to generate personalized recommendations have been proposed over the last decades [104]. Traditional algorithms-beginning with the early GroupLens system [103]-usually consider the entire history of known user preferences to create recommendation lists. As a result, such recommendations typically reflect the potentially diverse set of user interests and needs that were observed over time. However, in many cases when we access an online service, we do so with a particular goal or intent in mind. For the case of music streaming services, for example, our goal might either be to quickly access our favorite music, to find music to play in the background, or to discover interesting new artists [54, 90]. Likewise, in an e-commerce setting, we might access an online shop to research the set of choices in a certain item category, to continue our previous shopping session, or just to browse the catalog for inspiration [114]. As a result, the set of suitable recommendations can largely depend on the user's underlying intent, which may not only change from one visit of the service to the next but even during an ongoing usage session. Authors' addresses: Dietmar Jannach, dietmar.jannach@aau.at, University of Klagenfurt, Austria; Markus Zanker, markus. zanker@unibz.it, Free University of Bozen-Bolzano and University of Klagenfurt, Italy and Austria. Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. © 2024 Association for Computing Machinery. 2770-6699/2024/1-ART1 $15.00 https://doi.org/10.1145/3700890 ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:2 Dietmar Jannach and Markus Zanker Given these diverse sets of potential short-term intents, a recommendation algorithm that considers all of our past preferences independently of the user's current situation and goals may thus not be optimal. Since it can be difficult to correctly guess a user's specific intent when accessing the service, a common solution in practice is to provide users with several recommendation lists on the landing page of the service, each of them addressing a different potential intent. Multiple recommendation lists are commonly used by media streaming providers such as Netflix or Spotify and on e-commerce sites like Amazon.com [31, 85, 90]. Alternatively, some services try to diversify their single-list recommendations to cover multiple potential user intents. They may, for instance, comprise items that presumably constitute novel and serendipitous discoveries to a given user while, at the same time, a small number of items the user has recently already seen is also included in recommendation lists. Due to the latter the user could conveniently continue a previous shopping session [66]. In the academic literature, the problem of diverse and time-varying user needs has been identified and addressed in different ways over time. In the realm of the traditional way of building recommender systems based on a given user-item interaction matrix, common approaches include intentional diversification of recommendations, temporal information and interest drifts, or utilization of contextual information like the user's current location and time [2, 8, 13, 51]. More recently, academic research has largely shifted from the traditional 'matrix completion' recommendation setting to sequence-aware and session-based recommendation problems [97, 136]. In these approaches, generated recommendations are commonly determined by considering the most recent interactions observed for a given user. The main underlying assumption of these approaches is that these recent interactions are a good reflection the user's underlying short-term intents. However, while the most recently observed user actions may be indicative of the underlying user intents, researchers have recently tried to incorporate intent-awareness into recommender systems in a more explicit manner. Importantly, reports from industrial applications emphasize the strong potential of adapting recommendations to the predicted intent(s) of users. For instance, a field test in the e-commerce domain [114] revealed that relevant business KPIs (key performance indicators) like purchase rates can be markedly improved when the recommendation system dynamically switches its strategy depending on the currently assumed user intent. Likewise, a study in the music streaming domain by Spotify [90] investigated the connections between observed user interactions, underlying intents and user satisfaction. One main conclusion of this work is that understanding user intents can be crucial to predict user satisfaction, and that different interaction signals are relevant as predictors, depending on the user's underlying intent. Given the high practical relevance of such approaches, the aim of our present work is to review the growing body of literature on intent-aware recommender systems (IARS). For this purpose, we have identified a larger set of recent works based on a semi-systematic literature search, and categorized these works along different dimensions. A particular focus of this survey lies on the technical approaches to incorporate intent-awareness into the system, such as diversification techniques, intent prediction models or latent intent modeling approaches. We furthermore review common application domains and evaluation procedures for IARS, which revealed a very strong focus on offline experimentation with an emphasis on prediction accuracy as the main metric. Finally, our survey helped us to identify open gaps in the literature and future research directions. Specifically, the increasing availability of additional pieces of information about users and their behavior as well as on item features and contextual factors opens continuously new opportunities to better predict a user's specific intent when interacting with the service. Furthermore, we see significant potential in the explicit consideration of application-specific intents within future IARS. The paper is organized as follows. Next, in Section 2, we review different notions of intentawareness as found in the literature, and we delineate our work from related streams of research. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:3 Furthermore, we describe our methodology of identifying relevant papers and discuss the relationship of our work to other surveys. In Section 3, we then categorize and discuss different technical approaches to build intent-aware recommender systems. Section 4 subsequently provides a landscape of current research in terms of the used types of data, evaluation approaches, and application domains. The paper finishes with a discussion of research gaps and future research directions.",
  "2 TERMINOLOGY AND RESEARCH METHODOLOGY": "In this section, we first elaborate a definition of intent-aware recommender systems based on how they are actually reported in the literature. Then, we explain our research methodology and discuss previous works.",
  "2.1 Terminology and Definitions": "According to the Cambridge Dictionary 1 , the noun 'intent' refers to ' the fact that you want and plan to do something ' or ' the intention to do something '. A similar action-oriented definition is provided by Wikipedia 2 , where intent is described as ' an agent's specific purpose in performing an action or series of actions. ' Common synonyms include the terms 'purpose', 'plan', 'goal', or 'aim'. We note that the word 'intention' is often used synonymous with 'intent' as well, even though the two terms are not entirely interchangeable, with the term 'intent' suggesting a ' clear[er] reasoning or great deliberateness.' 3 Intuitively, an intent-aware RS should therefore take into account why a user is interacting with a system or which goal she or he wants to achieve, thus, complementing the traditional approach of predicting which items might be relevant for the specific user. Notions of Intent in the Literature. In the surveyed literature researchers rarely specify explicitly what they mean by the terms 'intent' or 'intent-awareness' or refer to humanities and social sciences literature, e.g., [135, 139]. More frequently, they provide intuitive examples to illustrate their notion of an intent-aware system. Different interpretations of intent-awareness can be found, and these interpretations are typically tied to the technical approaches that are presented in the respective papers implementing intent-awareness in a system; we will discuss these technical approaches in more detail in Section 3. Following the spirit of early diversity-oriented IARS approaches, the authors of [55] for example state that ' [IARS] ensure that the set of recommendations contains items that cover each of the user's interests [...] . ' More recent works like [142] relate intents with observed actions and provide examples, in this case for shopping intents in the e-commerce domain, e.g., ' passing time ' or ' shopping for others '. In several other works, e.g., [19, 20], the term 'intent' is mostly considered to be equivalent with (observed) interest , e.g., in specific topics or item categories. Finally, in some works like [43], the term (short-term) 'intent' is merely used to describe a sequential recommendation approach that puts more emphasis on the last observed user interactions. Thus, intent is sometimes solely equated with observed user actions, without additional consideration of users' underlying motivations for these actions. Explicit Intent, Latent Intent, and Implicit Intent Models. Given the examples from the previous paragraph, we can roughly categorize existing IARS approaches into three classes. First, a comparably small number of the surveyed works are based on a small set of pre-defined and application-specific explicit user intents, e.g., ' discover new music to listen right now ' or ' find background music for listen to ' [90]. In such an approach, one can for example apply different recommendation strategies depending on the currently assumed intent. Second, some other works 1 https://dictionary.cambridge.org/ 2 https://en.wikipedia.org/wiki/Intent_(disambiguation) 3 https://www.britannica.com/dictionary/eb/qa/intent-and-intention ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:4 Dietmar Jannach and Markus Zanker provide examples of such explicit intents for illustration, e.g., ' shopping for others ' [142], but are actually based on the concept of 'latent' intents. In fact, much of the surveyed literature is based on the idea of incorporating (additional) latent variables in the models to be able to account for a typically small set of possible user intents. Third, there are a number of approaches, as mentioned above, in which intent is considered to be roughly equivalent to observed past interests in categories, certain item features, or even individual items. In such approaches, additional variables are commonly introduced, which are however not assumed to directly correspond to specific underlying intents in the sense of goals a user wants to achieve. Instead, such variables may, for instance, model the user's time-varying interest in certain item categories or other assumed relationships between individual items. We denote such approaches implicit intent models. A potential advantage of approaches that are based on explicit intents is that the suitability of a given set of recommendations for a particular intent can be more easily assessed. Furthermore, explicit intent-related information may be used to explain recommendations to users. When using a latent-intent modeling approach, this is not easily possible and it may even remain unclear if the latent intents have any strong correspondence with the intents that users may actually have in a given application setting. On the other hand, relying on latent intents enables the design of application-independent approaches and avoids incorporating application-specific knowledge into the models. We recall here that the general problem for all three categories is that the true (current) intent of a given user is usually unknown, and is 'reconstructed' or predicted from observed user actions. Notably, this also holds for approaches that are based on pre-defined explicit intents, which remain unknown unless users are explicitly asked about them. Definition. Our discussion shows that various notions of intent-awareness can be found in the literature. Some of these approaches explicitly refer to and model the users' underlying intentions and goals, whereas others consider the users' intents in an implicit way, e.g., by relating the users' last observed (category) interests to the underlying user motivations. In order to provide an inclusive definition of IARS, we characterize such systems as follows:",
  "' An IARS is a recommender system that is designed to capture the users' underlying current motivations and goals in order to support them. '": "Our teleological definition is purposely rather broad, yet it expresses that the design of any IARS should be driven by the ambition to support the users' current motivations. We emphasize that we use the term 'intent' to exclusively refer to the user's immediate or short-term motivations. Users may certainly have diverse preferences and needs over time. However, the core goal of an IARS is to identify the current need or intent when a user interacts with the recommendation service. Given the breadth of different notions of intent-awareness mentioned above, a multitude of technical ways exist to implement intent-awareness. On one end of the spectrum, there are approaches based on an explicit list of pre-defined application-specific intents. In contrast, there are also works in which a sequential recommender system that puts more emphasis on the most recently observed interactions is seen as a mechanism to implement an (implicitly) intent-aware system, e.g. [43]. One might argue that any sequential next-item prediction model may be thought of as being intent-aware. We however recall that our definition is based on the design goals of a model. Let us consider Amazon's ' Customers who bought ...also bought ' approach as an example for a basic nextitem recommendation technique. The recommendations returned for a given item by this purely statistical approach may either be alternatives (similar movies on a video-on-demand service) or complementary items (accessories for a smartphone on an e-commerce shop). In our interpretation, such an approach would therefore not be considered intent-aware. The reason is that there is ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:5 no element in the underlying design of the approach that aims at capturing the user's current motivations or intent, i.e., whether the user looks for alternatives or complementary items. Relation to Other Areas. Besides the described relation to sequential and session-based approaches, also time-aware recommendation techniques [13]-and systems that consider user preference drifts over time-may be used to implement intent-awareness in a recommender systems. Furthermore, one may use contextual information [2] to predict the current user's intent and adapt the recommendations accordingly. 4 Finally, some early intent-aware approaches follow a personalized diversification approach, e.g., in the form of calibration [55], to ensure that the provided recommendations cover a larger number of possible current user intents. We iterate here that our definition of IARS is not so much focused on the technical way of implementing intent-awareness. Instead, it targets at the underlying ambition when designing a recommender system. Following this argument, an RS that implements a calibration approach may be designed to support intent-awareness, but it may also be merely designed to increase the diversity or reduce the popularity of recommendations on an aggregate level, independent of an individual user's current intent. We note that the concept of user intent can also be found in the context of conversational recommender systems (CRS) [44]. There, however, intent (and the problem of intent detection ) refers to what we may call 'micro intents' during a conversation. These micro-intents rather relate to what the user wants to express (e.g., ask for an explanation, reject or accept a recommendation) in an ongoing dialogue, see also [52], than to their underlying motivation to interact with the CRS in the first place. The relation of such works to our present work on IARS is therefore limited.",
  "2.2 Research Methodology": "Identification of relevant papers. We adopted a semi-systematic approach to identify relevant papers. First, we queried services like Google Scholar and digital libraries for scientific papers that mention the terms 'intent' or 'intention' together with the term 'recommend' in the title or abstracts. We then screened these papers for relevant ones and followed the references mentioned in these papers to identify additional papers. We only retained papers that had undergone a peer-review process, i.e., we excluded preprints from our analysis. Furthermore, a paper was considered relevant if its contribution was motivated by the idea of intent-awareness in the sense of our definition from above even though it did not explicitly contain our search terms in the title or abstract. As such, a small number of papers was considered that emphasized on identifying and addressing the user's current aims and interests. We also identified a number of works which mention the term 'intent' in the title or abstract, but not in a context that is relevant for our survey. For example, some works aim at predicting if a consumer will make a purchase in an ongoing session or not, e.g., [102]. In such works, the goal is not to make recommendations that match a certain intent, as done in IARS, but to assess the general propensity of a consumer to make a purchase, see also [64]. Overall, we ended up with 85 papers that we considered relevant and which we categorize later in Section 3. A possible limitation of our work is that our survey is not based on the strict procedures of a systematic review in the sense of Kitchenham et al. [58, 59]. Nonetheless, by using relevant queries and by applying a snowballing procedure to find additional papers, we are confident that our survey comprises a representative collection of papers reflecting the main areas of IARS research and capturing the conceptual breadth of the field. Our literature search also surfaced surveys that 4 We consider context-aware recommender systems to be different from intent-aware systems, see also [99]. Context information usually describes the external situation of a user, e.g., their location or the current time, whereas user intent is referring to the 'inner' motivations of the user. Contextual factors may certainly influence the user's intent. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:6 Dietmar Jannach and Markus Zanker did not propose a technical contribution or reported an experimental study. We discuss these papers separately next. Relation to other surveys. Surveys on related the areas, as discussed above, such as time-aware, contextual, and sequential recommender systems, can be found in [2, 8, 13, 51, 97, 136]. Early intentaware recommendation systems were inspired by existing approaches to search result diversification in the field of Information Retrieval, see [108] for a related survey. Indeed, considering the users' intents, e.g., in terms of their 'informational needs' has a long history in Information Retrieval, see [10] for an early taxonomy. A review of intent-awareness in the particular context of multimedia information retrieval can be found in [63]. Like in our survey, Kofler at al. [63] found that various notions of intent-awareness exist in the literature. Our definition of intent-awareness is similar to theirs by focusing on the 'why' dimension, i.e., the reason and goal behind a search, and not the 'what' dimension of information needs. In the area of music information retrieval, Schedl et al. [109] reviewed current challenges and visions in music recommendation research. While their review work is not primarily focused on the topic of user intents, they identify an improved understanding of listening intents and the user's purpose as a grand challenge in this area. In that context, they also mention that creators may have specific intents in mind when designing a playlist (e.g., for relaxing). Probably most similar to our survey is the work by Rafique et al. [99], which also focuses on intent-aware recommender systems. They, however, study the current and future role of IARS from the lens of smart cities. A particular emphasis is put on the role of recent technological developments in this context, e.g., the increasing usage of wearable and intelligent devices, the Internet of Things or Edge Computing approaches. As a result, new opportunities arise to build future intent-aware systems based, for instance, on real-time activity, emotion tracking or the explicit elicitation of user intents based on new sensors and devices. In their survey, the authors thus particularly focus on case studies of IARS in smart cities and on key requirements in this context.",
  "3 TECHNICAL APPROACHES FOR IARS": "In this section, we categorize the considered studies on intent-aware recommender systems according to their distinguishing algorithmic properties. Early Profile Diversity Matching approaches have a particular optimization goal and rely on item-metadata. Sequence- and Time-Aware models are based on the availability of temporal information about past user interactions. Finally, Latent Intent and Explicit Intent Modeling approaches assume the existence of a small set of common intents in a given application use case. Our resulting categorization is illustrated in Figure 1. Fig. 1. Overview of Technical Approaches Intent-aware Recommender Systems Profile Diversity Sequence- and Latent Intent Explicit Intent Matching Time Awareness Modeling Modeling ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:7 We note that some papers may fall into more than one category, e.g., a latent-intent modeling approach with the goal of diversification. In such cases, we categorized these works according to what we identified as their main conceptual contribution.",
  "3.1 Profile Diversity Matching": "The general goal of the approaches in this category is to generate diversified recommendations that cover the spectrum of past user preferences as good as possible. Such approaches are often designed under the assumption that the current user intent cannot be reliably estimated. Thus, if the provided recommendations cover multiple past intents (e.g., multiple categories of items), the chance increases that at least some of the provided suggestions are a match for the current user intent. Since the current user intent is not explicitly taken into account, such approaches, according to our above definition, fall into the category that considers users' short-term needs in an implicit way. Early works in this area were inspired by previous efforts towards search result diversification in the field of information retrieval [4, 107]. Besides avoiding redundant search results, one specific goal of search result diversification is to account for possible ambiguities of the provided search terms. The provided search results should thus match more than one of the possible interpretations (and underlying search intents) of a given query. Vargas et al. [127-129] were probably one of the first to transfer this approach to the field of recommender systems. Specifically, in their 'intent-oriented' diversification approach [128], they establish an analogy between a user profile in a recommender system and a search query in a retrieval system. The assumption is that recommender system users often have interests in various things over time, but not all of them are relevant at a given point in time. Technically, their approach is based on the deriving an aspect-oriented user profile based on explicit or latent item features. Then, a greedy re-ranking strategy is used to diversify a given accuracy-optimized recommendation list in a way that the various past user interests in the different aspects of the items are taken into account. As a result, this re-ranking procedure aims to avoid that a set of recommendations only covers one particular type of items, e.g., shopping items of only one category. Several later works built on these ideas. In [145], for example, the authors further explore the use of explicit vs. implicit aspects for intent-oriented diversification and propose a new model that maintains interpretability and leads to a better accuracy-diversity tradeoff. Tomeo et al. [125] consider the case of multiple relevant item attributes and put forward a method that can both lead to increased diversity at the level of individual user as well as at the aggregate level. Later Kaya and Bridge [55, 57] propose another re-ranking based intent-aware diversification approach, which is however not based on item features, but on user subprofiles . In their approach, subprofiles are automatically extracted sets of items from a given user profile, where each subprofile represents a distinct user taste. Differently from previous aspect-oriented works, the set of aspects is thus not the same across all users but user-individual. Generally, a central aspect of the discussed approaches is that they aim to diversify recommendations at the level of individual users rather than to maximize diversity at an aggregate level across users, which is the focus of various other research works on beyond-accuracy quality factors [51]. As such, these approaches are related to recent technical approaches for calibrated recommendations [50, 91, 118]. In calibration approaches, which are also often re-ranking based, the aim is to generate recommendations that well reflect the distribution of different item aspects (e.g., genres of a movie) in a given user profile. Intent-aware diversification and calibration approaches are therefore strongly related, with the main difference that diversification is not necessarily an explicit goal of calibration approaches [56]. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:8 Dietmar Jannach and Markus Zanker Two recent and technically alternative approaches that try to account for multiple interests in user profiles are discussed in [77] and [84]. The Octopus system presented in [84] focuses on the candidate generation phase of modern large-scale recommender systems [23]. Differently from common deep learning recommendation models, Octopus creates multiple vectors for representing a user to model the user's interests in a comprehensive manner. The system proposed in [77] adopts similar ideas and also relies on multi-channel networks, but focuses on sequential recommendation problems. A specific aspect of the works proposed in [77] and [84] is that they were designed for large-scale applications. The work in [77] was furthermore field-tested in an online experiment, where it showed to lead to a marked increase in user clicks and revenue. In terms of real-world applications, little is published in the literature on how large-scale platforms like YouTube technically diversify their recommendations to cater for time-varying user intents. Various real-world online services, e.g., Netflix or Amazon, however apparently address this problem by providing multiple recommendation lists to users at a time [31]. At least some of these lists are clearly connected to a particular assumed user intent, e.g., 'continue watching' or 'discover our new arrivals'. Even though such multi-list approaches are common in practice, only a few works on the topic can be found in the academic literature, e.g., [42, 100, 115].",
  "3.2 Sequence- and Time-Aware Approaches": "Approaches in this category leverage temporal or sequential information in user behavior logs to provide recommendations that assumably match the current intent of users. Commonly, the most recent observed user interactions are considered to be indicators or representatives for the underlying user needs or goals. In a broad interpretation of this definition, all session-based, all sequential and many time-aware recommender systems-see [8, 13, 97, 136] for related surveysmay thus be seen as intent-aware approaches. In the following, we will review a set of selected works, which in one or the other way mention intent-awareness as a motivating element for their model design. Session-based Approaches. In the context of session-based recommendation , where item suggestions are not based on long-term preference profiles but only the interactions that observed in an ongoing session, the models NARM [70] and STAMP [80] are sometimes referred to as being intent-aware. Both models use an attention mechanism to focus the recommendations on the assumed main user intent in a given session. In the case of STAMP, the potential user interest drift during a session is taken into account and a particular focus is put on the most recent interactions in a session. In this context, the authors differentiate between long-term and short-term signals, even though only the interactions of individual sessions are considered. 5 Generally, the need for identifying the current main intent may arise from the problem that a user might have multiple intents during one single session; plus, there can be noise, e.g., random interactions, in the logged user behavior. Another related approach in session-based recommendation can be found in [134], where a sequence modeling approach is combined with a neighborhood-based model, which considers similar sessions by other users that are assuming the same intent. Neighboring sessions are also considered in the 'intent-guided' approach in [93]. This follows a two-stage approach, where in the first phase, like STAMP, the focus lies on the most recent interaction to derive a representation of the assumed intent. This information is then used to select suitable neighbor sessions to compute final predictions. A quite different approach to intent-modeling in session-based recommendation is proposed in [33]. Specifically, in their graph-based approach, Guo et al. aim at extracting and leveraging user intent signals from 'groups of consecutive items' at different levels of granularity. 5 In other works, e.g., [43], the term long-term interests is used to denote interaction data from previous sessions of the same users. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:9 A graph-based approach is also proposed by Li et al. [75], who particularly focus on the integration of spatiotemporal information for improved session-based recommendation. 6 Finally, Jin et al. [49] focus on the new item problem in session-based recommendation, i.e., on the recommendation of items for which no past interaction data is available. The basis for their graph-based approach lies on the existence of a detailed taxonomy of categories and other side information on items. Session-Aware Approaches. In session-aware [97] recommendation systems, the logged user interactions are also organized in sessions. However, differently from pure session-based approaches, information about previous sessions of the current user are available, allowing for personalized session-based recommendations [98] based on long-term user preferences. In an early work in this area, Ludewig et al. [43] investigate the relative importance of long-term preferences and 'short-term intents' in the fashion e-commerce domain. Their results show that both long-term and short-term preferences signals can be relevant. Focusing strongly on the last few observed interactions is however essential in this domain. Additional analyses in this work also revealed that reminding consumers to continue their previous shopping session, as another typical intent of online shoppers, can be highly effective. Later, Huang et al. [39] propose the ASLM model to combine information from previous sessions with a user's current session in a deep learning approach. The model, which relies on Recurrent Neural Networks (RNN) and the attention mechanism, combines a long-term preference layer with a short-term intent layer to obtain improved performance. In a related study, Bernardis et al. [6] compare different session-aware recommendation models based on a real-world dataset from a video-on-demand online service. Their results indicate that considering long-term preferences in the examined RNN-based model can be beneficial, but the additional gains may be quite limited in this particular application setting. A technically quite different approach to combine historical user sessions and the current user intent is proposed by Lui et al. [82], taking into account practical constraints in online settings. They propose a generic learning framework that decouples the process of online learning of the current intent (in the ongoing session) and the learning process for the general user preferences (from past sessions). Moreover, to be able to quickly learn the current intent during a browsing session, a meta-learning approach is adopted instead of online learning techniques that have been previously used to deal with the streaming feedback on large online platforms. An alternative approach based on memory networks to combine long-term and short-term preferences is proposed in [162]. In this work, the users' short-term intents are mostly equated with their interest in specific item categories, leading to a hierarchical user model. Later on, this work was further developed by the authors in [163]. The improvement of the new model is that category information is no longer required, but multiple intent levels can be modeled instead. Sequential Approaches. A number of intent-aware approaches can also be found in the area of sequential recommendation settings. Like in the previously discussed session-based scenarios, sequential recommendation approaches are based on time-ordered user interaction logs and the general goal is to predict the user's immediate next action. However, these approaches do not assume that the data is organized in sessions. The differentiation of long-term preferences and short-term intents is central to several works also in sequential recommendation settings. Zhang et al. [158], for instance, propose a corresponding architecture that comprises two components to capture a user's transient interests based on their observed interaction trajectories: a self-attention model for short-term intents and a latent factor model for long-term preferences. Long-term and short-term aspects are also combined by Zhang et al. [157] and by Liu et al. [81], where the latter develop a novel approach to consider time intervals between observed events. Other approaches involve 6 In some ways the approach in [75] has elements of a latent-intent model technique as they rely on some form of intent embeddings. We iterate that the categorization of existing approaches in this section is not always entirely exclusive. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:10 Dietmar Jannach and Markus Zanker sophisticated temporal reasoning approaches as well as model the evolution of user behavior over time. These models may additionally also rely on item meta-data to factor in semantic relationships between items [132] or time-varying popularity of items [48]. The use of item meta-data, in particular in the form of category information, is central to a number of other works [12, 17, 19, 34, 151]. In many of these works, the time-varying interest in different item categories is used as a proxy for user intent, and the goal is thus to model item category trajectories in the interaction data. Technically, graph-based approaches and attention are commonly used. Moreover, different types of side information are taken into account, including social information [17], purchase cycles [34] or information extracted from tags or user reviews [69]. Some works also consider multiple possible category-related intents in parallel [151] and are able to process multiple types of user actions (e.g., clicks, purchases etc.)[19, 151]. Finally, a few proposals exist that consider domain-specific aspects. Zhu et al. [164], for example, focus on Point-of-Interest recommendation problems and their model incorporates a 'locational intent' signals from spatio-temporal information and location categories. Ding et al. [27], on the other hand, concentrate on the fashion domain. They consider shoppingspecific intents (e.g., 'match' or 'substitute') and furthermore incorporate automatically extracted features of fashion items, which are used to model item sequences on a level not tied to individual items. Lastly, two intent-aware approaches for predicting the next app usage on mobile phones are presented in [65] and [16]. In [65], a system based on (sequential) rules is proposed that predicts the next user action, i.e., app invocation, based on the user's predicted intent and context. A related approach is presented in [16], which relies both on spatio-temporal and sequential information to predict the next user intent.",
  "3.3 Latent Intent Modeling": "A common assumption of papers in this category is that multiple underlying latent intents can be behind an observed user-item interaction. Correspondingly, these papers propose neural models that consider these intents through additional latent variables or additional layers in the network. In most cases, assuming that a limited number (e.g., 4 to 12) of such latent intents exists, leads to the best results. Differently from the works that will be discussed later in Section 3.4, which are based on knowledge about application-specific intents, the semantics of the intents are not known in latent intent modeling approaches. We grouped the identified works into different categories, as described below. Disentanglement Approaches using Factorized Representations. Several of the identified works aim at modeling the underlying user intents through disentangled representations [5]. In such factorized representations, ' a change in a single unit of the representation corresponds to a change in single factor of variation of the data while being invariant to others ' [28]. Technically, the goal in these approaches commonly is to learn a chunked user or item representation [160], where each part of the representation corresponds to an intent. 7 Ma et al. [88] were among the first to propose to learn disentangled representations for recommender systems. Their approach named MacridVAE combines macro-level and micro-level disentanglement. At the macro level, the user's interest in a limited set of k high-level concepts associated with user intents is modelled, and each component of the user representation captures the user preference regarding the k th concept. A micro-level regularizer then ensures that each element of the user representation independently reflects a more low-level item factor, e.g., a certain item attribute. In the same year, Ma et al. also propose a general disentanglement method 7 Technically, we note that factorized representation approaches are related both to capsule networks and multi-head attention networks, as discussed in [142]. Furthermore, disentanglement approaches have been proposed for recommender systems for other purposes than intent-awareness, e.g., in [159]. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:11 called DisenGCN for graph representations [87]. Wang et al. [142] then apply this principle of disentanglement for graph representations for collaborative filtering problems, leading to the DGCF method. Specifically, their proposed method includes the construction and iterative refinement of multiple intent-aware graphs to propagate information to the intent-aware chunks in a finegranular way. Also, a dedicated component of the proposed frameworks guides the learning in a way that the factor-aware representations are independent. A similar method was proposed by Wang et al. [140], who propose to use a transformer network and model the correlation between intents. Some additional works explore disentangled representations for specific problem settings such as bundle recommendation [160] or for the particular use case of news recommendation [38]. The consideration of further types of side information in intent-aware disentanglement approaches was proposed in different recent works. Wu et al. [148], for example, leverage tag information in a self-supervised learning approach. Wang et al. [143], on the other hand, devise a causal method for Heterogeneous Information Networks (HIN) that may contain information about item attributes or the social relationships of the users. Finally, a disentanglement approach in which item representations are sliced in different intent-related chunks was proposed by Li et al. [76] for the class of session-based recommendation problems [45]. Besides the discussed approaches that rely on factorized representations, a number of alternative latent-intent modeling approaches were put forward in the literature, both for traditional topN recommendation and for sequential recommendation problems. We discuss these in the next paragraphs. Alternative Latent-Intent Modeling Approaches for Top-N Recommendation. Rather than slicing the user item representations into different chunks, typical works in this category propose architectures that learn multiple embeddings, one for each latent intent, or introduce additional layers to learn intent-enhanced embeddings. 8 The DisenHAN model by Wang et al. [144] features a particular disentangled graph attention network that leverages different aspects in a Heterogenous Information Network (HIN). The output of their layered architecture are a number of intent-enhanced embedding vectors, which represent different aspects of a user and items. A related approach to intent-aware recommendation based on knowledge graphs was proposed by [141]. The work is conceptually similar to the DGCF approach discussed above [142], but was designed to also consider fine-grained item information in the intent-modeling process. Knowledge graphs and intent-awareness were also in the focus of Zhang et al. [155, 156]. In their models, the user and item representations are disentangled to different spaces, resulting in a number of intent embeddings, which are then used to obtain enhanced embeddings that are finally used for recommendation. Similar ideas were later adopted also by Li et al. [72], who create intent graphs for each user before training based on connected entities in the knowledge graph. A KG-based method inspired by topic modeling was proposed by Li et al. [71], which aims to overcome potential problems when extracting intent information from graph relations, as done, e.g., in [141]. Finally, Lin et al. [79] propose an intent-aware approach that re-ranks and refines a recommendation list by learning latent user intent representations from text reviews. Their work is unique in that it uses user-generated content in the form of reviews as auxiliary information. A number of other works address specific problem settings. Li et al. [68], for example, focus on the package recommendation problem and propose an approach to create multiple disentangled user embeddings. Wang et al. [135] address the complementary item recommendation problem and propose an architecture that creates an intent embedding based on the user embedding and category 8 Some of these works also use the term 'disentanglement', but the technical approaches are different from factorized representations discussed previously. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:12 Dietmar Jannach and Markus Zanker information. This intent embedding is then combined with a module that creates aspect-level complementarity embeddings to create the final recommendations. Wei et al. [146] concentrate on multimedia recommendation , and they propose a hierarchical approach that infers coarse-grained and fine-grained intent levels from observations of co-interacted items. Finally, Qian et al. [96] focus on the problem of popularity bias in recommendations. Specifically, they aim to disentangle the underlying intent of the user into conformity (to like popular items) and genuine interests, and their approach is based on creating the correspondingly disentangled representations for users and items. Alternative Latent-Intent Modeling Approaches for Sequential Recommendation. A variety of proposals have been put forward for latent-intent modeling for sequential recommendation problems in the past few years. Like the previously discussed approaches, these proposals are commonly based on projecting objects into a limited number of intent spaces, on modeling sequential patterns of intents or categories, or on disentanglement techniques. In one of the earlier works in this area, Tanjim et al. [124] propose an intent model that uses self-attention and temporal convolutional networks to identify item similarities from interaction sequences. Given the sparsity of the interaction data, they furthermore propose to consider user actions on the category level, resembling ideas of modeling category transitions discussed earlier. The approach by Di [26] is similarly motivated by sparsity considerations, and the goal of the proposed architecture is to transform the given interaction sequence from the item space to the intent space. Technically, the work by Di involves a particular contrastive learning (CL) learning scheme. CL is also the core of related approaches by Li et al. [73] and Chen et al. [21]. In [73], sparsity is addressed through data augmentation, and a sequence encoder is designed which projects the historical items of a user into a small set of latent spaces, integrates local and global intention representations, and selects the current main intention. The approach by Chen et al. [21] learns the intent distributions from user behaviour sequences via k-means clustering and proposes a new contrastive self-supervised learning objective. The assumption of the existence of only a very limited set of interest categories (concepts) is challenged by Tan et al. [123], who propose a sparse-interest network architecture designed to adaptively activate a subset of concepts from a larger pool of existing concepts for a user. Various alternative technical approaches to intent-aware sequential recommendation are proposed in [7, 14, 15, 18, 89, 119, 133]. Cen et al. [14] focus on the candidate generation phase of recommender system. They explore two methods for multi-interest extraction, one based on selfattention, as done in several other works, and one in which the multiple interests of a given user are viewed as capsules [106]. In this latter approach, the dynamic routing method from CapsNet is used to generate multiple output capsules that correspond to interest embeddings. Wang et al. [133] later challenge the effectiveness of the greedy inference method used, for example, in [14] and propose a target-interest distillation approach to dynamically aggregate multi-interest embeddings for a given context. Li et al. [18] instead present another work based on the attention mechanism, and they specifically use multi-head attention, where each head corresponds to one of a limited set of attentions to users. Ma et al. [89], like [14], focus on candidate generation, and they challenge the effectiveness of multi-head attention in models such as SASRec [53] for intent modeling. Instead, they propose a specific intention disentanglement layer appended after single-head SASRec encoder, which involves an intention clustering and weighting step for a given small set of latent categories. In yet another technical approach, Chang et al. [15] put forward a probabilistic approach in which user intent is modeled as latent variables, which connect past observed user behavior and future behavior. Oh et al. [92], on the other hand, propose to model what they call 'implicit session contexts' in session-aware recommendation settings. An implicit session context is seen to be ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:13 equivalent to a latent intent, and the model uses a next-context predictor to guide the next-item prediction model. The works by Bhattacharya et al. [7] and Sulikowski et al. [119] stand out in that they use very specific ways of considering the users' past and ongoing interaction behavior for intentmodeling and prediction. Bhattacharya et al. focus on a particular use case, where textual reports are recommended to users. Their intent modeling approach considers both navigational aspects, e.g., which reports users have interacted with and for how long, as well as content-related aspects. A particularity of their use case is that the authors equate the item to be recommended, i.e., a specific report, with the predicted intent or user goal. This aspect is similar to the work by Sulikowski et al., who aim to predict the intent of users to purchase individual items, which is similar to the classical recommendation problem. However, the purchase probabilities in their work are based on an intent-modeling approach that considers fine-grained user interaction signals such as clicks, dwelling times, mouse moves, and scrolling activities. A further unique aspect of their approach also lies in the use of a fuzzy rule-learning technique. While most identified works aim to increase recommendation accuracy through intent-awareness, a few works also explicitly address questions of recommendation diversity. The approach by Chen at al. [14] discussed above, for example, incorporates a factor to control accuracy and diversity when integrating items from different intents. Achieving high diversity in terms of categories while preserving accuracy is a central goal in the intent-aware approach by Chen et al. [20]. Technically, diversity aspects are considered as part of a multi-element loss function. The balance of diversity and accuracy is controlled by a hyperparameter, as done in many other works. A different technical approach to achieve category-wise diversity is followed by Wang et al. [137]. They propose a multi-channel approach, where each channel is implemented through a recurrent neural network and corresponds to a specific user purpose (intent). These different channels are then used to create diversified recommendations assumed to match the user's multiple intentions in a given session. Finally, a few works in the literature target the specific problem of next-basket recommendation. In [138, 139], Wang et al. base their work on psychological theories and split the basket prediction problem into the phases of intent recognition, modeling, and accomplishment. The technical approach includes both computing the probability that a given intention is driving a certain observed user choice and to learn intention transition patterns in the data. The learned intents are finally also considered for the construction of the basket. A quite different technical approach for basket recommendation is proposed by Lio et al. in [83]. Specifically, a graph-based and translationbased approach [9] is applied to generate multiple representations for a basket according the a pre-defined number of latent intents. One goal is then to learn the importance of each intent for a given basket. A specific property of the approach is that it is able model also the correlation between intents.",
  "3.4 Explicit Intent Modeling": "In this category, we discuss research works that address intent-awareness for particular use cases. These works thus makes assumptions regarding the existence of specific intents in a certain domain. In the media domain, Kapoor et al. [54] found that users of music services may have time-varying novelty preferences. They engineered a set of features to predict a user's varying appetite for new items over time, and incorporated these predictions into a recommendation algorithm. Overall, with their approach, the authors focus on exactly one particular intent, i.e., to discover new artists or tracks. Volokhin and Agichtein [130, 131], in contrast, aimed at understanding more generally during which activities and with which intents users consume music. Through a survey-based research they identified seven main intents (concentration, distraction, filtering background noise, ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:14 Dietmar Jannach and Markus Zanker inspiration, mood and emotion control, motivation, relaxation). 9 Initial experiments furthermore indicate that these intents may be connected with audio characteristics of the recommendable tracks, ultimately leading to better recommendations. A number of music-specific intents was considered also in the study by Mehrotra et al. [90]. Differently from the work in [131], however, the authors asked survey participants about their intent when accessing the homepage of the music service (as opposed to the intent of listening to music in general). The identified intents are therefore partially of a different nature, and include intents such as 'to quickly access my playlist [. . . ]', 'to discover new music to listen to', or 'to find music to play in the background'. These intents are then used to develop a multi-level model that predicts user satisfaction based both on interaction signals and user intents. Mehrotra et al.'s study was later replicated by Benedict et al. [11] for the video streaming domain. In this replication study, eight intents were identified, which the authors grouped into two categories, 'explorative' (e.g., finding something new) and 'decisive' (e.g. looking for a specific title). The analyses by the authors show that intent affects user behavior and satisfaction also in this domain. In the area business-to-consumer of e-commerce , He et al. [36] describe a psychology-informed approach to build an intent-aware recommender system that has the specific purpose [40] to convert visitors to buyers. A visitor's intent is considered equivalent to their propensity to buy. A Hidden Markov Model for the consumer decision process was designed with these five explicit states: 'aware', 'interested', 'compulsive', 'purchase', 'abandon'. The predicted state of the user is then used to inform the subsequent selection of the content to be presented. A related approach was later put forward by Shi et al. [114], who identified four possible user intentions in e-commerce shopping from the literature: research shopping , comparative browsing , idea searching , and a hedonic intention. Like in [36], the authors use clickstream data to first predict the current user intent and then select one out of several predefined recommendation algorithms in a switching hybrid approach. Differently from works that model general e-commerce shopping intents, Ding et al. [27] focus on fashion e-commerce and identify three common intents: match , substitute , and others . Technically, a translation-based [9] approach is used to model the interaction between a user, their previously interacted item, and the current intent, with the goal to infer the probability of each intent given these observations. Only two possible intents are considered by Loyola et al. [86] for a session-based e-commerce recommendation setting: browsing or purchasing. Technically, an encoder-decoder recurrent neural network architecture is proposed, which is augmented with a second decoder that predicts the value of a binary variable that represents the current shopping intent. The existence of two main intents is also the assumption in the work by Sobecki et al. [94]. In their context-aware approach to recommend shopping places, they differentiate between consumers who are either open for discovery (with no particular shopping goal) or where they are interested in efficiency (and already have a particular shopping goal). The recommendations in the proposed technical approach are based on rule mining techniques, where the importance of the derived rules is determined by the user's explicitly specified intent and the geographical and social context of the user. Explicitly stated intents are also the focus of the study by Yang et al. [152]. In their work in the context of podcast recommendations, user intents correspond to explicitly stated interest categories, i.e., podcast topics. The goal of their user study was then to find out to what extent a recommendation strategy that is informed by user intents or aspiration can be favorable over an intent-agnostic one. Finally, a very specific use-case of an intent-aware recommender system is described by Fan et al. [29] and by Yang et al. [153]. Both works propose related methods for intent recommendation for 9 We note that this number of intents matches the typical range of intents in latent-intent modeling discussed above quite well. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:15 Fig. 2. Application Domains of IARS 60 50 40 30 20 10 POI Videos Audio Books Media Others Social ' Music; Movies, e-commerce sites. With the term intent recommendation the authors refer to the personalized recommendation of search queries, i.e., the goal is to predict which search query a user should provide to find relevant items, given their currently assumed intent. The search field of the e-commerce site is then automatically pre-filled with such a query. The approach proposed in [29] relies on a Heterogenous Information Network and on a novel metapath-guided embedding approach. Later on, in [153], a feedback interactive neural network is proposed that is (i) able to consider both positive and negative feedback, (ii) filters out noise and (iii) relies on multitask learning to match user search intents with query candidates. A particularity of the discussed approaches is that the predicted query is directly representing the assumed intent.",
  "4 RESEARCH METHODOLOGIES": "In this section, we now turn our attention to methodological questions, i.e., how IARS are evaluated in the literature. We analyzed the papers that were identified by our literature search along different dimensions. This allows us to understand the current landscape of evaluation approaches and to identify potential research gaps.",
  "4.1 Domains, Datasets, and Model Inputs": "Application Domains. Wefirst categorized the research works in terms of the application domains. As done by previous research [47, 61], we designed a number of broader categories and classified each paper manually, either based on the datasets that were used for offline evaluation or based on the given application setting in case of human-centric evaluations or field tests. Figure 2 shows the application focus of current research in IARS. We note that one paper can be assigned to more than one application domain. The analysis shows that e-commerce scenarios are the main focus and driver of research in this area. This distinguishes the field of IARS from other surveys, where movie recommendations were traditionally the most common application domain [47, 61]. We attribute the focus on e-commerce domain mainly to the increased interest in session-based and sequential recommendation problems, which are prevalent in e-commerce environments. Furthermore, the availability of relevant datasets and widely-accepted baseline models may have contributed to the observed focus on e-commerce as an application area. In the residual Others category, we find individual works that for example focus on specific problems such as next-app prediction or ad recommendation. Figure 3 shows the distribution of recommendation scenarios addressed in the surveyed works. The results indeed confirm that sequential recommendation settings (including session-based and session-aware models) are a main driver of research in intent-aware recommender systems. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:16 Dietmar Jannach and Markus Zanker Fig. 3. Recommendation Scenarios 60 50 40 30 20 10 Recommendation Next - Recommendation ackages Recommendation Sequential Bundles Top-N Intent ' Slate Sequence-agnostic top-N recommendation scenarios are typically in the focus of profile diversity matching approaches and of different (graph-based) intent disentanglement approaches. A few works address package or bundle recommendation problems. 10 Finally, a small number of works focuses on application- specific settings such as slate recommendation [90] or intent (query) recommendation [153]. Interestingly, while many of the surveyed works address problems that are highly relevant in practice-in particular sequential recommendation in e-commerce-research in the area of IARS is still largely driven by academia. Only a handful of papers are authored or co-authored by research groups from industry. Correspondingly, we also did find only a number of papers where IARS models were evaluated in an A/B test in a production environment, as we will discuss later. Datasets. In Figure 4 we report which datasets are commonly used in the literature. It shows datasets that were used in at least three papers. Most commonly, one of the popular MovieLens datasets 11 or one or several review datasets from Amazon 12 are used for (offline) evaluations. As expected, a number of e-commerce datasets that are commonly used to evaluate session-based and sequential recommendations are frequently used by researchers, e.g., from TMall, Taobao or YOOCHOOSE. 13 The use of proprietary datasets is not uncommon, and frequently, these proprietary datasets contain e-commerce data. Finally, the category Others comprises 30 different datasets that only appeared in one or two papers. Model Inputs. Except for those few cases mentioned above, where users are expected to explicitly specify their current intent, a given user's intent is assumed to be unknown and must be estimated from the observed user behavior, from contextual factors or from different forms of side information. Considering the surveyed literature comprising 85 papers, the following observations can be made. In more than 30 papers, i.e., in above one third of the cases, no information beyond the observed interaction signals (e.g., item views, purchases, reviews) and their temporal ordering or timestamps is taken into account. These cases, for instance, include works on session-based and sequential recommendation, where potential user intents are modeled through item co-occurrences in sessions or where the goal is to guess the main intent of a given session, for example through an attention mechanism [70, 80, 92]. Also several approaches that aim at modeling multiple current interests of users, which create multiple intent-based embeddings, or which propose specific network layers 10 We note that these are typically also sequential approaches. 11 https://grouplens.org/datasets/movielens/ 12 https://cseweb.ucsd.edu/~jmcauley/datasets.html#amazon_reviews 13 More information about these datasets can for example be found at https://recbole.io/dataset_list.html. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:17 Fig. 4. Datasets 35 30 25 20 15 10 1 LastFM Tmall Tafeng Amazon Gowalla Taobao YooChoose Yelp Diginetica Proprietary Others for intent modeling, do not leverage any side information, e.g. [133, 163]. In terms of the used interaction signals, most works only consider one type of interaction, e.g., item views, even though datasets like YOOCHOOSE or Diginetica exist, which comprise multiple types of user interactions. Interestingly, among all surveyed papers, only a handful consider more than one type of interaction in parallel, e.g., [81, 86, 90, 114, 151, 153]. Leveraging additional information about users and items beyond interaction signals is however not uncommon in IARS research. About half of the papers incorporate some form of item meta-data . Most commonly, the category of the items is a central feature, and in several works the observed interest in items of a certain category is used as a proxy for the user's unknown intent. Other types of item meta-data, e.g., the genre of a movie, are commonly used in knowledge graph-based approaches to intent-aware recommendation. Other types of information are only considered in a small set of works, like user demographics [67, 81], item content/concepts [38, 69, 146], user tags and reviews [34, 57, 130, 148], social information [16, 17, 68, 74, 94], context (location and time) [65, 75, 94, 165], or item popularity [48].",
  "4.2 Experimental Approaches": "Commonly, we differentiate between three main ways of evaluation approaches in the literature [111]. Offline experiments on historical data, (lab) studies with users, and field tests (A/B) in deployed systems. In addition to these main categories, other types of (non-experimental) research methods can be found from time to time in the general literature on recommender systems, like observational studies or surveys. Figure 5 shows the distribution of the main experimental evaluation approaches in the surveyed works. The distribution is well aligned with observations from other surveys [25, 61], where, despite the limitations of this methodology [41], the large majority of published research is based on offline experimentation. The outcomes of field studies with real systems are reported in [15, 43, 67, 114, 154]. The ERIC system presented in [114] was evaluated on a Chinese e-commerce site in a two stage approach. In the first phase, online customers were surveyed about their intents, and their behavior was recorded. The collected data was then used to train a model to predict a user's intent from their behavior and to subsequently switch to the most appropriate recommendation strategy. The three months field test showed a significant and consistent improvement in terms of click-through-rate (CTR), purchases, and the average time spent on the recommendations. The comparison in that study was made with a baseline that uses also a hybrid approach but without the intention-based ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:18 Dietmar Jannach and Markus Zanker Fig. 5. Evaluation approaches 90 80 70 60 50 40 30 20 10 Offline evaluation Field test User study survey switching strategy. The work by Li et al. [67] also focuses in the e-commerce domain. Besides offline experiments, the authors tested their capsule network based approach for one week on the TMall homepage. The obtained results showed that their proposed MIND method led to higher CTR values than two alternative approaches that do not consider user intents. Furthermore, the MIND method was deployed with a different number of latent intents, and the A/B test showed that choosing seven latent intents led to the best performance in terms of the CTR on this website. In [154], Zhang et al. report an +1.5% increase in a ' top business metric ' when deploying their Atten-Mixer model on top of a tuned SR-GNN [150] model. These increases were observed after running the proposed model for a week on a heavy-traffic website with millions of page views per day. A Google research team reports the outcome of a three-week online test on a large scale website serving billions of users in [15]. Two KPIs are considered in their study, enjoyment of the platform 14 and topic-wise diversity of user-item interactions . Comparing the proposed intent-aware sequential model with the previous intent-agnostic one led to a 0.7% increase in enjoyment and a 0.1% increase in diversity. Finally, in [43], Jannach et al. report the results of a field test in the e-commerce domain, where they examined the value of recommendations that serve the intent of reminding users of items they had previously interacted with. A three-months A/B study on a e-commerce site for electronic gadgets revealed that reminding users of items they had previously viewed can be a highly effective strategy. The value-generating KPI in this study was the number of clicks on referral links to other online shops, which was substantially higher than when recommending the most popular items or when using BPR [101] as an intent-agnostic recommendation model. One single user study in form of an randomized controlled trial experiment was found in the surveyed papers. 15 In [152], Yang et al. modified an existing podcast app to include an onboarding phase where study participants could state their listening intents (interests). Furthermore, a collaborative filtering model was incorporated to populate the home feed, which was otherwise only filled with content from subscribed podcasts. In total, 99 participants concluded the study. During an onboarding phase, participants were tasked to provide their listening aspirations. The main study then lasted for four weeks, during which the participants' behavior was recorded. The experiment concluded with a post-study survey on their satisfaction. Among other findings, the obtained results indicated that intention-aware recommendations can help to significantly increase the participants' engagement in terms of listening behavior and subscriptions. Moreover, 14 Details about how enjoyment was measured are not reported in the paper. 15 The authors use the term 'field study' for their experiment. The experiment was however not done in the form of a traditional A/B test in a production system. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:19 collaborative recommendations were found to be effective to increase the participants' interest in non-subscribed content and their overall satisfaction. Finally, in addition to the work by Shi et al. [114] discussed above, survey data was collected in [90] and [11]. The work by Mehrotra et al. [90] reports on findings of a study at Spotify. A sample of three million Spotify users were presented with a survey in the app, where they were asked (a) about their satisfaction with their experience on the home screen, and (b) about the reasons of using the app on this day. For the latter question, six predefined options were presented which were identified through interviews with 12 Spotify users. Over 100.000 users responded to the survey, providing insightful information about the distribution of user intents in a real-world environment. Furthermore, the survey helped to identify user intents that were not considered in the preceding interview-based research. The entire research by Mehrotra et al. was reproduced later in the video domain by Benedict et al. [11]. For their study, they also first interviewed user experience experts about possible user intents in this domain, and then conducted an in-app survey to obtain the distribution of intents and to learn about additional intents they had not thought of before.",
  "4.3 Evaluation Measures": "Next, we analyzed which objectives researchers seek to optimize when proposing intent-aware recommendation approaches. Figure 6 depicts the frequencies of metrics within the investigated set of papers. All frequencies of metrics occurring in less than three papers are aggregated in the category Others . Fig. 6. Metrics used in studied papers 80 70 60 50 40 30 20 10 Accuracy Diversity Coverage Satisfaction Others Not too surprisingly, the majority of works focuses on improving the accuracy of the predictions (in offline experiments). This is expected, given that the main motivation of most IARS in the literature is to provide recommendations that better match the users' short-term intents. The second most frequent optimization goal is diversity, which is usually contrasted with a competing accuracy objective. Diversity is the 'natural' optimization target for works that we classified as profile diversity matching approaches in Section 3. Besides Catalog coverage and Satisfaction , the following additional, mostly business-oriented metrics were occasionally used in the literature: unique visitors [29, 153], click-through-rates [29, 153], page views, clicks, add-to-cart events, and browsing time [29, 114, 153], enjoyment, user activity, and exploration behavior [152], novelty [96], and entropy [125].",
  "4.4 Reproducibility": "Finally, we turn our attention to questions of reproducibility. Limited levels of reproducibility have shown to hamper progress not only in the field of recommender systems [30, 122], but in the general field of AI [32]. An in-depth study of the level of reproducibility of individual works ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:20 Dietmar Jannach and Markus Zanker is beyond the scope of this research. However, an analysis of the papers covered in this survey show that from the 75 papers that report offline experiments, only 21 (28%) provide a link to a code repository, as visualized in Figure 7. This is a worrying observation, in particular given that previous reproducibility studies have indicated that sometimes complex neural architectures-and several modern IARS approaches have this characteristic-are not more effective than conceptual more simple models, see, e.g., [113]. Fig. 7. Percentage of papers with a repository link No repository Repository link Considering other potentially problematic research practices, we found that in many surveyed papers that provide results of offline experiments, nothing is mentioned about the tuning process of the 'state-of-the-art' baselines. Furthermore, in several works, the same embedding sizes are used across compared models, even though embedding sizes are a hyperparameter that has to be tuned for each model and dataset [112]. 16 Overall, these observations may lead to worries about the true progress that is achieved in the field of IARS in the last years. The research community therefore seems to be in need of in-depth reproducibility studies in this area.",
  "5 DISCUSSION AND FUTURE DIRECTIONS": "Our survey shows that researchers have become increasingly aware of the potential of intentawareness as a powerful means to build the next generation of recommender systems. A variety of technical approaches have been proposed and successfully evaluated for different domains, both in offline experiments as well as in first field tests. In the following, we discuss open research gaps and possible directions for future works.",
  "5.1 Discussion and Gaps in Current Research": "Research Methodology. An apparent research gap, as discussed above, lies in the fact that today's research on intent-aware recommender systems is done almost entirely through offline experiments, often with limited reproducibility. Moreover, in these offline experiments we observed a strong focus on a single quality dimension, i.e., recommendation accuracy. It is therefore highly important that the research community more often conducts experiments with humans in the loop to truly understand the value of intent-awareness for users in different dimensions. On a positive note, our survey surfaced at least a few works which were validated in field tests with deployed systems. Unfortunately, several of the described A/B tests lasted only for a relatively short period of time, such as two or three weeks. Also, in several cases, central details such as the target KPI are not reported. We note that running an A/B test for three weeks may be considered sufficient in some 16 We deliberately refrain from highlighting individual papers here. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:21 settings, in particular when a large enough user base is involved in the experiment. However, papers often do not mention if there has been a ramp-up phase when a new model is deployed and do not report how the KPIs develop over time. If such factors are not considered, the long-term effects of a new model may easily be overestimated. For example, we may observe more interest (clicks) immediately after a new model is deployed, when users explore the new types of recommendations. However, the more interesting and often unanswered question is if the new model truly has a lasting effect on user behavior. Generally, the limited number of field tests in the literature call for more intensive collaborations between academia and industry, both to evaluate new IARS models in a production environment and to create new real-world datasets for academic research. Domains and Existing Datasets. In terms of application domains, the research scope on IARS is not different from the general literature on recommender systems, with a focus on the media and e-commerce domains. We also found that much of the literature is also based on well-known and widely used datasets. As these datasets do not contain explicit information about user intents, the user's intent has to be derived from the available information about users, items and user-item interactions. A certain gap therefore exists in terms of richer datasets, which either contain explicit information about intent 17 or additional interaction signals that can be used for intent prediction. Interestingly, current research often does not leverage all the pieces of information that can be found in existing datasets, as mentioned above. Only a few works consider multiple types of behaviors in their models, e.g., clicks, purchases, or add-to-cart actions in e-commerce settings. Furthermore, some datasets like Diginetica 18 contain rich information like user search queries. Intuitively, in particular search queries represent an important predictor for user intent, but current research does not yet exploit such information to a large extent. Another possible source of information for intent modeling and prediction is to rely on fine-grained logs of user interactions, such as clicks, mouse movements, or scrolling behavior. Such interaction logs were for example used in [7] and [119]. Finally, Sun et al. [79] demonstrated a novel way to leverage external auxiliary information for intent modeling, in their case in the form of textual reviews. Generally, both for already existing and future datasets, it is crucial to validate that these datasets are suited for the given task. In the area of sequential recommendation models, it was recently pointed out that much of the research done in the past few years is based on datasets that may actually not be truly sequential in nature [37, 60, 147]. Similar considerations apply for datasets used in IARS research, which often requires sequential data. Explicit and Implicit Intents. Our survey showed that most current research works focuses on approaches that model intent in an implicit way or use latent intent models. A clear advantage of such approaches is that these models do not require application-specific knowledge, and that they can thus be easily applied in different application contexts. However, these models also come with certain disadvantages and limitations. First, the underlying intents remain latent, and the models therefore remain black boxes that are difficult to interpret. Our survey showed that the optimal number of latent intents in many approaches usually correspond with the number of manually identified intents in certain domains [11, 90], e.g., between 4 and 16. This can be seen as a good sign. Nonetheless, we cannot be sure that the added model parameters truly represent user intent, and not just additional item co-occurrences or user interest trajectories in categories. Ultimately, the increased performance of complex IARS models might only stem from the fact that these models have more trainable parameters than then previous models they are compared with. We therefore sense a certain research gap in terms of works that explore models that rely on domain knowledge 17 Explicit intent information could be acquired through in-app surveys, as in [90] 18 https://competitions.codalab.org/competitions/11161 ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:22 Dietmar Jannach and Markus Zanker and explicit intents in a given domain. In sum, the strong focus on implicit intent modeling and the strong reliance of traditional datasets, as discussed above, may hamper progress towards novel or off-mainstream applications of recommender systems. Such novel applications could be represented by recommender systems that support users in their pursuit for self-actualization [62, 120] or healthier or more environmentally friendly behavior [117, 126]. On a more general level, a long-term ambition in algorithm-oriented research in recommender systems-and in other areas of applied machine learning-is to predict which of several models would perform best, given only the characteristics of the available data. Some work in that direction can for example be found in [3], but the problem in general seems largely unresolved. Translated to the domain of IARS, it would be similarly valuable to be able to know which approach-using implicit or explicit intents-should be adopted for a given use case by only considering the types of data and recorded interactions that are available. In the surveyed literature, we found no work that even tried to empirically compare the performance of explicit and implicit intent modeling approaches.",
  "5.2 Future Directions": "Leveraging Additional Information Sources. The work by Rafique et al. [99] focuses on smart cities application scenarios for IARS. The main assumption of their work is that in the future increasingly more traces of user behavior will be available, stemming from sensors, mobiles, Internet-of-Things devices etc., and that these pieces of information can be used for building nextgeneration recommender systems. In the current literature, sensor information is so far only used in a few selected works, e.g., in [16, 65]. In addition to external sensor information, fine-grained user interaction data recorded by applications may also become frequently used in the future. Shi et al. [114] and Sulikowski et al. [119], for example, used the user's mouse scroll speed as a predictor variable in their IARS. Besides more knowledge about user behavior, also more information about the users' situation and context, which may influence their intents, will become available through additional sensors or external knowledge sources. Finally, another direction lies in leveraging user-generated content such as text reviews provided by the user community, as proposed in [79]. Generally, research in IARS today is to some extent hampered by the limited availability of datasets that contain information or indications of possible user intents. Similar problems exist for other types of recommender systems, such as context-aware systems, price- and profit aware systems, or ones that consider multiple stakeholders [1, 2, 24]. However, this should not shy us away from directing our research efforts towards these highly relevant types of recommender systems. Instead, we believe that a paradigmatic shift is needed in how we do research on recommender systems. Instead of developing increasingly more complex models on a small set of frequently-used datasets that mainly consist of user-item interactions, an increased level of academia-industry collaborations is required. As mentioned above, this would allow us both to evaluate new models 'in the wild' and to develop richer datasets for more realistic offline evaluations. Better Understanding User Intents. As indicated above, we see a strong potential in future works that aim at understanding the idiosyncrasies of individual application use cases, and explicitly considering potential user intents in a given setting. Ideally, such investigations should be supported either by an underlying theory, e.g., from psychology as in [36, 135, 139], or by empirical studies or domain-specific analyses, as done, e.g., for the music and video domains in [11, 90, 109, 110, 131]. A better understanding of these application-specific intents then serves as a basis for improved models for predicting the user's intent from their observed interactions, see, e.g., [22] using observational and survey data at Pinterest for improved intent prediction. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:23 Interactive IARS. We also envision important future directions in the context of the user experience of IARS. In practice, modern media streaming and e-commerce sites use multiple rows of recommendations to account for the various possible intents that users might have when arriving on the site. While multi-row user interfaces are common in practice, only a few works exist on this topic in academic research, e.g., [42, 95, 116]. More research is thus required in this area, for instance which intents should be supported in a given application setting, or how rows'content should be personalized and ordered; see [31] for a discussion of the topic at Netflix. Furthermore, with the advent of LLM-based chatbots like ChatGPT, end users will become more and more be accustomed to natural language based advice-giving systems, and will increasingly use them as interactive and conversational recommender systems. In such usage scenarios, it may be quite common that end users will explicitly express their intents and situational context, e.g., ' I am planning to go for dinner with my friends after attending the Mets game on Sunday. Any recommendations? ' A key challenge in future research will thus not only be to understand the expressed intent, to map it to suitable item recommendations, but even to provide a user interface that visualizes the assumed intent, see [105] for a related approach towards intent-modeling in interactive search. Leveraging Large Language Models. The emergence of LLMs is disrupting research in recommender systems, and a rich variety of proposals to leverage LLMs for recommendation were put forward since the release of the first models that were based on the Generative Pre-Trained Transformer (GPT) architecture. Common ways of incorporating LLMs into the recommendation process include the direct usage of an AI assistant like ChatGPT, various ways of model fine-tuning, generating prompts and prompt tuning, as well as using the 'world knowledge' that is encoded in an LLM as a feature encoder, see [78, 149, 161]. The effectiveness of different approaches of incorporating LLMs to improve sequential recommendation models was demonstrated in [35]. Further, an iterative, prompt-based intent-aware technique for session-based problems was recently proposed by Sun et al. [121], leading to improved offline accuracy results. A notable aspect when using LLMs for intent-aware recommendation with the help of prompts is that an LLM can provide explanations and its chain-of-thought regarding the assumed current user intent. Given their rich knowledge, LLMs may also serve as a powerful tool to list possible user intents for a given recommender systems use case, thereby laying the foundation for future Explicit Intent Modeling approaches.",
  "6 SUMMARY": "Weargue that intent-awareness can be a key building block for the next generation of recommender systems. With this paper, our aim is to provide an overview of the existing literature on IARS, which shall serve as a starting point for researchers working in this area. We have therefore searched the literature for relevant papers and proposed a categorization into different dimensions. Our analyses points to a number of open research gaps, for instance related to the so far limited evaluation of current IARS with humans in the loop. Finally, we outlined a number of possible research directions, which include a stronger focus on domain specifics and the use of additional types of information to infer the current intent of users.",
  "REFERENCES": "[1] Himan Abdollahpouri, Gediminas Adomavicius, Robin Burke, Ido Guy, Dietmar Jannach, Toshihiro Kamishima, Jan Krasnodebski, and Luiz Pizzato. 2020. Multistakeholder Recommendation: Survey and Research Directions. User Modeling and User-Adapted Interaction 30 (2020), 127-158. [2] Gediminas Adomavicius and Alexander Tuzhilin. 2015. Context-Aware Recommender Systems. In Recommender Systems Handbook , Francesco Ricci, Lior Rokach, and Bracha Shapira (Eds.). Springer US, Boston, MA, 191-226. https://doi.org/10.1007/978-1-4899-7637-6_6 ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:24 Dietmar Jannach and Markus Zanker [3] Gediminas Adomavicius and Jingjing Zhang. 2012. Impact of data characteristics on recommender systems performance. ACM Trans. Manag. Inf. Syst. 3, 1 (2012), 3:1-3:17. https://doi.org/10.1145/2151163.2151166 [4] Rakesh Agrawal, Sreenivas Gollapudi, Alan Halverson, and Samuel Ieong. 2009. Diversifying search results. In Proceedings of the Second ACM International Conference on Web Search and Data Mining (WSDM '09) . 5-14. [5] Yoshua Bengio, Aaron Courville, and Pascal Vincent. 2013. Representation Learning: A Review and New Perspectives. IEEE Trans. Pattern Anal. Mach. Intell. 35, 8 (2013), 1798-1828. https://doi.org/10.1109/TPAMI.2013.50 [6] Cesare Bernardis, Maurizio Ferrari Dacrema, Fernando Benjamin Perez Maurera, Massimo Quadrana, Mario Scriminaci, and Paolo Cremonesi. 2022. From Data Analysis to Intent-Based Recommendation: An Industrial Case Study in the Video Domain. IEEE Access 10 (2022), 14779-14796. https://doi.org/10.1109/ACCESS.2022.3148434 [7] Biswarup Bhattacharya, Iftikhar Burhanuddin, Abhilasha Sancheti, and Kushal Satya. 2017. Intent-Aware Contextual Recommendation System. In 2017 IEEE International Conference on Data Mining Workshops (ICDMW) . 1-8. https: //doi.org/10.1109/ICDMW.2017.8 [8] Veronika Bogina, Tsvi Kuflik, Dietmar Jannach, Maria Bielikova, Michal Kompan, and Christoph Trattner. 2022. Considering Temporal Aspects in Recommender Systems: A Survey. User Modeling and User-Adapted Interaction 33, 1 (2022), 81 - 119. [9] Antoine Bordes, Nicolas Usunier, Alberto Garcia-Durán, Jason Weston, and Oksana Yakhnenko. 2013. Translating embeddings for modeling multi-relational data. In Proceedings of the 26th International Conference on Neural Information Processing Systems - Volume 2 (NIPS'13) . 2787-2795. [10] Andrei Broder. 2002. A taxonomy of web search. SIGIR Forum 36, 2 (2002), 3-10. https://doi.org/10.1145/792550.792552 [11] Gabriel Bénédict, Daan Odijk, and Maarten De Rijke. 2023. Intent-Satisfaction Modeling: From Music to Video Streaming. ACM Transactions on Recommender Systems 1, 3 (Sept. 2023), 1-23. https://doi.org/10.1145/3606375 [12] Renqin Cai, Jibang Wu, Aidan San, Chong Wang, and Hongning Wang. 2021. Category-aware Collaborative Sequential Recommendation. In Proceedings of the 44th International ACM SIGIR Conference on Research and Development in Information Retrieval . 388-397. https://doi.org/10.1145/3404835.3462832 [13] Pedro G. Campos, Fernando Díez, and Iván Cantador. 2014. Time-aware recommender systems: a comprehensive survey and analysis of existing evaluation protocols. User Modeling and User-Adapted Interaction 24, 1-2 (2014), 67-119. [14] Yukuo Cen, Jianwei Zhang, Xu Zou, Chang Zhou, Hongxia Yang, and Jie Tang. 2020. Controllable Multi-Interest Framework for Recommendation. http://arxiv.org/abs/2005.09347 [15] Bo Chang, Alexandros Karatzoglou, Yuyan Wang, Can Xu, Ed H. Chi, and Minmin Chen. 2023. Latent User Intent Modeling for Sequential Recommenders. In Companion Proceedings of the ACM Web Conference 2023 . 427-431. https://doi.org/10.1145/3543873.3584641 [16] Benu Madhab Changmai, Divija Nagaraju, Debi Prasanna Mohanty, Kriti Singh, Kunal Bansal, and Sukumar Moharana. 2019. On-Device User Intent Prediction for Context and Sequence Aware Recommendation. http://arxiv.org/abs/ 1909.12756 [17] Jinpeng Chen, Yuan Cao, Fan Zhang, Pengfei Sun, and Kaimin Wei. 2022. Sequential Intention-aware Recommender based on User Interaction Graph. In Proceedings of the 2022 International Conference on Multimedia Retrieval . 118-126. https://doi.org/10.1145/3512527.3531390 [18] Rui Chen, Dongxue Chen, Riwei Lai, Hongtao Song, and Yichen Wang. 2023. MISRec: Multi-Intention Sequential Recommendation. In Web and Big Data , Bohan Li, Lin Yue, Chuanqi Tao, Xuming Han, Diego Calvanese, and Toshiyuki Amagasa (Eds.). Vol. 13423. Springer Nature Switzerland, Cham, 191-198. https://doi.org/10.1007/978-3-031-25201-3_15 Series Title: Lecture Notes in Computer Science. [19] Tong Chen, Hongzhi Yin, Hongxu Chen, Rui Yan, Quoc Viet Hung Nguyen, and Xue Li. 2019. AIR: Attentional Intention-Aware Recommender Systems. In 2019 IEEE 35th International Conference on Data Engineering (ICDE) . 304-315. https://doi.org/10.1109/ICDE.2019.00035 [20] Wanyu Chen, Pengjie Ren, Fei Cai, Fei Sun, and Maarten de Rijke. 2020. Improving End-to-End Sequential Recommendations with Intent-aware Diversification. In Proceedings of the 29th ACM International Conference on Information & Knowledge Management . 175-184. https://doi.org/10.1145/3340531.3411897 [21] Yongjun Chen, Zhiwei Liu, Jia Li, Julian McAuley, and Caiming Xiong. 2022. Intent Contrastive Learning for Sequential Recommendation. In Proceedings of the ACM Web Conference 2022 . 2172-2182. https://doi.org/10.1145/3485447.3512090 [22] Justin Cheng, Caroline Lo, and Jure Leskovec. 2017. Predicting Intent Using Activity Logs: How Goal Specificity and Temporal Range Affect User Behavior. In Proceedings of the 26th International Conference on World Wide Web Companion (WWW '17 Companion) . 593-601. https://doi.org/10.1145/3041021.3054198 [23] Paul Covington, Jay Adams, and Emre Sargin. 2016. Deep Neural Networks for YouTube Recommendations. In Proceedings of the 10th ACM Conference on Recommender Systems (RecSys '16) . 191-198. [24] Alvise De Biasio, Nicolò Navarin, and Dietmar Jannach. 2023. Economic Recommender Systems - A Systematic Review. Electronic Commerce Research and Applications 63 (2023), 101352. ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:25 ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:26 Dietmar Jannach and Markus Zanker [46] Dietmar Jannach and Markus Zanker. 2021. Impact and Value of Recommender Systems. In Recommender Systems Handbook , Francesco Ricci, Bracha Shapira, and Lior Rokach (Eds.). Springer US. [47] Dietmar Jannach, Markus Zanker, Mouzhi Ge, and Marian Gröning. 2012. Recommender Systems in Computer Science and Information Systems - A Landscape of Research. In 13th International Conference on Electronic Commerce and Web Technologies (EC-Web 2012) . 76-87. https://doi.org/10.1007/978-3-642-32273-0_7 [48] Wei Jiang, Fangquan Lin, Jihai Zhang, Cheng Yang, Hanwei Zhang, and Ziqiang Cui. 2021. Dynamic Sequential Recommendation: Decoupling User Intent from Temporal Context. In 2021 International Conference on Data Mining Workshops (ICDMW) . 18-26. https://doi.org/10.1109/ICDMW53433.2021.00010 [49] Di Jin, Luzhi Wang, Yizhen Zheng, Guojie Song, Fei Jiang, Xiang Li, Wei Lin, and Shirui Pan. 2023. Dual Intent Enhanced Graph Neural Network for Session-based New Item Recommendation. In Proceedings of the ACM Web Conference 2023 . 684-693. https://doi.org/10.1145/3543507.3583526 [50] Michael Jugovac, Dietmar Jannach, and Lukas Lerche. 2017. Efficient Optimization of Multiple Recommendation Quality Factors According to Individual User Tendencies. Expert Systems With Applications 81 (2017), 321-331. [51] Marius Kaminskas and Derek Bridge. 2016. Diversity, Serendipity, Novelty, and Coverage: A Survey and Empirical Analysis of Beyond-Accuracy Objectives in Recommender Systems. ACM Transactions on Interactive Intelligent Systems 7, 1 (2016), 2:1-2:42. [52] Jie Kang, Kyle Condiff, Shuo Chang, Joseph A. Konstan, Loren Terveen, and F. Maxwell Harper. 2017. Understanding How People Use Natural Language to Ask for Recommendations. In Proceedings of the Eleventh ACM Conference on Recommender Systems . 229-237. https://doi.org/10.1145/3109859.3109873 [53] W. Kang and J. McAuley. 2018. Self-Attentive Sequential Recommendation. In 2018 IEEE International Conference on Data Mining (ICDM) . 197-206. https://doi.org/10.1109/ICDM.2018.00035 [54] Komal Kapoor, Vikas Kumar, Loren Terveen, Joseph A. Konstan, and Paul Schrater. 2015. \"I like to explore sometimes\": Adapting to Dynamic User Novelty Preferences. In Proceedings of the 9th ACM Conference on Recommender Systems . 19-26. https://doi.org/10.1145/2792838.2800172 [55] Mesut Kaya and Derek Bridge. 2019. A comparison of calibrated and intent-aware recommendations. In Proceedings of the 13th ACM Conference on Recommender Systems . 151-159. https://doi.org/10.1145/3298689.3347045 [56] Mesut Kaya and Derek Bridge. 2019. Subprofile-aware diversification of recommendations. User Modeling and User-Adapted Interaction 29, 3 (2019), 661-700. https://doi.org/10.1007/s11257-019-09235-6 [57] Mesut Kaya and Derek G. Bridge. 2018. Accurate and Diverse Recommendations Using Item-Based SubProfiles. In Proceedings of the Thirty-First International Florida Artificial Intelligence Research Society Conference, FLAIRS 2018 . 462-467. https://aaai.org/ocs/index.php/FLAIRS/FLAIRS18/paper/view/17600 [58] Barbara Kitchenham and Pearl Brereton. 2013. A systematic review of systematic review process research in software engineering. Inf. Softw. Technol. 55, 12 (2013), 2049-2075. https://doi.org/10.1016/j.infsof.2013.07.010 [59] Barbara Kitchenham, Pearl Brereton, David Budgen, Mark Turner, John Bailey, and Stephen Linkman. 2009. Systematic literature reviews in software engineering - A systematic literature review. Information and Software Technology 51, 1 (2009), 7-15. https://doi.org/10.1016/j.infsof.2008.09.009 [60] Anton Klenitskiy, Anna Volodkevich, Anton Pembek, and Alexey Vasilev. 2024. Does It Look Sequential? An Analysis of Datasets for Evaluation of Sequential Recommendations. arXiv:2408.12008 [cs.IR] [61] Anastasiia Klimashevskaia, Dietmar Jannach, Mehdi Elahi, and Christoph Trattner. 2023. A Survey on Popularity Bias in Recommender Systems. arXiv:2308.01118 [cs.IR] [62] Bart P. Knijnenburg, Saadhika Sivakumar, and Daricia Wilkinson. 2016. Recommender Systems for Self-Actualization. In Proceedings of the 10th ACM Conference on Recommender Systems (RecSys '16) . 11-14. https://doi.org/10.1145/ 2959100.2959189 [63] Christoph Kofler, Martha Larson, and Alan Hanjalic. 2017. User Intent in Multimedia Search: A Survey of the State of the Art and Future Challenges. Comput. Surveys 49, 2 (June 2017), 1-37. https://doi.org/10.1145/2954930 [64] Marek Koniew. 2020. Classification of the User's Intent Detection in Ecommerce systems - Survey and Recommendations. International Journal of Information Engineering and Electronic Business 12, 6 (Dec. 2020), 1-12. https://doi.org/10.5815/ijieeb.2020.06.01 [65] Wei-Po Lee and Ke-Han Lee. 2014. Making smartphone service recommendations by predicting users' intentions: A context-aware approach. Information Sciences 277 (Sept. 2014), 21-35. https://doi.org/10.1016/j.ins.2014.04.033 [66] Lukas Lerche, Dietmar Jannach, and Malte Ludewig. 2016. On the Value of Reminders Within E-Commerce Recommendations. In Proceedings of the 2016 Conference on User Modeling Adaptation and Personalization (UMAP '16) . 27-35. [67] Chao Li, Zhiyuan Liu, Mengmeng Wu, Yuchi Xu, Huan Zhao, Pipei Huang, Guoliang Kang, Qiwei Chen, Wei Li, and Dik Lun Lee. 2019. Multi-Interest Network with Dynamic Routing for Recommendation at Tmall. In Proceedings of the 28th ACM International Conference on Information and Knowledge Management . 2615-2623. https://doi.org/10. 1145/3357384.3357814 ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:27 [68] Chen Li, Yuanfu Lu, Wei Wang, Chuan Shi, Ruobing Xie, Haili Yang, Cheng Yang, Xu Zhang, and Leyu Lin. 2021. Package Recommendation with Intra- and Inter-Package Attention Networks. In Proceedings of the 44th International ACM SIGIR Conference on Research and Development in Information Retrieval . 595-604. https://doi.org/10.1145/ 3404835.3462841 [69] Haoyang Li, Xin Wang, Ziwei Zhang, Jianxin Ma, Peng Cui, and Wenwu Zhu. 2022. Intention-Aware Sequential Recommendation With Structured Intent Transition. IEEE Transactions on Knowledge and Data Engineering 34, 11 (Nov. 2022), 5403-5414. https://doi.org/10.1109/TKDE.2021.3050571 [70] Jing Li, Pengjie Ren, Zhumin Chen, Zhaochun Ren, Tao Lian, and Jun Ma. 2017. Neural Attentive Session-based Recommendation. In Proceedings of the 2017 ACM on Conference on Information and Knowledge Management . 1419-1428. https://doi.org/10.1145/3132847.3132926 [71] Qiming Li, Zhao Zhang, Fuzhen Zhuang, Yongjun Xu, and Chao Li. 2023. Topic-aware Intention Network for Explainable Recommendation with Knowledge Enhancement. ACM Transactions on Information Systems 41, 4 (Oct. 2023), 1-23. https://doi.org/10.1145/3579993 [72] Shaosong Li, Bo Yang, and Dongsheng Li. 2023. Entity-driven user intent inference for knowledge graph-based recommendation. Applied Intelligence 53, 9 (May 2023), 10734-10750. https://doi.org/10.1007/s10489-022-04048-4 [73] Xuewei Li, Aitong Sun, Mankun Zhao, Jian Yu, Kun Zhu, Di Jin, Mei Yu, and Ruiguo Yu. 2023. Multi-Intention Oriented Contrastive Learning for Sequential Recommendation. In Proceedings of the Sixteenth ACM International Conference on Web Search and Data Mining . 411-419. https://doi.org/10.1145/3539597.3570411 [74] Yinfeng Li, Chen Gao, Xiaoyi Du, Huazhou Wei, Hengliang Luo, Depeng Jin, and Yong Li. 2022. Automatically Discovering User Consumption Intents in Meituan. In Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining . 3259-3269. https://doi.org/10.1145/3534678.3539122 [75] Yinfeng Li, Chen Gao, Xiaoyi Du, Huazhou Wei, Hengliang Luo, Depeng Jin, and Yong Li. 2022. Spatiotemporal-aware Session-based Recommendation with Graph Neural Networks. In Proceedings of the 31st ACM International Conference on Information & Knowledge Management . 1209-1218. https://doi.org/10.1145/3511808.3557458 [76] Yinfeng Li, Chen Gao, Hengliang Luo, Depeng Jin, and Yong Li. 2022. Enhancing Hypergraph Neural Networks with Intent Disentanglement for Session-based Recommendation. In Proceedings of the 45th International ACM SIGIR Conference on Research and Development in Information Retrieval . 1997-2002. https://doi.org/10.1145/3477495.3531794 [77] Jianxun Lian, Iyad Batal, Zheng Liu, Akshay Soni, Eun Yong Kang, Yajun Wang, and Xing Xie. 2021. Multi-InterestAware User Modeling for Large-Scale Sequential Recommendations. http://arxiv.org/abs/2102.09211 [78] Jianghao Lin, Xinyi Dai, Yunjia Xi, Weiwen Liu, Bo Chen, Hao Zhang, Yong Liu, Chuhan Wu, Xiangyang Li, Chenxu Zhu, Huifeng Guo, Yong Yu, Ruiming Tang, and Weinan Zhang. 2024. How Can Recommender Systems Benefit from Large Language Models: A Survey. ACM Trans. Inf. Syst. (2024). https://doi.org/10.1145/3678004 [79] Zhuoyi Lin, Sheng Zang, Rundong Wang, Zhu Sun, J. Senthilnath, Chi Xu, and Chee Keong Kwoh. 2023. Attention Over Self-Attention: Intention-Aware Re-Ranking With Dynamic Transformer Encoders for Recommendation. IEEE Transactions on Knowledge & Data Engineering 35, 08 (2023), 7782-7795. https://doi.org/10.1109/TKDE.2022.3208633 [80] Qiao Liu, Yifu Zeng, Refuoe Mokhosi, and Haibin Zhang. 2018. STAMP: Short-Term Attention/Memory Priority Model for Session-based Recommendation. In Proceedings of the 24th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining . 1831-1839. https://doi.org/10.1145/3219819.3219950 [81] Yanan Liu, Yun Tian, Yang Xu, Shifeng Zhao, Yapei Huang, Yachun Fan, Fuqing Duan, and Ping Guo. 2021. TPGN: A Time-Preference Gate Network for e-commerce purchase intention recognition. Knowledge-Based Systems 220 (May 2021), 106920. https://doi.org/10.1016/j.knosys.2021.106920 [82] Zhaoyang Liu, Haokun Chen, Fei Sun, Xu Xie, Jinyang Gao, Bolin Ding, and Yanyan Shen. 2020. Intent Preference Decoupling for User Representation on Online Recommender System. In Proceedings of the Twenty-Ninth International Joint Conference on Artificial Intelligence . 2575-2582. https://doi.org/10.24963/ijcai.2020/357 [83] Zhiwei Liu, Xiaohan Li, Ziwei Fan, Stephen Guo, Kannan Achan, and Philip S. Yu. 2020. Basket Recommendation with Multi-Intent Translation Graph Neural Network. In 2020 IEEE International Conference on Big Data (Big Data) . 728-737. https://doi.org/10.1109/BigData50022.2020.9377917 [84] Zheng Liu, Jianxun Lian, Junhan Yang, Defu Lian, and Xing Xie. 2020. Octopus: Comprehensive and Elastic User Representation for the Generation of Recommendation Candidates. In Proceedings of the 43rd International ACM SIGIR Conference on Research and Development in Information Retrieval . 289-298. https://doi.org/10.1145/3397271.3401088 [85] Benedikt Loepp. 2023. Multi-list interfaces for recommender systems: survey and future directions. Frontiers in Big Data 6 (2023). https://doi.org/10.3389/fdata.2023.1239705 [86] Pablo Loyola, Chen Liu, and Yu Hirate. 2017. Modeling User Session and Intent with an Attention-based EncoderDecoder Architecture. In Proceedings of the Eleventh ACM Conference on Recommender Systems . 147-151. https: //doi.org/10.1145/3109859.3109917 [87] Jianxin Ma, Peng Cui, Kun Kuang, Xin Wang, and Wenwu Zhu. 2019. Disentangled Graph Convolutional Networks. In Proceedings of the 36th International Conference on Machine Learning (Proceedings of Machine Learning Research, ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. 1:28 Dietmar Jannach and Markus Zanker ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:29 ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. [147] Daniel Woolridge, Sean Wilner, and Madeleine Glick. 2021. Sequence or Pseudo-Sequence? An Analysis of Sequential Recommendation Datasets. In Proceedings of the Perspectives on the Evaluation of Recommender Systems Workshop ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024. A Survey on Intent-aware Recommender Systems 1:31 2021 co-located with the 15th ACM Conference on Recommender Systems (RecSys 2021) (CEUR Workshop Proceedings, Vol. 2955) . CEUR-WS.org. [148] Haolun Wu, Yingxue Zhang, Chen Ma, Wei Guo, Ruiming Tang, Xue Liu, and Mark Coates. 2022. Intent-aware Multi-source Contrastive Alignment for Tag-enhanced Recommendation. http://arxiv.org/abs/2211.06370 [149] Likang Wu, Zhi Zheng, Zhaopeng Qiu, Hao Wang, Hongchao Gu, Tingjia Shen, Chuan Qin, Chen Zhu, Hengshu Zhu, Qi Liu, Hui Xiong, and Enhong Chen. 204. A survey on large language models for recommendation. World Wide Web 27, 5 (204). https://doi.org/10.1007/s11280-024-01291-2 [150] Shu Wu, Yuyuan Tang, Yanqiao Zhu, Liang Wang, Xing Xie, and Tieniu Tan. 2019. Session-Based Recommendation with Graph Neural Networks. In Proceedings of the Thirty-Third AAAI Conference on Artificial Intelligence, AAAI . 346-353. https://doi.org/10.1609/aaai.v33i01.3301346 [151] Yanan Xu, Yanmin Zhu, and Jiadi Yu. 2021. Modeling Multiple Coexisting Category-Level Intentions for Next Item Recommendation. 39, 3 (July 2021), 1-24. https://doi.org/10.1145/3441642 ACM Transactions on Information Systems [152] Longqi Yang, Michael Sobolev, Yu Wang, Jenny Chen, Drew Dunne, Christina Tsangouri, Nicola Dell, Mor Naaman, and Deborah Estrin. 2019. How Intention Informed Recommendations Modulate Choices: A Field Study of Spoken Word Content. In The World Wide Web Conference . 2169-2180. https://doi.org/10.1145/3308558.3313540 [153] Yatao Yang, Biyu Ma, Jun Tan, Hongbo Deng, Haikuan Huang, and Zibin Zheng. 2021. FINN: Feedback Interactive Neural Network for Intent Recommendation. In Proceedings of the Web Conference 2021 . 1949-1958. https://doi.org/ 10.1145/3442381.3450105 [154] Peiyan Zhang, Jiayan Guo, Chaozhuo Li, Yueqi Xie, Jae Boum Kim, Yan Zhang, Xing Xie, Haohan Wang, and Sunghun Kim. 2023. Efficiently Leveraging Multi-level User Intent for Session-based Recommendation via Atten-Mixer Network. In Proceedings of the Sixteenth ACM International Conference on Web Search and Data Mining . 168-176. https://doi.org/10.1145/3539597.3570445 [155] Ruoyi Zhang, Huifang Ma, Qingfeng Li, Zhixin Li, and Yike Wang. 2022. A Knowledge Graph Recommendation Model via High-order Feature Interaction and Intent Decomposition. In 2022 International Joint Conference on Neural Networks (IJCNN) . 1-7. https://doi.org/10.1109/IJCNN55064.2022.9892593 [156] Ruoyi Zhang, Huifang Ma, Qingfeng Li, Yike Wang, and Zhixin Li. 2022. FIRE: knowledge-enhanced recommendation with feature interaction and intent-aware attention networks. Applied Intelligence (Dec. 2022). https://doi.org/10. 1007/s10489-022-04300-x [157] Shuai Zhang, Yi Tay, Lina Yao, and Aixin Sun. 2018. Next Item Recommendation with Self-Attention. http: //arxiv.org/abs/1808.06414 [158] Shuai Zhang, Yi Tay, Lina Yao, and Aixin Sun. 2019. Next Item Recommendation with Self-Attentive Metric Learning. In AAAI-19 Workshop on Recommender Systems and Natural Language Processing (RecNLP) . http://arxiv.org/abs/1808. 06414 [159] Yin Zhang, Ziwei Zhu, Yun He, and James Caverlee. 2020. Content-Collaborative Disentanglement Representation Learning for Enhanced Recommendation. In Proceedings of the Fourteenth ACM Conference on Recommender Systems . 43-52. https://doi.org/10.1145/3383313.3412239 [160] Sen Zhao, Wei Wei, Ding Zou, and Xianling Mao. 2022. Multi-View Intent Disentangle Graph Networks for Bundle Recommendation. Proceedings of the AAAI Conference on Artificial Intelligence 36, 4 (June 2022), 4379-4387. https: //doi.org/10.1609/aaai.v36i4.20359 [161] Z. Zhao, W. Fan, J. Li, Y. Liu, X. Mei, Y. Wang, Z. Wen, F. Wang, X. Zhao, J. Tang, and Q. Li. 2024. Recommender Systems in the Era of Large Language Models (LLMs). IEEE Transactions on Knowledge & Data Engineering (2024). https://doi.org/10.1109/TKDE.2024.3392335 [162] Nengjun Zhu, Jian Cao, Yanchi Liu, Yang Yang, Haochao Ying, and Hui Xiong. 2020. Sequential Modeling of Hierarchical User Intention and Preference for Next-item Recommendation. In Proceedings of the 13th International Conference on Web Search and Data Mining . 807-815. https://doi.org/10.1145/3336191.3371840 [163] Nengjun Zhu, Jian Cao, Xinjiang Lu, and Hui Xiong. 2022. Learning a Hierarchical Intent Model for Next-Item Recommendation. ACM Transactions on Information Systems 40, 2 (April 2022), 1-28. https://doi.org/10.1145/3473972 [164] X. Zhu, C. Bu, B. Dong, S. Ji, Y. He, and X. Wu. 2023. IKGN: Intention-aware Knowledge Graph Network for POI Recommendation. In 2023 IEEE International Conference on Data Mining (ICDM) . 908-917. https://doi.org/10.1109/ ICDM58522.2023.00100 [165] Xiaoyu Zhu, Chenyang Bu, Bingbing Dong, Shengwei Ji, Yi He, and Xindong Wu. 2023. IKGN: Intention-aware Knowledge Graph Network for POI Recommendation. In 2023 IEEE International Conference on Data Mining (ICDM) . 908-917. https://doi.org/10.1109/ICDM58522.2023.00100 ACM Trans. Recomm. Syst., Vol. 1, No. 1, Article 1. Publication date: January 2024.",
  "keywords_parsed": [
    "None"
  ]
}