{"Deep Automated Mechanism Design for Integrating Ad Auction and Allocation in Feed": "Xuejian Li ∗ Meituan Beijing, China lixuejian03@meituan.com Ze Wang ∗ Meituan Beijing, China wangze18@meituan.com Bingqi Zhu Meituan Beijing, China zhubingqi@meituan.com", "ABSTRACT": "E-commerce platforms usually present an ordered list, mixed with several organic items and an advertisement, in response to each user's page view request. This list, the outcome of ad auction and allocation processes, directly impacts the platform's ad revenue and gross merchandise volume (GMV). Specifically, the ad auction determines which ad is displayed and the corresponding payment, while the ad allocation decides the display positions of the advertisement and organic items. The prevalent methods of segregating the ad auction and allocation into two distinct stages face two problems: 1) Ad auction does not consider externalities, such as the influence of actual display position and context on ad Click-Through Rate (CTR); 2) The ad allocation, which utilizes the auction-winning ad's payment to determine the display position dynamically, fails to maintain incentive compatibility (IC) for the advertisement. For instance, in the auction stage employing the traditional Generalized Second Price (GSP) , even if the winning ad increases its bid, its payment remains unchanged. This implies that the advertisement cannot secure a better position and thus loses the opportunity to achieve higher utility in the subsequent ad allocation stage. Previous research often focused on one of the two stages, neglecting the two-stage problem, which may result in suboptimal outcomes. Therefore, this paper proposes a deep automated mechanism that integrates ad auction and allocation, ensuring both IC and Individual Rationality (IR) in the presence of externalities while maximizing revenue and GMV. The mechanism takes candidate ads and the ordered list of organic items as input. For each candidate ad, several candidate allocations are generated by inserting the ad in different positions of the ordered list of organic items. For each candidate allocation, a list-wise model takes the entire allocation as input and outputs the predicted result for each ad and organic item to model the global externalities. Finally, an automated auction mechanism, modeled by deep neural networks, is executed to select ∗ Corresponding authors. Permission to make digital or hard copies of part or all of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for third-party components of this work must be honored. For all other uses, contact the owner/author(s). SIGIR '24, July 14-18, 2024, Washington, DC, USA. © 2024 Copyright held by the owner/author(s). ACM ISBN 979-8-4007-0431-4/24/07. https://doi.org/10.1145/3626772.3657774 the optimal allocation. Consequently, this mechanism simultaneously decides the ranking, payment, and display position of the ad. Furthermore, the proposed mechanism results in higher revenue and GMV than state-of-the-art baselines in offline experiments and online A/B tests.", "CCS CONCEPTS": "· Information systems → Computational advertising ; Display advertising ; Learning to rank .", "KEYWORDS": "Automated Mechanism Design, Ad Auction, Externalities, Ad Allocation", "ACMReference Format:": "Xuejian Li, Ze Wang, Bingqi Zhu, Fei He, Yongkang Wang, and Xingxing Wang. 2024. Deep Automated Mechanism Design for Integrating Ad Auction and Allocation in Feed. In Proceedings of the 47th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '24), July 14-18, 2024, Washington, DC, USA. ACM, New York, NY, USA, 10 pages. https://doi.org/10.1145/3626772.3657774", "1 INTRODUCTION": "In many e-commerce feeds, an ordered list, mixed with several organic items and a pay-per-click ad, is displayed for each page view request of users [31, 32], as is shown in Figure 1. If users click on the ad, the platform will charge the corresponding advertiser, which is a key source of revenue for the platform [5, 21]. Meanwhile, if users purchase the product in organic items or ad, the platform's gross merchandise volume (GMV) will increase. In practice, this list, produced by ad auction and allocation processes, directly determines the platform's revenue and GMV. More specifically, the ad auction determines which ad is displayed and the payment of the ad [5, 25], while the ad allocation determines the display positions of the ad and organic items in feeds [17, 32]. Ad auction and allocation are interactive [19]. Hence, mechanism design for ad auction and allocation to maximize platform revenue and GMV has become a very meaningful and challenging problem. The widely used method is to divide ad auction and allocation into two stages. Initially, in the ad auction, such as the classic GSP [25], candidate ads are ranked by eCPM which is calculated by the product of the predicted click-through-rate (pCTR) and bid of ad, and the ad with the maximum eCPM wins and its payment is the SIGIR '24, July 14-18, 2024, Washington, DC, USA. Xuejian Li, et al. Figure 1: On Meituan retail delivery platform, the ad 'LAYS CHIPS' in the feed is presented to user along with external organic items. Whether a user clicks on the ad is easily impacted by both the position and the context of the ad. SEARCH MARKET STORE VEGETABLE FRUIT FLOWER SNACK ALCOHOL COSMETIC PET MEDICINE COCA COLA 4.4 Sales 1002 Average Y3 30 mins 2 Okm Initial charge Y0 Delivery cost Y 2 Discount Y 10 LAYS CHIPS 4.2 Sales 3008 Average 30 mins 8km Initial charge Y20 Delivery cost Y2 60 - 15 85 - 25 Discount Y 10 BANANA 74.9 Sales 1110 Average 30 mins 1.7km Initial charge Y20 Delivery cost YO 70 - CABBAGE 4.5 Sales 993 Average Y5 30 mins 434m Initial charge Y20 Delivery cost Y3 eCPM of the next rank ad divided by its own pCTR. Evidently, the payment for the winning ad depends on the bid of the next ranked ad, not its own bid. Meanwhile, the organic items list are sorted by the estimated GMV. Subsequently, the ad allocation algorithm dynamically inserts the auction-winning ad into the ordered organic items list, where the winning ad's payment is used for positions decision [17], aiming to maximize revenue and GMV. From the perspective of ad mechanism design, this method of segregating the ad auction and allocation into two distinct stages face two problems as follows: · Ad auction does not take externalities into account . Ad externalities generally refer to the impact of its display position and context on its CTR [9]. Traditional auctions, including the GSP, often do not consider externalities and obtain stable results based on the separated CTR assumption [25]. However, in practice, the CTR of ad surrounded by organic items is impacted by its actual display position and context. Externalities result in complicated strategic competition among advertisers, precluding stable outcomes and social welfare optimization [21]. Hence, when considering the externalities, traditional auctions are not suitable. · Ad allocation, using the winning ad's payment to determine display position dynamically is not IC for the ad . For the winning ad, even if its bid is increased, it does not secure a better position, thereby losing the opportunity to gain greater utility. This is because in the aforementioned ad auction, even if the winning ad increases bid, its payment remains the same, and thus the ad allocation outcomes do not change. Furthermore, using the bid of the winning ad to determine the display position is also inappropriate. Similarly, without any change in payment, the winning ad is motivated to increase its bid until it secures the best position and maximum utility. However, at this juncture, the GMV loss of the platform may exceed the increase in revenue. In order to solve these problems, designing a mechanism that integrates ad auction and allocation in feed should be considered. This mechanism needs to consider externalities and satisfy the economic properties of IC and IR [13, 20]. IC means that when the advertiser truthfully reports his value, his utility is maximized. IR means that the advertiser's payment will not be higher than his bid. Under the externalities, The ad's CTR varies with its position and context, which makes it not easy to calculate the social welfare of the mechanism [13]. Consequently, designing an externalityaware mechanism that satisfies both IC and IR is very difficult. VCG [5], another classic mechanism, provides ideas for solving these problems. But VCG's expected revenue is lower than that of GSP [5, 25], which is not acceptable for the platform. This mechanism also needs to maximize the platform's revenue and GMV. Therefore, this paper proposes a deep automated M echanism for I ntegrating ad A uction and A llocation in feed, referred to as MIAA , which satisfies both IC and IR in the presence of externalities and maximizes revenue and GMV. Inspired by affine maximizer auction(AMA) [23] based VCG, MIAA is designed to include the following three parts. Firstly, MIAA takes candidate ads and the ordered list of organic items as input. For each candidate ad, several candidate allocations are generated by inserting the ad in different positions of the ordered organic items list. Secondly, for each candidate allocation, a list-wise prediction model takes the entire allocation as input and outputs the predicted results for each ad and organic item to model the global externalities. Finally, an automated auction mechanism is executed to select the optimal allocation to display from these candidate allocations. The mechanism parameters modeled by deep neural networks are learned in an end-to-end way to maximize platform revenue and GMV. Obviously, MIAA simultaneously obtains the ranking, payment, and display position of ad. The contributions of our work are summarized as follows: · A deep automated mechanism for integrating ad auction and allocation . This mechanism simultaneously decides the ranking, payment, and display position of the ad. To the best of our knowledge, the proposed mechanism is the first to consider addressing the externalities and IC issues caused by the separation of ad auction and allocation. · Detailed industrial and practical experience . We successfully deploy MIAA on the Meituan retail feed and obtain significant improvements in both platform revenue and GMV. Deep Automated Mechanism Design for Integrating Ad Auction and Allocation in Feed SIGIR '24, July 14-18, 2024, Washington, DC, USA.", "2 RELATED WORK": "Previous work largely focused on studying optimization of ad auction and allocation separately. The main points of these work are summarized as follows:: · Externality-aware ad auction design . The design of ad auction with externalities has always been a hot topic in both academic and industrial research. The CTR model considering the impact of ad externalities has evolved from local model to global model. Ghosh and Mahdian [9] initially studied the externalities of user click interactions between advertisers. They used a choice model to describe user click behaviors and adopted a VCG-style payment scheme to guarantee IC and IR. User browsing model [4] and cascade models [6, 7, 11], built based on user browsing behavior from top to bottom of the page, take the local impact of externalities into consideration. And then ad auction with user browsing model or cascade models are designed based on GSP or VCG. DNA [18] and DPIN [10] respectively modeled the local externalities on candidate ad sets and ad positions. EXTR [1] modeled the global externalities, but did not consider the subsequent auction mechanism design. The global externalities, such as the interaction between ads and organic items, were considered in [8, 13, 15]. Similarly, this paper directly models the allocation list mixed with organic items and an ad, taking the global externalities into account. · Ad allocation . The platform initially assigned fixed positions to organic items and ads. Dynamic ad allocation strategies to optimize the whole-page performance gains growing attention. These strategies can be divided into two categories. In the first category, the dynamic ad allocation strategies, proposed by Xie et al. [29], Xu et al. [30], Yan et al. [31], Zhang et al. [32], Zhao et al. [33], do not take into account the relative ranking of candidate ads in auction, which dose not satisfy the IC and IR restrictions. In the second category, the strategies maintain the relative ranking of ads and determine the optimal number and positions of ads in the mixed list [16, 24, 27, 28]. Liao et al.[17] propose a DQN architecture to incorporate the arrangement signal into the allocation model without modifying the relative ranking of advertisements. Similarly, Chen et al.[2] propose hierarchically constrained adaptive ad exposure that possesses the desirable game-theoretical properties and computational efficiency. Recently, Li et al. [14] prospectively analyze that this separated method in search scenarios is detrimental to the platform user experience. They propose an integrated model to describe the mixed arrangements of organic items and ads. Based on this model, they design a truthful optimal mechanism with the separated CTR assumption and publicly known distribution of advertising value. Furthermore, this paper breaks the separated CTR assumption and aims to design deep automated mechanism for integrating ad auction and allocation in feed, which satisfies both IC and IR in the presence of externalities and maximizes revenue and GMV.", "3 PRELIMINARIES": "", "3.1 Setting for Ad Auction and Allocation": "This paper considers the mechanism design that integrates payper-click ad auction and allocation in feed. For each user page view Table 1: Main notations. request, there are 𝑚 available positions for placing ads and organic items. There are 𝑛 advertisers competing for one ad position and other 𝑚 -1 positions are filled with organic items. Due to the limitations of platform business division, we assume that these organic items have been sorted according to the estimated GMV. In the subsequent process, the relative ranking of organic items will not be modified, but their CTR and GMV will be re-predicted. The main notations in this paper are summarized in Table 1. Each advertiser 𝑖 ∈ [ 𝑛 ] has a private click value 𝑣 𝑖 ∈ B ⊆ 𝑅 + on his ad and reports a click bid 𝑏 𝑖 ∈ B ⊆ 𝑅 + for auction. We assume that the click value and bid for the organic items are 0. Let v = ( 𝑣 1 , 𝑣 2 , . . . , 𝑣 𝑛 ) ∈ B 𝑛 and b = ( 𝑏 1 , 𝑏 2 , . . . , 𝑏 𝑛 ) ∈ B 𝑛 be the value profile and the bid profile of all ads. We use v -𝑖 and b -𝑖 to represent the value profile and bid profile of all ads except ad 𝑖 . An ad allocation can be represented by a = 𝑎 ( 𝑖, 𝑗 ) , where 𝑎 ( 𝑖, 𝑗 ) means that the ad 𝑖 is inserted into the 𝑗 -th position. Let 𝑗 = 𝜎 ( 𝑖 ) represent the position index of ad 𝑖 in an allocation. The set of all possible allocations is denoted by A = { 𝑎 ( 𝑖, 𝑗 ) : ∀ 𝑖 ∈ [ 𝑛 ] , 𝑗 ∈ [ 𝑚 ]} . Formally, as shown in the Figure 1, one of the allocations is an ordered list mixed with several organic items and an ad. When modeling the impact of the global externalities, the CTR prediction needs to take various aspects into consideration, such as attributes of the ad itself, the position and context of the ad, and the attributes of surrounding organic items [13]. We denote the pCTR of the 𝑗 -th item in the allocation a by 𝑞 𝑗 ( a ) . Let 𝑔 𝑗 ( a ) be the estimated merchandise volume per click of the 𝑗 -th item in the allocation. For convenience, we use 𝑒 𝑗 ∈ E ⊆ 𝑅 to represent the externalities such as CTR and GMV for the 𝑗 -th item in the allocation. SIGIR '24, July 14-18, 2024, Washington, DC, USA. Xuejian Li, et al.", "3.2 Problem Formulation": "Given bids from advertisers and the ordered organic items list, we represent an ad auction and allocation mechanism M⟨R , P⟩ , where: · R( b ; e ) : B 𝑛 × E 𝑚 →A is the ad allocation rule, which is used to select one winning ad from the 𝑛 advertisers and insert it at the certain position in the organic items list. · P( b ; e ) is the payment rule and 𝑝 𝑖 ( b ; e ) is the pay-per-click price of advertiser 𝑖 . For a mechanism M⟨R , P⟩ , the expected utility of advertiser 𝑖 is  and the expected revenue and GMV of the platform is  For the design of ad auction mechanisms, IC and IR are standard economic constraints that must be considered [13]. An auction mechanism M⟨R , P⟩ is IC, if for each advertiser truthfully reports his bid 𝑏 𝑖 = 𝑣 𝑖 and then his utility is maximized. Formally, for any e , for each 𝑖 , it holds that  and an auction mechanism M⟨R , P⟩ is IR, if for each advertiser would not be charged more than his bid for the allocation. Formally, for any e , for each 𝑖 , it holds that  We aim to design a mechanisms M⟨R , P⟩ which satisfies both IC and IR in the presence of externalities and maximizes revenue and GMV of the platform, as follows:  where 𝛼 is a weight coefficient set by the platform to balance revenue and GMV.", "3.3 Automated Mechanism Design": "Formally, the integration of ad auction and allocation can be seen as a combination auction (CA) of ads and organic items, where the private value and bid of organic items on click can be assumed to be 0. Sandholm and Likhodedov [23] proposed an automated mechanism based VCG named AMA for revenue-maximizing combinatorial auctions. The AMA is defined as follows. Each bidder 𝑗 submits a valuation function 𝑣 𝑗 . The allocation, a ∗ , is computed to maximize  where 𝜇 𝑗 is a positive number that is related to the value distribution of the bidder 𝑗 but not related to the allocation, and meanwhile 𝜆 ( a ) is an arbitrary function of the allocation. The payments are    where  a ∗ -𝑗 is the best allocation where bidder 𝑗 is not present. AMAs are a family of mechanisms, parameterized by the vectors 𝜇 and 𝜆 . VCG is the special case where for all bidders 𝑗 and any allocation, 𝜇 𝑗 = 1 and 𝜆 (·) = 0. The 𝜇 𝑗 and 𝜆 (·) are solved using automated search theory to maximize revenue [23]. Roberts et al. [22] and Lavi et al.[12] has proven that only AMAs are IC and IR for all CA settings. Hence, inspired by AMA, this paper extends its application to integrate ad auction and allocation. Unlike search theory, in this paper, 𝜇 𝑗 and 𝜆 (·) are modeled as deep neural networks and trained by end-to-end learning methods.", "4 METHODOLOGY": "In this section, we present the details of deep automated mechanism for integrating ad auction and allocation in feed, namely MIAA, which satisfies both IC and IR in the presence of externalities and maximizes revenue and GMV. As shown in Figure 2, MIAA takes candidate ads and the ordered organic items list as input, and outputs the optimal allocation by three modules. The three modules of MIAA are the Externality-aware Prediction Module (EPM), the Automated Auction Module (AAM) and the Differentiable Sorting Module (DSM). More specifically, EPM takes an allocation as inputs to model the impact of the global externalities and outputs the predicted results for each ad and organic item. AAM uses two deep neural networks to model the two mechanism parameters 𝜇 𝑗 and 𝜆 (·) with the aim of improving the expressive ability of this automated mechanism while guaranteeing IC and IR. DSM uses multi classification model softmax to conduct a continuous relaxation of sorting operator in the mechanism, and outputs a vector representing the winning probability for each candidate allocation. And then the expected revenue and GMV of the platform can be differentiably calculated and optimized by an end-to-end learning way. Next we will introduce each module separately.", "4.1 Externality-aware Prediction Module": "In most traditional auction mechanisms, the position and contextual information of ads can only be known after the auction, so the CTR prediction model cannot obtain them in advance. However, auctions rely on the pCTR by the prediction model. In order to solve this interdependence problem and obtain stable allocation result, the mechanism design is based on the separated CTR assumption, that is, the final CTR of an ad is equal to the product of the CTR of its own content and the CTR of its position, ignoring the influence of contextual items. Therefore, under this assumption, the pointwise model is often used to predict CTR, which do not consider the impact of ads display positions and interaction between ads and organic items [25]. Several models [1, 10, 18] capturing local externalities have been proposed successively, focusing solely on the display position of ad or the local context of ad. To this end, Deep Automated Mechanism Design for Integrating Ad Auction and Allocation in Feed SIGIR '24, July 14-18, 2024, Washington, DC, USA. Figure 2: The architecture of MIAA. MIAA consists of three modules: Externality-aware Prediction Module (EPM), Automated Auction Module (AAM) and Differentiable Sorting Module (DSM). ... ... candidate  allocations DSM ... ... ... ... ... ... ... ... ... AAM ... EPM ... EPM ... ... AAM ... ... ... ... ... ... AAM ... ... ... ... AAM ... EPM EPM sparse feat dense feat the paper uses a list-wise prediction module to model global externalities explicitly, outputting the more accurate pCTR for each item. Firstly, for each candidate ad, several candidate allocations are generated by inserting the ad in different positions of the ordered organic items list. This step corresponds to a time complexity of 𝑂 ( 𝑚 × 𝑛 ) . In actual production processes, the value of 𝑚 is typically not greater than 5, which is acceptable in terms of performance for the platform. Then, EPM adopts a parameter-sharing structure for all the candidate allocations. Here we take one allocation a as an example to illustrate. As shown in Figure 2, EPM takes the allocation a and two types of public information (i.e., request information, user profile in current request) as input and outputs the pCTR of each item in the allocation. We first use embedding layers to extract the embeddings from raw sparse features and then concatenate dense features with the embeddings to form 𝑑 -dimensional feature vector z 𝑗 ∈ R 𝑑 for the 𝑗 -th item. The feature matrix of the allocation a is represented as Z a ∈ R 𝑚 × 𝑑 , while the feature vector of request information, user profile are respectively represented by z 𝑢 , and z 𝑟 . Next, We use a Self Attention Unit [26] to model the interaction between the ad and the organic items in the candidate allocation:  where Q a , K a , V a represent query, key, and value, respectively. Here query, key, and value are transformed linearly from feature information of the allocation a , as follows:  Finally, we reshape H a as one vector h a ∈ R 𝑚𝑑 and concatenate z 𝑢 , z 𝑟 and put them into a Multi-Layer Perceptron (MLP) to model the global externalities:  where 𝑞 𝑗 ( a ) denotes the pCTR of the 𝑗 -th item in the allocation. In EPM, the cross entropy loss is calculated by the real click behavior of each item to train this list-wise model:  where 𝑦 𝑗 ∈ { 0 , 1 } represents whether user clicks the 𝑗 -th item in the allocation or not. EPM takes a candidate allocation as input and outputs the pCTR for each position in the allocation. It is built and trained independently, without coupling to downstream modules. EPM is a general framework that can easily be extended to multiple targets prediction such as conversion rate (CVR) and GMV. The 𝑔 𝑗 ( a ) used in the following text can be predicted simultaneously in EPM, without further elaboration. Compared with point-wise models, list-wise models capture the global externalities and output more accurate results, which can help the subsequent modules achieve better performance. SIGIR '24, July 14-18, 2024, Washington, DC, USA. Xuejian Li, et al.", "4.2 Automated Auction Module": "This module selects the optimal allocation from all possible candidate allocations, which simultaneously decides the ranking, payment, and display position of the ads. Extending AMA into a deep automated mechanism, 𝜇 and 𝜆 (·) are modeled as deep neural networks 𝜇 -network and 𝜆 -network to improve the expressive ability of ranking formula while guaranteeing IC and IR properties. Firstly, 𝜇 represents the strength of item bidding capability and is independent of the allocations [23]. Thus, more specifically, the value distribution information of ads, the features of request information, user profile and items are the main input features of the 𝜇 -network. Let x 𝑗 represent the value distribution information vector of the 𝑗 -th item in the allocation. The 𝜇 -network can be formally expressed as:  where the sigmoid function ensures a positive output. Each item has a 𝑓 𝜇 𝑗 to represent its competitive ability. Then, 𝜆 is an arbitrary function of the allocation a . The features of each item in the allocation a are concatenated to represent the entire allocation, and the 𝜆 -network for the allocation a is:  where o 𝑗 = x 𝑗 | 𝑞 𝑗 ( a )| 𝑔 𝑗 ( a ) . Finally, the social welfare of the allocation a is calculated as:  where eCPM 𝑗 ( a ) = 𝑏 𝑗 × 𝑞 𝑗 ( a ) is the 𝑗 -th item valuation function on the allocation a . The optimal allocation a ∗ is computed to maximize SW 𝜇 𝜆 (·) . The payment on click of the ad 𝑖 in the 𝜎 ( 𝑖 ) -th position of a ∗ are  where a ∗ -𝑖 is the optimal allocation where ad 𝑖 is not present and SW 𝜇 𝜆 ( a ∗ ) -𝑖 = ˝ 𝑗 ≠ 𝜎 ( 𝑖 ) 𝑓 𝜇 𝑗 · 𝑏 𝑗 · 𝑞 𝑗 ( a ∗ ) + 𝑓 𝜆 ( a ∗ ) . Because there is only one ad in the allocation, and the bid of each organic item is 0, so SW 𝜇 𝜆 ( a ∗ ) -𝑖 = 𝑓 𝜆 ( a ∗ ) . Obviously, the process maintains the IC and IR properties of AMA. The 𝜇 -network and 𝜆 -network are trained by end-to-end learning in the next module DSM.", "4.3 Differentiable Sorting Module": "The search theory used in AMA [23] to solve 𝜇 and 𝜆 parameters is inefficient. This paper aims to improve the efficiency and effectiveness of solving this mechanism problem in the end-to-end learning way. However, We are faced with two challenges, the first one is the non-differentiability of the ranking process in auctions, and the second one is the lack of user real behavior feedback. In AAM, the sorting operation to obtain the optimal allocation leads to a non-differentiable process for the entire procedure. Inspired by the differentiable sorting engine proposed by Liu et al. [18], we use multi classification model softmax to conduct a continuous relaxation of sorting operator in the mechanism. Given the allocations set SW = [ SW 𝜇 𝜆 ( a 1 ) , . . . , SW 𝜇 𝜆 ( a 𝑚𝑛 )] , the vector Pr of the allocations is mapped by the softmax function:  where 𝜏 is a temperature parameter. Intuitively, Pr can be interpreted as the winning probabilities on all allocations. We use the pCTR and preditcted GMV (pGMV) indicators to simulate user behavior, and calculate the performance metrics of the allocations, which are then used for feedback training. Hence, the expected revenue and GMV of the allocations are calculated by Eq.(2) as:  Specifically, only the winning allocation's revenue is greater than 0, while the non-winning allocations' revenues are 0. Finally, The overall optimization goal is to maximize Reward 𝜇 𝜆 , i.e., minimize  This Loss provides direct feedback for training 𝜇 -network and 𝜆 -network, which is a partial differentiable method. This training process is highly dependent on the accuracy of the pCTR and pGMV, which may lead to inconsistencies between the offline and online effects of this mechanism. Therefore, it is necessary to improve the prediction performance of pCTR and pGMV in EPM and perform list-wise calibration on them [3].", "4.4 Training and Online Serving": "The data (e.g., the candidate ads set, the organic items list, and the real display ordered list and so on) in each request should be recorded for the training of MIAA. The training of 𝜇 -network and 𝜆 -network in AAM relies on the prediction output of the list-wise model in EPM. Hence, the list-wise model in EPM first needs to be trained separately, using real display ordered list data. Then, for each request record, all the possible allocations are generated based on candidate ads and the organic items list. Next, the trained list-wise model in EPM provides the prediction results of pCTR and pGMV for each allocation, which will be used for subsequent training of 𝜇 -network and 𝜆 -network in AAM. This training process cannot obtain real user behavior feedback, so it relies on prediction data for evaluating model performance. The trained models in EPM and AAM are deployed online simultaneously and online serving is provided according to the following process: · Step1 . Generate all the possible allocations. · Step2 . Predict the pCTR and pGMV by EPM for each allocation. · Step3 . Select the optimal allocation by AAM from all the possible allocations. · Step4 . Return the winnning ad and its position.", "5 EXPERIMENTS": "In this section, we evaluate the effectiveness of the proposed mechanism MIAA with the aim of answering the following questions: Deep Automated Mechanism Design for Integrating Ad Auction and Allocation in Feed SIGIR '24, July 14-18, 2024, Washington, DC, USA. Table 2: Statistics of the datasets. Avg items represents the average number of items per request. · Q1 : Compared with the point-wise pCTRs, how does our list-wise model perform in terms of CTR prediction? · Q2 : Compared with widely used ad auction and allocation mechanisms in the industrial platform, how does our mechanism perform in terms of platform revenue and GMV? We conduct extensive offline experiments on public and industrial datasets and online A/B tests on Meituan retail delivery platform.", "5.1 Experimental Settings": "5.1.1 Dataset. In the offline experiments, we provide empirical evidence for the effectiveness of our mechanism on both public and industrial datasets. The statistics of the two datasets are summarized in Table 2 and their detailed descriptions are as follows: · Avito 1 . The public dataset is the Avito dataset used for the Avito context ad clicks competition of Kaggle. It is a random sample of previously selected users' searches on avito.ru during at least 26 consecutive days. In each search result page, only five items in position 1, 2, 6, 7, 8 are logged. And only the items (i.e., contextual ads) in the 1-st and 7-th positions are marked with whether the user clicked or not. For subsequent experiments, we simulate whether users click on items in the 2-nd and 6-th positions, based on the click behavior in the 1-st and 7-th positions. Let CTR 𝑗 represent the CTR of position 𝑗 . The CTR1 and CTR7 can be obtained through statistical analysis. Then, CTR2 is simulated to follow a normal distribution 𝑁 ( 0 . 8CTR1 + 0 . 2CTR7 , 0 . 1CTR1 ) , while CTR6 is simulated to follow a normal distribution 𝑁 ( 0 . 2CTR1 + 0 . 8CTR7 , 0 . 1CTR7 ) . The public information consists of search ID, user ID and search date, while the item information consists of ad ID, location ID, category ID and title. For each sample, we select the 1-st item and the 7-th item as candidate ads, and the remaining three items are treated as organic items. Therefore, each candidate allocation is 1 https://www.kaggle.com/competitions/avito-context-ad-clicks/data Table 3: Experiment results about AUC and PCOC on Avito dataset. 'Pos' stands for the position in allocation. composed of a candidate ad and these three organic items. Here we use the data from 20150425 to 20150517 as the training set and the data from 20150518 to 20150520 as the testing set to avoid data leakage. · Meituan . The industrial dataset is collected under GSP auction and fix positions on Meituan retail delivery platform during December 2023. Converted from each feed request, each sample contains all possible candidate allocations composed of candidate ads and organic items, as well as the final winning optimal allocation. Each candidate allocation is composed of a candidate ad and three organic items. In each candidate allocation, the information of each item consists of bid, sparse features (e.g., ID, category, brand and so on), dense features(e.g., historical CTR, sales volume, value distribution information and so on). Moreover, the point-wise pCTR in the production environment is recorded for subsequent performance comparison. According to the date of data collection, we divide the dataset into training and test sets with the proportion of 8:2. 5.1.2 Evaluation Metrics. We construct an offline simulation system based on the pCTR and pGMV to evaluate the effectiveness of MIAA. Each experiment is repeated 5 times with different random seeds and each result is presented in the form of mean ± standard. The following evaluation metrics are used in our offline experiments and online A/B tests. · Click-Through Rate . CTR = ˝ 𝑐𝑙𝑖𝑐𝑘 ˝ 𝑖𝑚𝑝𝑟𝑒𝑠𝑠𝑖𝑜𝑛 . · AUC . AUC stands for Area Under the Curve, which is often used to evaluate the performance of a model in machine learning. The closer the AUC value is to 1, the better the model performs. · PCOC . PCOC stands for Predicted CTR Over posterior CTR, which is a measure of prediction accuracy. If the PCOC value is close to 1, it indicates a high prediction accuracy. · Revenue Per Mille . RPM = ˝ 𝑐𝑙𝑖𝑐𝑘 × 𝑝𝑎𝑦𝑚𝑒𝑛𝑡 ˝ 𝑖𝑚𝑝𝑟𝑒𝑠𝑠𝑖𝑜𝑛 × 1000. · GMVPer Mille . GPM = ˝ 𝐺𝑀𝑉 ˝ 𝑖𝑚𝑝𝑟𝑒𝑠𝑠𝑖𝑜𝑛 × 1000. 5.1.3 Baselines. In terms of externalities modeling, we compare the pCTR of the proposed list-wise model with that of the pointwise model. In terms of platform revenue and GMV, we compare Table 4: Experiment results about AUC and PCOC on Meituan dataset. 'Pos' stands for the position in allocation. SIGIR '24, July 14-18, 2024, Washington, DC, USA. Xuejian Li, et al. Table 5: Experiment results of the five methods on two datasets. Each result is presented in the form of mean ± standard deviation. The pRPM and pGPM represent the RPM and GPM values calculated based on pCTR and pGMV. The 𝛼 is 0.5. Lift percentage means the improvement of the method in this line over the result of GSP and Fixed Position. Considering the confidentiality of commercial data, the experimental results on the Meituan dataset are presented based on GSP and Fixed Position. Table 6: Online A/B tests (2023.10.15-2023.12.15 two months) compared with GSP+Fixed Position and GSP+Cross DQN on promoting all performance metrics. The 𝛼 is 0.3. MIAA with the following four common auction and allocation mechanisms: · GSP [25] and Fixed Position . This is a mechanism where the ad auction and allocation are separated into two stages. First, the GSP mechanism is used to select the winning ad, and then this ad is displayed in a fixed position. · GSP and Cross DQN [17]. The winning ad in GSP and the organic items form multiple combinations of candidate positions, which are evaluated and selected through cross DQN, finally determining the display position of the ad. in this list have real user click behavior data that can be used to evaluate the performance of these two models. The detailed experimental results on the Avito dataset are shown in Table 3. For all positions in allocation, the list-wise pCTR in EPM improves the AUC by 0.0036 compared with the point-wise pCTR, and its PCOC is closer to 1. And at each position, the prediction results of the list-wise model in EPM is better than that of the point-wise model. · Score-Weighted VCG [13]. The Score-Weighted VCG framework decomposes the optimal auction design into two parts: designing a monotone score function and an matching-based allocation algorithm. But it does not consider the platform GMV and its incentive effect. · IAS [14]. IAS treats organic items as special ads with a bid of 0 and integrates both ads and organic items into the optimal auction to get their rankings.", "5.2 Offline Experiments": "5.2.1 Performance Comparison of externalities modeling (Q1). On the public Avito dataset, we need to construct point-wise model and list-wise model of EPM. The point-wise model is a deep neural network with multiple fully connected layers of 256 × 128 × 64 × 32 × 1. For each request, The items in the 1-st, 2-nd, 6-th, and 7-th positions are extracted to form a list for constructing the list-wise model of EPM. As mentioned earlier, only the 1-st position and 4-th position On the Meituan industrial dataset, the point-wise pCTR by DIN [34] model is already included, which is used in the production environment. Therefore, we only need to construct the list-wise model of EPM to predict CTR, and then compare it with the former. The detailed experimental results on Meituan industrial dataset are shown in Table 4. From the results, the list-wise model in EPM significantly improves the AUC of all positions from 0.6485 of the point-wise model to 0.7077, and the PCOC of all positions is even closer to 1. Considering positional externalities, the list-wise model in EPM solves the problem of low predition at the first position, which has always existed in the point-wise model. Obviously, considering the externalities (e.g., the display position and context of the ad), the list-wise model in EPM performs better on AUC and PCOC metrics than the point-wise models on both the public Avito dataset and Meituan industrial dataset. 5.2.2 Performance Comparison of mechanisms (Q2). To validate the efficacy of the proposed mechanism in enhancing platform revenue and GMV, we implemente the GSP and Fixed Position, GSP and Cross DQN, Score-Weighted VCG and IAS on these two datasets for comparative analysis. On the public Avito dataset, we Deep Automated Mechanism Design for Integrating Ad Auction and Allocation in Feed SIGIR '24, July 14-18, 2024, Washington, DC, USA. select the 1-st item and the 7-th item as candidate ads, and the remaining three items are treated as organic items. Moreover, we provide a simulated bid for each ad and a simulated pGMV per click for each item. The bid of each ad is independently sampled from uniform distribution between 0.5 and 1.0. Meanwhile, the pGMV per click for organic items is independently sampled from uniform distribution between 3.5 and 6.0, and the pGMV per click for ads is independently sampled from uniform distribution between 2.0 and 4.0. On these two datasets, the fixed position is set as 2 in the GSP and Fixed Position baseline. Particularly, it should be pointed out that, as the offline simulation systems are unable to obtain actual user behavior data under different mechanisms, the assessment of these experiments' effectiveness is statistically derived from the pCTR and pGMV of users on items. Considering the confidentiality of commercial data, the experimental results on the Meituan dataset are presented based on GSP and Fixed Position. The detailed experiment results on public and industrial datasets are shown in Table 5. From the experiment results, we can see that MIAA achieves obtains the highest revenue and GMV, outperforming all baseline mechanisms. Compared with GSP and Fixed Position, MIAA achieves significant improvements, as items with higher eCPM or GMV obtain better positions, and the payment of ads is increased. MIAA, considering the incentive effect of organic items on ads, achieves higher pRPM compared with GSP and Cross DQN. ScoreWeighted VCG achieves maximum pRPM without considering the loss of GMV. Compared with IAS, MIAA, which considers externalities, achieves higher pRPM and pGMV.", "5.3 Online Results": "We present the online experiments by deploying the proposed mechanism in Meituan retail delivery platform. In the production environment of feed, for each page request, the system returns an ordered list containing one ad and three organic items. There are two baselines, one is GSP and fixed position (that is, the ad is inserted at the second position), and the other one is GSP and Cross DQN, in which the ad is dynamically assigned to a certain position. To demonstrate the performance of the proposed mechanism, we conduct online A/B tests with 5% of whole production traffic from Oct 15, 2023 to Dec 15, 2023. In the real production environment, we cannot conduct A/B tests based on advertisers. The A/B tests using user-based traffic makes it difficult to evaluate the proposed mechanism's incentive effect on advertisers' bidding. Therefore, we only focus on the performance of revenue, GMV, RPM, and GPM in the experiments. In order to make fair and efficient comparisons between different baselines in production traffic, we will equalize the number of ad displays in the experimental group with that in the baselines. The experiment results in online A/B tests are shown in Table 6. From the results, we can find that the proposed mechanism achieves the highest promotion for revenue, GMV, RPM and GPM compared with GSP and Fixed Position, and GSP and Cross DQN.", "6 CONCLUSIONS": "This paper proposes a deep automated mechanism for integrating ad auction and allocation, that satisfies both IC and IR in the presence of externalities and maximizes revenue and GMV. Specifically, for all candidate allocations formed by the mixture of the ad and organic items, we use a list-wise model for global externalities modeling. Then, we use an automated mechanism based on deep neural networks to select the optimal allocation from the candidate allocation set in an end-to-end learning way. In this process, the ranking, payment, and display position of the ads are determined at the same time. We conduct extensive offline experiments on public and industrial datasets and online A/B tests on Meituan retail delivery platform. The offline experimental results and online A/B tests showed that the proposed mechanism significantly outperforms the other existing mechanism baselines. In future research, we aim to investigate efficient mechanisms design for integrating multi-slots ads auction and allocation. SIGIR '24, July 14-18, 2024, Washington, DC, USA. Xuejian Li, et al.", "REFERENCES": "[1] Chi Chen, Hui Chen, Kangzhi Zhao, Junsheng Zhou, Li He, Hongbo Deng, Jian Xu, Bo Zheng, Yong Zhang, and Chunxiao Xing. 2022. EXTR: Click-Through Rate Prediction with Externalities in E-Commerce Sponsored Search. In Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining . 2732-2740. [2] Dagui Chen, Qi Yan, Chunjie Chen, Zhenzhe Zheng, Yangsu Liu, Zhenjia Ma, Chuan Yu, Jian Xu, and Bo Zheng. 2022. Hierarchically Constrained Adaptive Ad Exposure in Feeds. In Proceedings of the 31st ACM International Conference on Information & Knowledge Management . 3003-3012. [3] Chao Deng, Hao Wang, Qing Tan, Jian Xu, and Kun Gai. 2021. Calibrating user response predictions in online advertising. In Machine Learning and Knowledge Discovery in Databases: Applied Data Science Track: European Conference, ECML PKDD 2020, Ghent, Belgium, September 14-18, 2020, Proceedings, Part IV . Springer, 208-223. [4] Georges E Dupret and Benjamin Piwowarski. 2008. A user browsing model to predict search engine click data from past observations.. In Proceedings of the 31st annual international ACM SIGIR conference on Research and development in information retrieval . 331-338. [5] Benjamin Edelman, Michael Ostrovsky, and Michael Schwarz. 2007. Internet advertising and the generalized second-price auction: Selling billions of dollars worth of keywords. American economic review 97, 1 (2007), 242-259. [6] Gabriele Farina and Nicola Gatti. 2016. Ad auctions and cascade model: GSP inefficiency and algorithms. In Proceedings of the AAAI Conference on Artificial Intelligence , Vol. 30. [7] Dimitris Fotakis, Piotr Krysta, and Orestis Telelis. 2011. Externalities among advertisers in sponsored search. In International Symposium on Algorithmic Game Theory . Springer, 105-116. [8] Nicola Gatti, Alessandro Lazaric, and Francesco Trovò. 2012. A truthful learning mechanism for contextual multi-slot sponsored search auctions with externalities. In Proceedings of the 13th ACM Conference on Electronic Commerce . 605-622. [9] Arpita Ghosh and Mohammad Mahdian. 2008. Externalities in online advertising. In Proceedings of the 17th international conference on World Wide Web . 161-168. [10] Jianqiang Huang, Ke Hu, Qingtao Tang, Mingjian Chen, Yi Qi, Jia Cheng, and Jun Lei. 2021. Deep Position-wise Interaction Network for CTR Prediction. In Proceedings of the 44th International ACM SIGIR Conference on Research and Development in Information Retrieval . 1885-1889. [11] David Kempe and Mohammad Mahdian. 2008. A cascade model for externalities in sponsored search. In International Workshop on Internet and Network Economics . Springer, 585-596. [12] Ron Lavi, Ahuva Mu'Alem, and Noam Nisan. 2003. Towards a characterization of truthful combinatorial auctions. In 44th Annual IEEE Symposium on Foundations of Computer Science, 2003. Proceedings. IEEE, 574-583. [13] Ningyuan Li, Yunxuan Ma, Yang Zhao, Zhijian Duan, Yurong Chen, Zhilin Zhang, Jian Xu, Bo Zheng, and Xiaotie Deng. 2023. Learning-Based Ad Auction Design with Externalities: The Framework and A Matching-Based Approach. In Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining . 1291-1302. [14] Weian Li, Qi Qi, Changjun Wang, and Changyuan Yu. 2023. Optimally integrating ad auction into E-commerce platforms. Theoretical Computer Science 976 (2023), 114141. [15] Guogang Liao, Xuejian Li, Ze Wang, Fan Yang, Muzhi Guan, Bingqi Zhu, Yongkang Wang, Xingxing Wang, and Dong Wang. 2022. NMA: Neural Multi-slot Auctions with Externalities for Online Advertising. arXiv preprint arXiv:2205.10018 (2022). [16] Guogang Liao, Xiaowen Shi, Ze Wang, Xiaoxu Wu, Chuheng Zhang, Yongkang Wang, Xingxing Wang, and Dong Wang. 2022. Deep Page-Level Interest Network in Reinforcement Learning for Ads Allocation. In Proceedings of the 45th International ACM SIGIR Conference on Research and Development in Information Retrieval . 2292-2296. [17] Guogang Liao, Ze Wang, Xiaoxu Wu, Xiaowen Shi, Chuheng Zhang, Yongkang Wang, Xingxing Wang, and Dong Wang. 2021. Cross DQN: Cross Deep Q Network for Ads Allocation in Feed. arXiv preprint arXiv:2109.04353 (2021). [18] Xiangyu Liu, Chuan Yu, Zhilin Zhang, Zhenzhe Zheng, Yu Rong, Hongtao Lv, Da Huo, Yiqing Wang, Dagui Chen, Jian Xu, et al. 2021. Neural auction: End-toend learning of auction mechanisms for e-commerce advertising. In Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery & Data Mining . 3354-3364. [19] Pavel Metrikov, Fernando Diaz, Sebastien Lahaie, and Justin Rao. 2014. Whole page optimization: how page elements interact with the position auction. In Proceedings of the fifteenth ACM conference on Economics and computation . 583600. [20] Roger B Myerson. 1981. Optimal auction design. Mathematics of operations research 6, 1 (1981), 58-73. [21] Tao Qin, Wei Chen, and Tie-Yan Liu. 2015. Sponsored search auctions: Recent advances and future directions. ACM Transactions on Intelligent Systems and Technology (TIST) 5, 4 (2015), 1-34. [22] Kevin Roberts. 1979. The characterization of implementable choice rules. Aggregation and revelation of preferences 12, 2 (1979), 321-348. [23] Tuomas Sandholm and Anton Likhodedov. 2015. Automated design of revenuemaximizing combinatorial auctions. Operations Research 63, 5 (2015), 1000-1025. [24] Xiaowen Shi, Ze Wang, Yuanying Cai, Xiaoxu Wu, Fan Yang, Guogang Liao, Yongkang Wang, Xingxing Wang, and Dong Wang. 2023. MDDL: A Framework for Reinforcement Learning-based Position Allocation in Multi-Channel Feed. arXiv preprint arXiv:2304.09087 (2023). [25] Hal R Varian. 2007. Position auctions. international Journal of industrial Organization 25, 6 (2007), 1163-1178. [26] Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Lukasz Kaiser, and Illia Polosukhin. 2017. Attention is all you need. arXiv preprint arXiv:1706.03762 (2017). [27] Ze Wang, Guogang Liao, Xiaowen Shi, Xiaoxu Wu, Chuheng Zhang, Yongkang Wang, Xingxing Wang, and Dong Wang. 2022. Learning List-wise Representation in Reinforcement Learning for Ads Allocation with Multiple Auxiliary Tasks. In Proceedings of the 31st ACM International Conference on Information & Knowledge Management . 3555-3564. [28] Ze Wang, Guogang Liao, Xiaowen Shi, Xiaoxu Wu, Chuheng Zhang, Bingqi Zhu, Yongkang Wang, Xingxing Wang, and Dong Wang. 2022. Hybrid Transfer in Deep Reinforcement Learning for Ads Allocation. In Proceedings of the 31st ACM International Conference on Information & Knowledge Management . 4560-4564. [29] Ruobing Xie, Shaoliang Zhang, Rui Wang, Feng Xia, and Leyu Lin. 2021. Hierarchical Reinforcement Learning for Integrated Recommendation. In Proceedings of AAAI . [30] Yue Xu, Qijie Shen, Jianwen Yin, Zengde Deng, Dimin Wang, Hao Chen, Lixiang Lai, Tao Zhuang, and Junfeng Ge. 2023. Multi-channel Integrated Recommendation with Exposure Constraints. arXiv preprint arXiv:2305.12319 (2023). [31] Jinyun Yan, Zhiyuan Xu, Birjodh Tiwana, and Shaunak Chatterjee. 2020. Ads allocation in feed via constrained optimization. In Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining . 33863394. [32] Weiru Zhang, Chao Wei, Xiaonan Meng, Yi Hu, and Hao Wang. 2018. The wholepage optimization via dynamic ad allocation. In Companion Proceedings of the The Web Conference . 1407-1411. [33] Xiangyu Zhao, Changsheng Gu, Haoshenglun Zhang, Xiwang Yang, Xiaobing Liu, Hui Liu, and Jiliang Tang. 2021. DEAR: Deep Reinforcement Learning for Online Advertising Impression in Recommender Systems. In Proceedings of the AAAI Conference on Artificial Intelligence , Vol. 35. 750-758. [34] Guorui Zhou, Xiaoqiang Zhu, Chenru Song, Ying Fan, Han Zhu, Xiao Ma, Yanghui Yan, Junqi Jin, Han Li, and Kun Gai. 2018. Deep interest network for click-through rate prediction. In Proceedings of the 24th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining . 1059-1068."}
