{
  "Individual Welfare Guarantees in the Autobidding World with Machine-learned Advice": "",
  "Yuan Deng": "Google Research, dengyuan@google.com",
  "Negin Golrezaei": "Sloan School of Management, Massachusetts Institute of Technology, golrezae@mit.edu",
  "Patrick Jaillet": "Department of Electrical Engineering and Computer Science, Massachusetts Institute of Technology, jaillet@mit.edu",
  "Jason Cheuk Nam Liang": "Operations Research Center, Massachusetts Institute of Technology, jcnliang@mit.edu",
  "Vahab Mirrokni": "Google Research, mirrokni@google.com Online advertising channels have commonly focused on maximizing total advertiser value (or welfare) to enhance long-run retention and channel healthiness. Previous literature has studied auction design by incorporating machine learning predictions on advertiser values (also known as machine-learned advice ) through various forms to improve total welfare. Yet, such improvements could come at the cost of individual bidders' welfare and do not shed light on how particular advertiser bidding strategies impact welfare. Motivated by this, we present an analysis on an individual bidder's welfare loss in the autobidding world for auctions with and without machine-learned advice, and also uncover how advertiser strategies relate to such losses. In particular, we demonstrate how ad platforms can utilize ML advice to improve welfare guarantee on the aggregate and individual bidder level by setting ML advice as personalized reserve prices when the platform consists of autobidders who maximize value while respecting a return-on-ad spent (ROAS) constraint. Under parallel VCG auctions with such ML advice-based reserves, we present a worst-case welfare lower-bound guarantee for an individual autobidder, and show that the lower-bound guarantee is positively correlated with ML advice quality as well the scale of bids induced by the autobidder's bidding strategies. Further, we prove an impossibility result showing that no truthful, and possibly randomized mechanism with anonymous allocations can achieve universally better individual welfare guarantees than VCG, in presence of personalized reserves based on ML-advice of equal quality. Moreover, we extend our individual welfare guarantee results to generalized first price (GFP) and generalized second price (GSP) auctions. Finally, we present numerical studies using semi-synthetic data derived from ad auction logs of a search ad platform to showcase improvements in individual welfare when setting personalized reserve prices with ML-advice. Key words : Individual welfare guarantee, mechanism design, machine-learned advice, welfare maximization",
  "1. Introduction": "Online advertisers have access to a vast array of digital advertising channels, such as social media, web display, keyword search, etc., from which they can procure ad impressions and drive user traffic. One possible way for these channels to improve overall attractiveness and retention is to 1 2 design appropriate ad auction mechanisms that enhance advertisers' total welfare, which reflects the aggregate advertiser-perceived value for procured ad impressions on the channel. For instance, consider advertisers whose ad campaign objective is to maximize ad clicks that direct users to landing pages of their services or products, as described in Ghose and Yang (2009). These advertisers' perceived value of procured ad impressions is their click conversion rate, and thereby ad channels' welfare maximization goal translates into improving the aggregate realized click conversion among all participating advertisers. Academic literature has developed various approaches to improve total welfare, one of which involves predicting advertiser values by applying machine learning tools to data on users' interactions with ads. In the instance where welfare corresponds to click conversion, channels use ML algorithms to produce predictions (i.e., ML advice) on click conversion rates for impressions. See Richardson et al. (2007), Sodomka et al. (2013), McMahan et al. (2013) or Yang and Zhai (2022) for a comprehensive survey on click predictions. Having obtained ML advice on advertiser values, recent works such as Deng et al. (2021), Balseiro et al. (2021a), Deng et al. (2022) motivate the approach to augment existing ad auctions by directly setting personalized reserve prices for advertisers using such ML advice, and show theoretical guarantees on total welfare improvement. Nevertheless, these results have two important issues. First, the pursuit of improving total welfare may not necessarily guarantee all individual advertisers benefit equally and may come at the expense of certain individual advertisers' welfare. For instance, larger advertisers acquiring more impressions while smaller advertisers receive fewer impressions could potentially harm the businesses of smaller advertisers and compromise the overall health of the channel in the long term. Second, welfare improvement guarantees are presented in a price of anarchy (POA) fashion, which measures the worst-case outcome total welfare compared to the maximum achievable (or efficient) welfare. However, these POA bounds are independent of advertiser bidding strategies and thus do not shed light on how particular advertiser bidding strategies in ad auctions impact individual or total welfare. In light of these insufficiencies of existing results, in this work, we address the following questions: Given an advertisers' bidding strategy to procure impressions in ad auctions, how can platforms characterize the potential welfare loss of this individual advertiser? How should ad channels utilize machine-learned advice that predict advertiser values to improve individual welfare? We study a prototypical autobidding setting where advertisers compete simultaneously in numerous multi-slot position auctions that are run in parallel, and aim to maximize total advertiser value under return-on-ad-spent (ROAS) constraints that restrict total spend of a bidder to be less than her total acquired value across all auctions in an average sense; see similar setups in (Aggarwal et al. 2019, Deng et al. 2021, Balseiro et al. 2021a, Mehta 2022). On the other hand, ad platforms possess 3 ML advice that predicts advertisers' real values with a certain degree of accuracy/quality. Under this setup, our main contributions and organization of the paper is described as followed: Strategy-dependent individual welfare guarantee metric for individual advertisers. In Section 2, we present a novel individual welfare metric that measures the difference between two specific welfare outcomes of an individual advertiser: fixing a certain bidding strategy, the worst case welfare over all auction outcomes under which all bidders' ROAS constraints are satisfied; and the welfare this individual bidder would have obtained in the global welfare maximizing outcome. Our metric achieves two key goals: 1. it characterizes individual welfare loss, and 2. allows platforms to uncover the relationship between advertiser strategies and individual welfare guaranties. Our proposed metric is the first of its kind to achieve these two goals. Individual welfare guarantees in VCG auctions by setting personalized reserves with ML advice. In Section 3, we illustrate through examples that setting ML advice as personalized reserves as in (Deng et al. 2021, Balseiro et al. 2021a, Deng et al. 2022) surprisingly improves individual welfare guarantees under our aforementioned individual welfare metric. Then, in Section 4 where we consider parallel VCG auctions, and focus on an individual autobidder who adopts uniform bidding (Proposition 2.1), we formally show that augmenting such auctions with ML-advice-based reserves allows us to present an individual welfare lower bound guarantee for this advertiser that increases in the advertiser's uniform bid multiplier, the quality of ML advice, and the relative market share of this advertiser compared to competitors (Theorem 4.1). Together with results in (Deng et al. 2021) stating ML-advice-based reserves can improve total welfare, we conclude that incorporating ML advice as personalized reserves achieves 'best of both worlds' by simultaneously benefiting total and individual welfare. Impossibility result: VCG yields the best individual welfare guarantees among a broad class of auctions. In Section 5, we show an impossibility result that says no allocation-anonymous, truthful, and possibly randomized auction format with ML advice of given quality can achieve a strictly better individual welfare guarantee than the VCG auction coupled with ML advice of the same quality; see Theorem 5.1. In particular, for any allocation-anonymous, truthful, and possibly randomized auction, we construct a problem instance with personalized reserves based on ML-advice of given quality, and show that there must be at least 1 bidder whose welfare is at most the welfare lower bound guarantee we presented under VCG (i.e. Theorem 4.1). Extending individual welfare guarantee to GSP and GFP. We extend individual welfare guarantee results to GSP and GFP auctions, and show that a similar individual welfare lower bound guarantee for VCG continues to hold (Theorem 6.2). We compare these lower bound guarantees in GSP and GFP with that of VCG and identify conditions under which VCG outperforms (or underperforms) GSP/GFP in terms of our individual welfare metric with the same ML advice quality. 4 Numerical results. We present numerical studies using semi-synthetic data derived from auction logs of a search ad platform to showcase individual welfare improvement via setting personalized reserve prices with ML-advice. We demonstrate that as ML-advice quality improves, more advertisers' welfare would approach what they would have obtained under the efficient outcome.",
  "1.1. Related Works": "Autobidding and total welfare maximization. The most relevant works to this paper are Deng et al. (2021), Balseiro et al. (2021a), Mehta (2022), where they consider the same autobidding setting (i.e. value-maximizers with ROAS constraints) as ours. Deng et al. (2021), Balseiro et al. (2021a), Mehta (2022), Deng et al. (2022) all present techniques to improve price-of-anarchy bounds for the total welfare of any feasible outcome in which all bidders' ROAS constraints are satisfied: where Deng et al. (2021) relies on additive boosts on bid values, Balseiro et al. (2021a), Deng et al. (2022) utilizes approximate reserve prices derived from ML-advice, and Mehta (2022) develops randomized allocation and payment rules. Our work distinguishes itself from these works as we focus on welfare and individual welfare guarantees on the individual bidder level, and also sheds light on how autobidders' uniform bidding strategies affect individual welfare loss. We point out that our proof techniques also differ from those in Deng et al. (2021), Balseiro et al. (2021a), Mehta (2022), Deng et al. (2022) as our individual individual welfare guarantees require novel analyses on the value-expenditure tradeoffs individual bidders' would face when they are tempted to outbid others to acquire more value; see discussion in Section 4 for more details. Exploiting machine-learned advice. ML advice has been utilized in various applications to improve learning and decision making. For example, Wang et al. (2020) exploits ML advice to develop algorithms for the multi-shop ski-rental problem, (Lykouris and Vassilvtiskii 2018) adopts ML advice for the caching problem, and (Indyk et al. 2022) studies online page migration with ML advice. However, although many works in online advertising studied predictive models for advertiser values, click through rates, etc (see e.g. (Richardson et al. 2007, Lee et al. 2012, Sodomka et al. 2013)), the literature on applying such predictions (or more generally, ML advice) to the mechanism design problem has been scarce. See also Correa et al. (2021), Golrezaei et al. (2022) for works that exploit sample information (unstructured ML advice) in online decision-making. One related work along this direction is Munoz and Vassilvitskii (2017), which develops a theoretical framework to optimize reserve prices in a posted price mechanism by utilizing prediction inputs on bid values. In this work, we do not optimize for reserves, and motivate the simple approach of setting reserves using ML advice to improve individual advertiser welfare. Finally, we note that our work contributes to the area of exploiting ML advice to designing mechanisms for improving welfare guarantees for individual bidders. 5 For more related works mechanism design for constrained bidders, algorithmic bidding/learning under constraints, and reserve price optimization, we refer readers to Appendix A for an extended literature review.",
  "2. Preliminaries": "We describe our model in the context of sponsored search as in Section 1, but remark that all results and insights apply to general online advertising setups such as web display, e-commerce, social newsfeed, etc. Consider N bidders (i.e. advertisers) participating in M parallel position auctions ( A j ) j ∈ [ M ] , where each auction A j is instantiated by a user keyword search query. An auction A j sells to bidders L j ≥ 1 ad slots that are ordered by visual prominence, or equivalently the likelihood of the user viewing the slot, on the webpage, represented by click-through-rates (CTR) 1 ≥ µ j (1) ≥ µ j (2) ≥ . . . ≥ µ j ( L j ) ≥ 0 , where µ j ( ℓ ) is the likelihood of the user of auction j viewing slot ℓ ∈ [ L j ] (see an intro to position auctions in e.g. (Lahaie et al. 2007, Varian 2007, Edelman et al. 2007)). A bidder i ∈ [ N ] possess a private value-per-click equal to v i,j > 0 for auction A j that represents her perceived value conditioned on the user viewing her ad, so her attained utility for winning slot ℓ ∈ [ L ] is µ j ( ℓ ) · v i,j . In the following subsection 2.1 we present an overview for position auction mechanisms; in subsection 2.2 we describe bidder objectives and actions; and finally in subsection 2.3 we introduce definitions regarding bidder individual welfare guarantees.",
  "2.1. Preliminaries for a single position auction": "A (possibly randomized) position auction A with L ≥ 1 slots is characterized by a tuple ( X , P , µ ) , where X is an allocation rule, P is a payment rule, and CTRs µ =( µ ( ℓ )) ℓ ∈ [ L ] ∈ [0 , 1] L that satisfies 1 ≥ µ (1) ≥ µ (2) >... ≥ µ ( L ) ≥ 0 . Let N bidders with private value per-clicks v =( v i ) i ∈ [ N ] participate in auction A by submitting a bid profile b = ( b i ) i ∈ [ N ] ∈ R N + , and we describe the payment and allocation rules as followed: The allocation rule X : R N + →{ 0 , 1 } N × L maps bid profile b ∈ R N + to an outcome x = X ( b ) ∈ { 0 , 1 } N × L which may possibly be random. The entry x i,ℓ =1 if bidder i is allocated slot ℓ ∈ [ L ] , and 0 otherwise. Here, each slot ℓ is at most allocated to one bidder so ∑ i ∈ [ N ] x i,ℓ ≤ 1 for any ℓ . Further, under outcome x ∈ { 0 , 1 } N × L , bidder i who has value v i attains a total welfare of W i ( x ) = v i ∑ ℓ ∈ [ L ] µ ( ℓ ) x i,ℓ . That is, if bidder i is allocated slot ℓ ∈ [ L ] (i.e., x i,ℓ =1 ), her welfare is W i ( x ) = µ ( ℓ ) v i . The payment rule P : R N + → R N + maps bids b to payments P ( b ) ∈ R N + where P i ( b ) is the payment of bidder i . In this work, we focus on the class of auctions that are ex-post individual rational (IR), i.e. the payment for any bidder is less than her submitted bid, or mathematically P i ( b i , b -i ) ≤ b i for any b -i ∈ R N -1 + . We note that the classic VCG, GSP and GFP auctions are 6 ex-post IR. Further, we assume bidders who submit a 0 bid value will not be allocated any slots and incur no payment. Having introduced general position auction allocation and payment rules, in the following we define three special auction classes, namely truthful auction (Definition 2.1), allocation anonymous auctions (Definition 2.2), and personalized reserve augmented allocation anonymous auctions (Definition 2.3). Definition 2.1 (Truthful auction) Consider position auction A =( X , P , µ ) where we recall X , P are possibly random allocation and payment rules, and µ ∈ [0 , 1] L are CTRs. Then we say the auction is truthful if for any bidder i ∈ [ N ] , her value v i ∈ argmax b ≥ 0 E [ W i ( X ( b, b -i )) -P i ( b, b -i )] for any competing bid profile b -i , where the expectation is taken w.r.t. possible randomness in ( X , P ) , and recall welfare W i ( x ) = v i ∑ ℓ ∈ [ L ] µ ( ℓ ) x i,ℓ with x = X ( b, b -i ) . Note that the well-known VCG auctions is truthful. In truthful auctions it is a weakly dominant strategy for a bidder to bid her true value when her objective is to maximize quasi-linear utility. In the next Subsection 2.2 we study bidders whose objectives are not necessarily quasi-linear, so that truthful bidding is no longer weakly optimal in truthful auctions. We next define allocation-anonymous auctions, in which if two bidders swap their bids, the probability of each bidder winning any slot will also be swapped, or in other words, the outcome of the position auction only depends on solicited bid values, and independent of bidders' identity. Definition 2.2 (Allocation anonymous auctions) Consider position auction A =( X , P , µ ) and any permutation σ : [ N ] → [ N ] of { 1 . . . N } , as well as the permuted bid profile b ′ =( b σ ( i ) ) i ∈ [ N ] . Let x = X ( b ) , x ′ = X ( b ′ ) be the (possibly random) outcomes under b , b ′ , respectively. Then, we say X is allocation anonymous if for any bidder i ∈ [ N ] and slot j ∈ [ L ] , we have P ( x σ ( i ) ,j =1)= P ( x ′ i,j =1) . The classic VCG, GSP, and GFP are all allocation anonymous. The following presents an illustrative example of allocation-anonymity for GSP. Example 2.1 (Example for allocation anonymous auctions) Consider a single GSP auction with 2 slots and 3 bidders who submitted a bid profile b =(0 . 1 , 0 . 2 , 0 . 3) . As GSP allocates slots by ranking bidders' submitted bids, the outcome under bid profile b is x =   0 , 0 0 , 1 1 , 0   . Next, consider some permutation σ that maps { 1 , 2 , 3 } to { 3 , 1 , 2 } . That is, σ (1) = 3 , σ (2) = 1 and σ (3) = 2 . Under this permutation, the corresponding permuted bid profile b ′ =(0 . 3 , 0 . 1 , 0 . 2) , which results in the outcome x ′ =   1 , 0 0 , 0 0 , 1   . Then, it is easy to check that P ( x σ ( i ) ,j =1)= P ( x ′ i,j =1)= { 1 if ( i, j ) = (1 , 1) or (3 , 2) 0 otherwise . In particular, because σ (1) = 3 we have P ( x 3 , 1 =1)= P ( x ′ 1 , 1 =1)=1 , and because σ (3) = 2 we have P ( x 2 , 2 =1)= P ( x ′ 3 , 2 =1)=1 . 7 Finally, we describe augmenting allocation anonymous auctions with personalized reserves.",
  "Definition 2.3 (Personalized-reserve augmented allocation anonymous auctions) Fix": "position auction A =( X , P , µ ) , and some vector of personalized reserve prices r ∈ R N + where r i is the reserve price for bidder i ∈ [ N ] . Then, the augmented auction is A ′ =( X ′ , P ′ , µ ) whose payment X ′ and allocation P ′ are characterized via the following procedure for any bid profile b ∈ R N + : · X ′ : Define bid profile b ′ =( b i · I { b i ≥ r i } ) i ∈ [ N ] . Then X ′ ( b ) = X ( b ′ ) . 1 · P ′ : If i ∈ [ N ] is not allocated a slot under outcome X ′ ( b ) , P ′ i ( b ) = 0 . Otherwise, let ℓ i ∈ [ L ] be the slot allocated to bidder i under X ′ ( b ) . Then, P ′ i ( b ) = max {P i ( b ′ ) , µ ( ℓ i ) · r i } . Recall that a 0 bid will always result in no allocation and 0 payment, so X ′ can be effectively viewed as excluding all bidders who do not clear their reserves, and implement the allocation rule X with respect to the remaining bidders. We remark in later sections, the personalized reserve prices relevant in this work (based on ML-advice) guarantee all bidders clear their reserves so that no bidders will be excluded from ranking. Finally, we refer readers to Example B.1 for an illustration of augmenting anonymous VCG, GSP, and GFP auctions with personalized reserves.",
  "2.2. Autobidders' objectives and bidding strategies": "In this subsection we describe the scope for bidders' objectives as well as bidding strategies of interest. We recall the setup with N bidders participating in M parallel position auctions ( A j ) j ∈ [ M ] , where v j ∈ R N + are bidders' values in auction A j =( X j , P j , µ j ) (see definitions in Subsection 2.1). We use the following notations for convenience: Let X ( b ) := ( X j ( b ⊤ j )) j ∈ [ M ] . Then, bidder i 's welfare in auction A j namely W i,j ( X j ( b ⊤ j )) , and her total welfare over all auctions namely W i ( X ( b )) , are defined as  1 This allocation is known as an eager implementation of personalized reserve prices, where any high-ranked slots are always allocated before a lower-rank slot gets allocated. There also exists a lazy implementations , where we first rank all bids, and then allocate slots to each bidder following this ranking if the bidder clears her reserve. Note that the lazy implementation may leave 'holes' in allocation, e.g. the first and third slots are allocated while leaving the second slot un-allocated. It will become clear later that all results in this work hold for both eager and lazy implementation of personalized reserve prices. 8 We study the setting where each bidder is subject to a return-on-ad-spent (ROAS) constraint, which requires her total expenditure across all auctions to be less than her total acquired value. 2 Mathematically, fix some competing bid profile b -i ∈ R ( N -1) × M + , the ROAS constraint of bidder i is  Here, the expectation is taken w.r.t. possible randomness in the allocation and payment rules of auctions ( A j ) j ∈ [ M ] . When allocation and payment for ( A j ) j ∈ [ M ] are deterministic (e.g. for VCG, GSP and GFP), we omit the expectation for simplicity. We call a bidder an autobidder when she aims to maximize welfare E [ W i ( X ( b i , b -i ))] subject to the ROAS constraint in Eq. (2). The following proposition states that an autobidder's optimal bidding strategy in truthful auctions, facing any competing bid profile, is uniform bidding : Proposition 2.1 (Uniform bidding is optimal for autobidders in truthful auctions) Let all auctions ( A j ) j ∈ [ M ] be identical truthful auctions (see Definition 2.1), and bidder i ∈ [ N ] is an autobidder who aims to maximize welfare E [ W i ( X ( b i , b -i ))] subject to the ROAS constraint in Eq. (2) for any fixed competing bids b -i ∈ R N -1 + . Then, there exists some constant uniform multiplier α ∗ i ≥ 1 s.t. the uniform bidding profile α ∗ i v i is i 's optimal strategy:  Further, adopting any uniform bid multiplier α i < 1 is weakly dominated by truthful bidding, i.e. E [ W i ( X ( α i v i , b -i ))] ≤ E [ W i ( X ( v i , b -i ))] for any b -i ∈ R N -1 + . This is a well-known result that has been proved and adopted in many related works such as Aggarwal et al. (2019), Deng et al. (2021), Balseiro et al. (2021a), Mehta (2022) and we will omit the proof here. We remark that autobidding represents advertisers' conversion maximizing behavior while respecting constraints on spend. We note that our methodologies and insights in the paper can be extended to autobidders with a more general private costs objective E [ W i ( X ( b i , b -i ))] -ρ E [ P i ( b i , b -i )] where ρ ≥ 0 is some private cost, but for simplicity we assume in the rest of the paper ρ =0 . In light of this proposition, we will assume that all autobidders will adopt bid multiplier at least 1 in truthful auctions. Finally, we conclude by introducing the notion of feasible bid profiles: 2 A more general concept related to ROAS is return-on-investment (ROI) , where each bidder i has a target ROI ratio T i such that her constraint in Eq. (2) is instead written as W i ( X ( b i , b -i )) ≥ T i · ∑ j ∈ [ M ] p i,j ; see e.g. Golrezaei et al. (2021b,a). In this paper, since we study worst-case instances, we can scale all bidder i 's values by T i so it is without loss of generality to consider ROAS constraints. 9 Definition 2.4 (Feasible bid profiles) For a given set of parallel auctions ( A j ) j ∈ [ M ] , we say that a bid profile b ∈ R N × M + is feasible if Eq. (2) holds for all bidders, and denote all feasible bid profiles as F . Further, fix a bidder i and her bids b i ∈ R M + . Then let F -i ( b i ) = { b -i ∈ R ( N -1) × M + : ( b i , b -i ) ∈F} . 3 In words, F -i ( b i ) is all competing bid profiles for bidder i that guarantee all bidders' ROAS constraints are satisfied. It is easy to see that in ex-post IR auctions, any bidder can satisfy her ROAS constraint by simply bidding truthfully, since a bidder's payment is always no greater than her submitted bid. This implies that the feasible set of bid profiles F is never empty and contains the truthful bid profile.",
  "2.3. Efficient auction outcomes and individual welfare guarantees": "Let ℓ ∗ i,j be the ranking of bidder i in auction A j when ranked according to true values v j ∈ R N + . Then we call the outcome x ∗ =( x ∗ j ) j ∈ [ M ] with x ∗ i,ℓ,j = I { ℓ = ℓ ∗ i,j } , the efficient outcome . Note that x ∗ yields the largest total welfare because allocation of slots in each auction follows ranking of bidder true values for that auction. Similar to our definition for welfare for any outcome in Eq. (1), let  be the welfare of bidder i in auction j , total welfare contribution of bidder i , and total welfare, respectively, under the efficient outcome. Here we let µ j ( ℓ ) = 0 for all ℓ > L j . Despite truthful bidding is always feasible (see Definition 2.4 for feasible bid profiles and discussions on truthful bidding thereof), autobidders may not necessarily bid truthfully (even in truthful auctions) due to the presence of ROAS constraints, and instead adopt arbitrary strategies to optimize personal welfare which may deviate real auction outcomes from the efficient outcome. For certain individual bidders. Such deviations can potentially lead to significant welfare losses compared to the welfare she would have attained under the efficient one, whereas some other bidders may be significantly better off. These biases are not only largely unfavorable to bidders, but also to auction platforms as they may incentivize bidders to leave the platforms. It is thus important for auction platforms to characterize to what extent the auctions can provide individual welfare guarantee, and better understand how individual welfare relates to advertiser strategies. In the following Definition 2.5, we present a individual welfare metric that measures how much a bidder's realized welfare can fall short from the welfare she would have obtained in the efficient outcome if she adopts a certain strategy. 3 Here, we exclude the trivial zero bid profiles in the sets F and F -i ( b i ) . 10 Definition 2.5 ( δ -approximate) Fix a bidder i ∈ [ N ] and her bids b i ∈ R M + . Then we say auctions ( A j ) j ∈ [ M ] are δ -approximate for some δ ∈ [0 , 1] and any bidder i ∈ [ N ] if  where F -i ( · ) is defined in Definition 2.4, the total welfare W i under outcome X ( b ) is defined in Eq. (1) , and the expectation is taken w.r.t. possible randomness in the allocation and payment rules of auctions ( A j ) j ∈ [ M ] . The above individual welfare metric provides a quantitative answer to the following question: fixing a bid profile b i for bidder i , among all outcomes induced by competing bid profiles b -i ∈F -i ( b i ) that ensure every bidders' ROAS constraint is satisfied (see Definition 2.4), what proportion of the welfare under the efficient outcome can be retained under the worst case outcome? We remark that under this interpretation, our individual welfare metric is reminiscent of the notion of price of anarchy (POA) which measures the worst-case total welfare achieved amongst all equilibrium compared to the optimal total welfare (see e.g. Roughgarden (2015) for a detailed introduction on POA).",
  "3. Incorporating ML advice for bidder values as personalized reserve prices": "With modern machine learning (ML) models and frameworks, online ad platforms can utilize available historical data (e.g. bid logs, keyword characteristics, user profiles, etc.) to produce predictions on autobidders' values (which we refer to as ML advice) ; see e.g. Richardson et al. (2007), Sodomka et al. (2013). In this work, we specifically focus on ML advice that take the form of a lower-confidence bound of true advertiser values. Our key approach to incorporate this type of ML advice in our autobidding setting, is via simply setting personalized reserve prices to be the lower confidence bound for each bidder's value. To motivate this approach, we start with an example.",
  "3.1. Motivating Example": "Consider 2 bidders competing in two (single-slot) second-price auctions (i.e. L 1 = L 2 =1 ) with corresponding CTRs µ 1 (1) = µ 2 (1) = 1 . Bidders' values are indicated in the following table with some v > 0 . Suppose that both bidders are autobidders who adopt uniform bidding strategies (see Proposition 2.1), and in particular, suppose that bidder 1 sets her bid multiplier to be α 1 =1 . Then when her competitor bidder 2 sets a multiplier α 2 > 2 , bidder 2 will win both auctions and acquire a total 11 value/welfare of v 2 , 1 + v 2 , 2 = 3 2 v while submitting a payment of α 1 ( v 1 , 1 + v 1 , 2 ) = v . In this case, bidder 2 satisfies her ROAS constraint and extracts all bidder 1's welfare, leaving her with no value. We also highlight that this bid mulitplier profile constitutes an equilibrium, 4 because bidder 1 cannot raise her bid multiplier to outbid bidder 2 for auction 1, since with α 2 > 2 bidder 1 would violate her ROAS constraint if she bids more than α 2 v 2 , 1 >v . Now suppose that for each value v i,j ( i, j ∈ [2] ), the platform possesses a lower-confidence type of ML advice, namely ( v i,j ) i,j ∈ [ N ] such that βv i,j ≤ v i,j <v i,j for all v i,j > 0 for some β > 1 2 , and sets personalized reserve price r i,j = v i,j . If bidder 2 attempts to win both auctions by setting α 2 > 2 , her payment will be at least max { βv 2 , 1 , α 1 v 1 , 1 } +max { βv 2 , 2 , α 1 v 1 , 2 } = v + βv > 3 2 v , violating her ROAS constraint. Therefore, via setting personalized reserves with ML advice, bidder 1's competitor is prohibited from outbidding her in auction 1, and hence safeguarding bidder 1's welfare. Key takeaway from Example 3.1. The main observation from the above example is that without reserve prices, bidder 2 acquires a large margin for her ROAS constraint by winning auction 2 where payment required to win the auction is low. Therefore, she can raise her bid to outbid bidder 1 in auction 1 without violating her overall ROAS constraint. In other words, bidder 2 can compensate the high expenditure in auction 1 with her acquired value margin in auction 2. By setting personalized reserve prices properly, the platform can increase bidder 2's payment in auction 2, which in turn decreases the manipulative power of bidder 2. More generally, without reserve prices, bidders with large total values across auctions can overbid and consequently manipulate the outcome of certain auctions by compensating the incurring costs with acquired values from other auctions. Therefore, setting personalized reserve prices makes such overbidding behavior more costly, and thus reduces the overall manipulative power of bidders.",
  "3.2. Setting personalized reserve prices using ML advice": "Here, we focus on the following notion of approximate reserve prices with which we can reduce bidders' manipulative power as examplified in Example 3.1. Definition 3.1 ( β -accurate ML advice and approximate reserve prices) Suppose there exists ML advice ( v i,j ) i,j ∈ [ N ] in the form a lower-confidence bound. If v i,j ∈ [ βv i,j , v i,j ) with some β ∈ (0 , 1) for any bidder i ∈ [ N ] and auction j ∈ [ M ] , we say the ML advice is β -accurate. Further, if the platform sets r i,j = v i,j , we say reserve prices r are β -approximate. 5 4 At an equilibrium bid multiplier profile, every bidder best responds to other bidders' bid multipliers while maintaining ROAS constraint satisfaction. 5 Note that any β -approximate reserve prices are also β ′ -approximate if β ′ <β . 12 The gap between the lower bound βv i,j and the true value v i,j in Definition (3.1) represents the inaccuracies of the platform's ML advice. In other words, β can be perceived as a quality measure of the platform's ML advice for advertiser value, such that larger β represents better advice quality. Further, ML-advice in online advertising settings generally concerns predicting advertiser values with historical conversion data and produces confidence intervals of advertiser values (see e.g. Shrestha and Solomatine (2006), Braga et al. (2007), Jiang et al. (2008), Dai et al. (2020)). We remark that these confidence intervals can be viewed as a special case of the lower-confidence type of ML advice in Definition (3.1): suppose the auctioneers utilize some ML model to predict the true value v i,j of bidder i in auction j , and produce a confidence interval ( v i,j , ¯ v i,j ) ∋ v i,j with v i,j , ¯ v i,j > 0 . The auctioneer can then choose personalized reserve r i,j = v i,j , which is β -approximate for β = v i,j / ¯ v i,j ∈ (0 , 1) because βv i,j <β ¯ v i,j = v i,j = r i,j <v i,j . Furthermore, in Definition 3.1, it is assumed that the ML advice v i,j is a true lower bound on the bidder i 's value in auction j . This assumption can be relaxed by considering the ML advice that are accurate with high probability. Suppose the we possess some prediction ˆ v i,j for v i,j that satisfies | ˆ v i,j -v i,j | <η with high probability (w.h.p) for some known η , then the confidence interval (ˆ v i,j -η, ˆ v i,j + η ) contains v i,j w.h.p. Them, the platform can set personalized reserve r i,j =ˆ v i,j -η . Note that with such personalized reserve prices derived from probabilistic ML-advice, all results in this paper remain valid w.h.p. We conclude with a final remark regarding allocation-anonymous auctions (Definition 2.2). Remark 3.1 We remark that implementing β -approximate personalized reserve prices in allocationanonymous auctions does not impact anonymity, because β < 1 and thus all bidders clear there reserves. Therefore, the outcome with personalized reserves will be exactly the same as that without reserves; recall augmenting allocation-anonymous auctions with personalized reserves in Definition 2.3.",
  "4. Individual welfare guarantees for VCG with ML advice": "In the motivating Example 3.1, we observe that ML advice and corresponding β -approximate reserves allow the parallel auctions to safeguard welfare for individual bidders by increasing payments and consequently limit the manipulative behavior of bidders who face significantly small competition in certain auctions. In this section, through the following Theorem 4.1, we formalize this intuition for the classic VCG auction, and present a quantitative measure for the relationship between overall individual welfare and ML advice when incorporated in the form of approximate reserves. Theorem 4.1 (Individual welfare lower bound for VCGs with β -approximate reserves) Consider the setting where ( A j ) j ∈ [ M ] are VCG auctions, and personalized reserve prices r are 13 β -approximate as in Definition 3.1. Fix an autobidder i ∈ [ K ] who adopts bid multiplier α i > 1 (see Proposition 2.1) so b i = α i v i . Then, the individual welfare guarantee in Definition 2.5) is bounded as:  ̸ where F -i ( · ) is defined in Definition 2.4, and OPT -i = ∑ j = i OPT j . 6 Details on implementation of VCG with personalized reserve prices can be found in Definition 2.3 and Example B.1. We defer our proof for Theorem 4.1 to Section 4.1, and here we provide some intuition for the individual welfare bound in the theorem. In light of our interpretation for the individual welfare metric in Definition 2.5, Theorem 4.1 states that at some bid multiplier α i , among all outcomes induced by competing bid profiles (possibly arbitrary non-uniform bidding profiles) that ensure every bidders' ROAS constraint is satisfied, in the worst case outcome, bidder i can retain at least a 1 -1 -β α i -1 · OPT -i OPT i portion of the welfare she would have obtained under the efficient outcome. We also remark that this individual welfare bound is very general since it does not impose any assumptions on competing bidders' bidding strategies and concerns any feasible general bid profiles under which bidders' ROAS constraint is satisfied. In other words, even if bidder i 's competing bidders optimize arbitrary objectives through complex bidding strategies, Theorem 4.1 holds valid as long as the resulting bid profile is feasible. The key message from Theorem 4.1 is that with more accurate ML advice (i.e. larger β ), auctions can set larger approximate reserves, and hence improve individual welfare guarantees for each individual bidder. We also provide some intuition for the term 1 -β α i -1 OPT -i OPT i in the bound. Increasing β (i.e. increasing reserve prices via improving ML quality) or increasing the bid multiplier α i , raises the cost for competitors to outbid bidder i in certain auctions, and hence makes it more difficult to cover her expenditures that arise from significant overbidding. This reduces competitors' manipulative power, and in turn improves the welfare guarantees for bidder i . Note that this aligns with the intuition we obtained in Example 3.1. On the other hand, OPT i OPT -i can be perceived as the relative market share of bidder i w.r.t. competing bidders. Our result shows that with a small market share, the bidders become vulnerable to manipulative behavior of others, resulting in low individual welfare guarantees. The following Corollary 4.2 presents a sufficient condition for the ML advice accuracy to achieve some predesignated level of individual welfare, whereas the following Theorem 4.3 states the individual welfare bound in Theorem 4.1 is tight; see Appendix C.1 for corresponding proofs. 6 We remark that the individual welfare lower bound in Theorem 4.1 applies only to bidders whose welfare under the efficient outcome is nonnegative, i.e. OPT i > 0 . 14 Corollary 4.2 (ML advice accuracy level to achieve δ -approximation of individual welfare) Let ( A j ) j ∈ [ M ] be VCG auctions, and assume all bidders adopt uniform bidding strategies with bid multipliers ( α i ) i ∈ [ N ] ∈ (1 , ∞ ) N , where we denote α =min i ∈ [ N ] α i > 1 . Then, with β accurate ML advice such that β ≥ 1 -(1 -δ ) · ( α -1) · min i ∈ [ K ] OPT i OPT -i , the auctions ( A j ) j ∈ [ M ] are δ -approximate for all bidders. Theorem 4.3 (Matching individual welfare lower bound) For any β ∈ (0 , 1) , α> 1 , and R ≥ 1 -β α -1 , there exists values v ∈ R N × M + and β -approximate reserves r ∈ R N × M + , such that there is a bidder i with multiplier α i = α and relative market share OPT i OPT -i = R , who has an individual welfare guarantee min b -i ∈F -i ( α i v i ) W i ( X ( b )) OPT i = 1 -1 -β α i -1 · OPT -i OPT i . We conclude by comparing our individual welfare result in Theorem 4.1 with related results in the literature: we point out that although our autobidding setup described in Section 2 and the notion of approximate reserves (Definition 3.1) are the same as those in Deng et al. (2021), Balseiro et al. (2021a), our analyses and proof techniques are different, primarily because we focus on the welfare guarantees for individual bidders, where as Deng et al. (2021), Balseiro et al. (2021a) investigates total welfare for all bidders. In particular, in our proof we fix a bidder i and carefully analyze the amount of expenditure that could be covered by each competitor who outbids bidder i in auctions where i has the highest value, whereas the aforementioned related works takes an aggregate view to lower bound total welfare of all bidders; see more details in the next subsection 4.1. Nevertheless, Balseiro et al. (2021a) shows that approximate reserves improve the total welfare of all bidders, and therefore along with Theorem 4.1, we can see that incorporating β -accurate ML advice as approximate reserves not only benefits total welfare, but also enhances individual welfare.",
  "4.1. Proof for Theorem 4.1 and a tighter individual welfare guarantee": "In this subsection, we first present the proof for the individual welfare lower bound in Theorem 4.1. From the proof, we further motivate a stronger individual welfare lower bound that depends on the total welfare of at most min { M,N -1 } of bidder i 's competitors, instead of OPT -i which sums up the welfare of all N -1 of bidder i 's competitors and can potentially be enormous due to large N . We will later remark that this strengthened bound, despite its improvement to the bound in Theorem 4.1, may be difficult to compute in practice. 4.1.1. Proof for Theorem 4.1 First, to prove Theorem 4.1, we rely on the definition of an advertisers' loss in welfare compared to her welfare contribution under the efficient outcome, formally defined as followed: 15 Definition 4.1 (Welfare loss w.r.t. efficient outcome) For any bidder i ∈ [ N ] and outcome x =( x j ∈{ 0 , 1 } N × L j ) j ∈ [ M ] , let L i ( x ) = { j ∈ [ M ] : W i,j ( x ) < OPT i,j } be the set of auctions in which bidder i 's acquired welfare is less than that of her welfare under the efficient outcome. Then, we define the welfare loss of bidder i under outcome x w.r.t. the efficient outcome x ∗ as:  Remark 4.1 For any outcome x , let ℓ i,j be the position (i.e. ranking) of bidder i in auction j , and recall that ℓ ∗ i,j is the position of bidder i in auction j under the efficient outcome x ∗ . Then, the set L i ( x ) = { j ∈ [ M ] : W i,j ( x j ) < OPT i,j } (where W i,j ( x j ) is bidder i 's welfare in A j as defined in Eq. (1) ) can also be interpreted as the set of auctions where bidder i 's ranking under x is lower than her ranking under x ∗ , or in other words the set of auctions that incur a welfare loss w.r.t. x ∗ . Hence we can also rewrite L i ( x ) = { j ∈ [ M ] : ℓ i,j >ℓ ∗ i,j } . The following proposition connects the notion of welfare loss (as in Definition 4.1) and individual welfare (as in Definition 2.5) by showing an upper bound on welfare loss can be directly translated into a welfare lower bound that corresponds to our individual welfare guarantee. Proposition 4.4 (Translating loss to individual welfare guarantee) Assume for bidder i ∈ [ N ] and outcome x =( x j ∈{ 0 , 1 } N × L j ) j ∈ [ M ] we have loss i ( x ) ≤ B for some B> 0 . Then, W i ( x ) OPT i ≥ 1 -B OPT i . The proof of this proposition is presented in Section C.2. Now, in light of this proposition, we proceed to prove Theorem 4.1 by bounding bidder i 's welfare loss for auctions where she obtains a slot that is lower in position than what she would have obtained under the efficient outcome. Proof of Theorem 4.1. Fix any feasible competing bid profile b -i ∈F -i ( α i v i ) under which every bidders' ROAS constraint is satisfied; see Definition 2.4. Denote the corresponding outcome as x = X ( b ) , and ℓ k,j , ℓ ∗ k,j to be the position of any bidder k ∈ [ N ] in auction j ∈ [ M ] under outcome x and the efficient outcome, respectively. Consider any auction j ∈L i ( x ) = { j ∈ [ M ] : ℓ i,j >ℓ ∗ i,j } (see Remark 4.1), i.e. in auction A j , bidder i acquires a position (under x ) bellow her position in the efficient outcome x ∗ . This implies there must exist competing bidders in auction A j whose values are smaller than that of bidder i 's, but obtains a better position, making bidder i lose welfare. Motivated by this, we let B i ( k ; x ) denote the set of all auctions in which bidder k 's value is lower than i 's but acquires a better position than i :  16 where we recall OPT i,j is the welfare of bidder i in auction j under the efficient outcome. Further, we can find a collection of i 's competitors whose B i ( · ; x ) 'covers' all auctions L i ( x ) in which i loses welfare. We call this collection of competitors a covering, and formally define the collection of all coverings, called C i ( x ) , as followed:  Here, for any set S , we say S 1 . . . S n a maximal set cover of S if S ⊆ ⋃ n ′ ∈ [ n ] S n ′ but S ⊊ ⋃ n ′ ∈ [ n ] S n ′ / S n ′′ for any n ′′ ∈ [ n ] . In words, B i ( k ; x ) is the set of auctions in which bidder k has a smaller value than bidder i but acquires a better position, and any C ∈ C i ( x ) is a subset of i 's competitors who are responsible for all welfare losses of bidder i in auctions of L i ( x ) . Fix any covering C ∈ C i ( x ) , and some bidder k ∈C . We first state the following inequality that bounds the welfare loss of bidder i caused by competitor k ∈C in the covering (we will prove this inequality later).  Summing the above over all competitors k ∈C , we have  Here, in (a) we used the fact that L i ( x ) ⊆ ⋃ k ∈C B i ( k ; x ) (see Eq. (8)); in (b) we applied Eq. (9); (c) follows from OPT ≥ ∑ i ∈ [ N ] W i ( x ) where OPT is the total efficient welfare and ∑ i ∈ [ N ] W i ( x ) is the total welfare under outcome x , so further  17 where in (e) we used the fact that W i,j ( x ) ≥ OPT i,j in any auction j ∈ [ M ] / L i ( x ) . Finally, applying Proposition 4.4 w.r.t. upper bound of loss i ( x ) , and noting that the feasible competing bid profile is arbitrary, we obtain the desired welfare guarantee lower bound. Now, it remains to prove Eq. (9) that bounds the welfare loss of bidder i caused by competitor k ∈C in the covering. Denote p k,j as the payment of bidder k , and ˆ b ℓ,j as the ℓ th largest bid in any auction j ∈ [ M ] . Then in some auction j ∈B i ( k ; b ) recall from Eqs. (7) and (8) that v k,j <v i,j but ℓ k,j ≤ ℓ ∗ i,j <ℓ i,j . Thus bidder k 's payment is lower bounded as  Here , (a) follows from the VCG payment rule (see Example B.1); (b) follows from the fact that bidder i 's ranking is ℓ i,j , so any bidder who is ranked before position ℓ i,j submits a bid greater than bidder i 's bid b i,j = α i v i,j , i.e. ˆ b ℓ,j ≥ b i,j = α i v i,j >v i,j for any ℓ ≤ ℓ i,j . On the other hand, we have   where the first inequality follows from bidder k 's ROAS constraint; the second inequality follows from the fact that any winning bidder's payment must be greater than her β -approximate reserves. Combining the above inequalities and rearranging we get  18 Summing Eq.(12) over all j ∈B i ( k ; b ) and combining with Eq. (13), we get  In (a), we used the fact that β ∈ (0 , 1] and v k,j -v i,j < 0 for any k ∈C ⊆C i ( x ) ; see definition of C i ( x ) in Eq. (8); and (b) follows from ℓ k,j ≤ ℓ ∗ i,j for any k ∈C ⊆C i ( x ) . Rearranging terms we obtain the desired Eq. (9). □ 4.1.2. A tighter individual welfare guarantee We recognize that the individual welfare lower bound guarantee in Theorem 4.1, namely 1 -1 -β α i -1 · OPT -i OPT i , may be negative and hence meaningless for a small advertiser, i.e. advertiser i whose market share OPT i OPT -i is very small which may be a result of a very large number of bidders N . Nevertheless, in light of the proof above for Theorem 4.1, we can in fact present a tighter individual welfare guarantee that replaces OPT -i in the numerator, i.e. total welfare summed over N -1 competitors of bidder i , by the total welfare of a potentially much smaller subset of bidder i 's competitors. Analogous to the definitions L i ( x ) , B i ( k ; x ) and C i ( x ) for any outcome x defined in Definition 4.1, Eqs. (7) and (8), respectively, we slightly abuse notation and define their outcome-independent counterparts.  where we recall OPT i,j is the welfare of bidder i in auction A j under the efficient outcome as defined in Eq. (4). In words, L i is the set of auctions in which bidder i can potentially lose welfare, B i ( k ) is the set of auctions in which competitor k can potentially cause i to lose welfare, and any covering of competitors C ∈ C i can potentially cause i to lose welfare in all auctions of L i . We remark that C i only depends on bidder values ( v i,j ) i ∈ [ N ] ,j ∈ [ M ] , and it is easy to see that any covering ˜ C ∈ C i has cardinality at most min { M,N -1 } . To exemplify the covering set C i , consider an instance consisting of 2 single slot VCG auctions (i.e. SPA) and 3 bidders with the following advertiser values 19 Then under the efficient outcome, bidder 1 wins auctions 1 and 2. However, it may be possible that bidder 2 solely outbids the other bidders to win both auctions 1 and 2, inducing a covering { 2 } for bidder 1; or bidder 2 wins auction 1 while bidder 3 wins auction 2, inducing a covering { 2 , 3 } for bidder 1. Therefore, the covering set C i = {{ 2 } , { 2 , 3 }} . The following proposition states that any covering C ∈ C i ( x ) that contributes to all bidder i 's welfare loss under x , must be a subset of an element of the set C i . Proposition 4.5 Let x be any outcome and denote C i ( x ) be the corresponding set of coverings defined in Eq. (8) . Then, for any covering C ∈ C i ( x ) , there must exist an ˜ C ∈ C i such that C ⊆ ˜ C , where C i is defined in Eq. (14) . In the following theorem, we present a tighter individual welfare guarantee than that of Theorem 4.1 by replacing OPT -i with the welfare of some covering for bidder i , which may potentially be a very small subset of all bidder i 's competitors that includes at most min { M,N -1 } bidders. Theorem 4.6 Consider ( A j ) j ∈ [ M ] are VCG auctions, and personalized reserve prices r are β -approximate as in Definition 3.1. Fix an autobidder i ∈ [ K ] who adopts bid multiplier α i > 1 (see Proposition 2.1) so b i = α i v i . Then, the individual welfare guarantee in Definition 2.5) is bounded as:  where F -i ( · ) is defined in Definition 2.4, v ˜ C =( v k ) k ∈ ˜ C , and X ( v ˜ C , 0 ) is the outcome when bidders in covering ˜ C bid truthfully while others bid 0; equivalently, this is the total efficient welfare when participation in all auctions are restricted to bidders in ˜ C only. Proof. Let b ∈F be any feasible bid profile, and let x = X ( b ) be the corresponding outcome. Also, let C i ( b ) be the set of coverings defined in Eq. (8), and consider any C ∈ C i ( x ) . In Eq. (10) within the proof of Theorem 4.1, we showed loss i ( x ) ≤ 1 -β α i -1 ∑ k ∈C W k ( x ) , so  20 where in (a) we let ˜ C ∈ C i defined in Eq. (14) such that C ⊆ ˜ C according Proposition 4.5. Rearranging and applying Proposition 4.4 yields the desired lower bound. □ We conclude by making the remark that although the individual welfare lower bound in Theorem 4.6 may potentially be stronger that in Theorem 4.1, it comes at the cost of significantly increased computational complexity due to the maximum over all coverings. Nevertheless, this improved bound may still be practical for instances with relatively small number of auctions, since the cardinality of any covering is upper bounder by the number of auctions.",
  "4.2. Applicability of the individual welfare guarantee when all bidders bid uniformly": "We recognize that as the individual welfare lower bound in Theorem 4.1 monotonically increases in the bid multiplier α i , it is tempting for bidder i to apply a very large multiplier α i . Nevertheless, in this section we describe a potential tradeoff between large multipliers (i.e. better individual welfare guarantees in light of Theorem 4.1) and ROAS feasibility in the practical scenario where all bidders are autobidders and adopt uniform bidding. ̸ ̸ To illustrate, we see that for large multiplier α i , the set of competing bids F -i ( α i v i ) may only include very small bid values (e.g. the bid profile where each competing bidder (under)bids some small ϵ > 0 close to 0 in each auction), at which bidder i faces nearly no competition so that the ROAS constraint can be trivially satisfied for every bidder. In light of this discussion, we consider a more practical scenario where all competing bidders are also autobidders and adopt uniform bidding, or equivalently, a refinement of F -i ( α i v i ) in which each competing bidder j = i , similar to bidder i , also adopts uniform bidding with bid multiplier α j ≥ 1 . We define F u -i ( b i ) = F -i ( b i ) ∩{ ( α j v j ) j = i : α j ≥ 1 } that represents the set of uniform competing bids for bidder i that ensure ROAS constraint satisfaction for every bidder. From Theorem 4.1, it is easy to see  where (i) follows from min b -i ∈F u -i ( α i v i ) W i ( X ( b )) OPT i ≥ min b -i ∈F -i ( α i v i ) W i ( X ( b )) OPT i because F u -i ( α i v i ) ⊆ F -i ( α i v i ) . Nevertheless, in light of Eq. (15), when all bidders bid uniformly, an excessively large α i may let bidder i incur large payments that significantly exceed her values, resulting in non-existence of competing uniform bids b -i that can ensure satisfaction of every bidders' ROAS constraints, i.e. F u -i ( α i v i ) being empty. In other words, there exists a tradeoff between large multipliers (i.e. better individual welfare guarantees) and ROAS feasibility when all bidders bid uniformly. The following Lemma 4.7, along with a technical definition of 'well-separated' values per Definition 4.2, addresses this tradeoff by characterizing how large the multiplier α i can be set that still ensures the existence of uniform competing bids within F u -i ( α i v i ) . 21 Definition 4.2 ( ∆ -separated values) We say values v ∈ R N × M ≥ 0 are ∆ -separated for some ∆ > 1 if any value v i,j is at least ∆ times as much as any value that is less than v i,j in the same auction j , i.e. v i,j ≥ ∆ · max { v k,j : k ∈ [ N ] , v k,j <v i,j } for any bidder i and auction j . 7 ̸ Lemma 4.7 (Valid regions for uniform bid multiplier) Let ( A j ) j ∈ [ M ] be VCG auctions and assume bidders values are ∆ -separated (Definition 4.2) in every auction for some ∆ > 1 , then F u -i ( α i v i ) = ∅ for any α i ∈ [1 , ∆) . ̸ The proof of this lemma is presented in Appendix C.3. We also remark that the upper bound ∆ in Lemma 4.7 is sufficient, meaning that there may exist larger values of α i that can ensure the set F u -i ( α i v i ) = ∅ nonempty. To better visualize the structure of F u -i ( α i v i ) , as well as our individual welfare guarantee in Theorem 4.1 and Eq. (15), we present the following example. Example 4.1 Consider 2 bidders bidding in 3 single-slot VCG auctions in which each slot is associated with CTR equal to 1. Bidder values are v 1 =(4 , 3 , 1) and v 2 =(1 , 4 , 3) , while personalized reserves are set to be r i = β v i for β =0 . 7 and i =1 , 2 . It is easy to check that with the presence of personalized reserves, no bidder can significantly overbid and win all auctions (otherwise she will incur large payments and thus violate their ROAS constraints), and therefore each bidder will obtain non-zero value. This aligns with our intuition presented in Sections 3 that states personalized reserves benefit individual welfare. In the left subgraph of Figure 1, we color the region of all pairs of uniform bid multipliers ( α 1 , α 2 ) ∈ [1 , ∞ ) 2 that induce feasible bid profiles ( b 1 , b 2 ) ∈ F , where the blue dotted region corresponds to bid profiles under which bidder 1 wins only A 1 , and the grey vertically-dashed region corresponds to bid profiles under which bidder 1 wins A 1 and A 2 . From this subgraph, we can see that F u -1 ( α 1 v 1 ) = { α 2 v 2 : α 2 ∈ any colored vertical line segments at α 1 } and similarly F u -2 ( α 2 v 2 ) = { α 1 v 1 : α 1 ∈ any colored horizontal line segments at α 2 } . On the right subgraph of Figure 1, for each bidder i =1 , 2 , we plot the individual welfare guarantee 1 -1 -β α i · OPT -i OPT i as well as min b -i ∈F u -i ( α i v i ) W i ( X ( b )) OPT i which is the worst case welfare among all outcomes induced by uniform bid profiles that satisfy both bidders' ROAS constraints. On the left subgraph of Figure 1, we observe that it is easier for bidder 2 to ensure a non-empty feasibility set F u -2 ( α 2 v 2 ) at large α 2 values than bidder 1 to ensure non-empty F u -1 ( α 1 v 1 ) at large α 1 ; e.g. for large α 2 such as α 2 =3 , bidder 1 can take any α 1 ∈ [1 , 1 . 75] , but for large α 1 =3 , bidder ̸ ̸ 7 Definition 4.2 also captures values which are 'additively separated'. In particular, take some d > 0 such that d < min { v i,j : v i,j =0 } and also v i,j -d ≥ max { v k,j : k ∈ [ N ] , v k,j <v i,j } for any bidder i and auction j . Then, by taking ∆ ∈ min v i,j : v i,j =0 { v i,j v i,j -d } , the values are ∆ -separated according to Definition 4.2 because 1 ∆ v i,j ≥ v i,j -d ≥ max { v k,j : k ∈ [ N ] , v k,j <v i,j } for all v i,j . This suggests Definition 4.2 is quite general to capture value separation scenarios. 22 4.0 Bidder 1 wins 41 Bidder 1 wins A1, A2 3.5 3.0 8 25 2.0 15 1.0 1.00 1.25 1.50 1.75 2.00 2.25 2.50 2.75 3.00 Q1 Figure 1 Left: Two colored regions represent uniform bid multipliers ( α 1 , α 2 ) ∈ [1 , ∞ ) 2 that lead to feasible bid profiles ( b 1 , b 2 ) ∈F . Right: Comparison between the individual welfare guarantee of Theorem 4.1, namely 1 -1 -β α i -1 · OPT -i OPT i , and the worst case welfare for each bidder i (normalized by OPT i ) among all feasible bid profiles when both bidders adopt uniform bidding, namely min b -i ∈F u -i ( α i v i ) W i ( X ( b )) OPT i . Wi(X(b)) b-iEF-i(aivi) 1.75 1.50 1.25 1.00 0.75 0.50 0.25 0.00 Q1 2 can only take α 2 ∈ [1 , 1 . 25] . Nevertheless on the right subgraph, we see that bidder 2's realized welfare is much closer to her theoretical lower bound guarantee than that of bidder 1. Therefore this highlights a tradeoff between uniform multiplier feasibility and welfare guarantee.",
  "5. Impossibility result: VCG yields best individual welfare guarantee": "Having presented an individual welfare guarantee in the previous Section 4 that improves according to the platform's ML advice accuracy, a natural question is that for a given level of accuracy β , can one achieve a universally better individual welfare guarantee than that of Theorem 4.1 via considering auction formats other than VCG? In this section, we demonstrate that the answer is negative when we restrict the auction to a broad class of truthful mechanisms (possibly randomized) with anonymous allocations (see Definition 2.2). Here, we again emphasize that truthfulness is w.r.t. quasi-linear utility maximizers (see Definition 2.1). In the following theorem, we show that no allocation-anonymous, truthful auction A when augmented by β -approximate reserves (see Definition 2.3), can universally outperform VCG, i.e. for any A there exists a problem instance in which a bidder has a welfare guarantee at most the individual welfare lower bound for VCG of Theorem 4.1. Theorem 5.1 Let A be any single-slot auction format (with position bias µ =1 ) that is allocationanonymous, truthful, and possibly randomized. Then, there exists an instance of M parallel auctions ( A j ) j ∈ [ M ] of format A , N bidders with values v ∈ R N × M + , β -approximate reserves r ∈ R N × M + , and an autobidder i with multiplier α i > 1 (see Proposition 2.1), such that there is a feasible bid profile 23 b ∈F in which b i = α i v i ∈ R M + that results in the following welfare upper bound for autobidder i : E [ W i ( X ( b ))] E [ OPT i ] ≤ 1 -1 -β α i -1 · E [ OPT -i ] E [ OPT i ] . Here the expectation is taken w.r.t. possible randomness in A . Details on implementation allocation-anonymous auctions with personalized reserve prices can be found in Definition 2.3 and Example B.1. Our proof strategy for Theorem 5.1 is to construct a 'bad' autobidding instance for any auction A of interest that yields low individual welfare for one specific bidder: we show that in this autobidding instance, there is some bidder i who has a welfare upper bound as stated in the theorem. The construction of this bad autobidding instance is motivated by Example 3.1, in which the key source of low welfare for an individual bidder i comes from the fact that competing bidders outbid i in auctions where i 's value is high, and cover their expenditures with value acquired from other auctions where they have no competition. Following this idea, since the bad instance in Theorem 5.1 requires us to maximize individual welfare for a specific bidder i , we can achieve this by having auctions where each of i 's competitors is the only bidder submitting a nonzero bid, and with these 'no-competition' auctions competitors can cover their expenditures for outbidding bidder i in auctions where i 's value is largest. Proof sketch for Theorem 5.1. For any auction A that is allocation-anonymous, truthful and possibly randomized, we consider a 'bad' autobidding instance ( N,M, A , r , v ) where N = K +1 bidders labeled B 1 ...B K , B 0 compete in M =2 K +1 auctions with single-slots for some K ∈ N , and bidders' values are shown in the following table. Reserves are set to be r i,j = βv i,j for some β ∈ (0 , 1) and are β -approximate (see Definition 3.1). Bidder B 0 's multiplier is fixed at α 0 > 1 . In the table, we choose ϵ = O (1 /K 3 ) and suitable parameters ρ, γ, v, y > 0 to satisfy certain conditions, one of which guarantees B 0 's value is the highest in auctions A 1 . . . A K . With the above instance, we consider the specific outcome x where bidders 1 , . . . , K adopt bid multiplier ρ , in which case bidder B 0 has the lowest bid in auctions A 1 . . . A K (since α 0 > 1 . Then, our proof of Theorem 5.1 is to show bidder B 0 can acquire welfare at most the upper bound in Theorem 5.1. The proof consists of 3 parts: (1) Under outcome x , we upper bound bidder B 0 's expected acquired welfare in auctions A 1 ...A K . This acquired welfare should be small, since other bidders are outbidding bidder B 0 in these auctions, by covering their expenditures via the value acquired in auctions A K +1 , ..., A 2 K , respectively. 24 (2) We show that bidder B 0 satisfies her ROAS constraint, which holds valid due to the fact that she is acquiring value in auction A 2 K +1 for suitable y facing no competition. (3) We show that any bidder i ∈ [ K ] satisfies her ROAS constraint. In this part, when we take appropriate parameters ϵ → 0 and ρ → α 0 , we first show that the total expected acquired value of bidder i minus her total expected cost over all 2 K +1 auctions is approximately 1 -∑ j ∈ [ K ] P ( bidder i wins auction j ) + O ( K 2 ϵ ) and since ϵ = O (1 /K 3 ) , we only need to show 1 ≥ ∑ j ∈ [ K ] P ( bidder i wins auction j ) . Our proof for this claim exploits the specific structure of our problem instance construction: we recognize that when bidders 1 , . . . , K use bid multiplier ρ , the bid profiles for auctions A 1 ...A K are a cyclic permutation of the set { b 0 , . . . , b K } = { α 0 v, α 0 v + ϵ, . . . , α 0 v + Kϵ } . Therefore by allocation-anonymity of A , the expected outcome in each of the auctions in A 1 , . . . , A K are symmetric over bidders 1 , . . . , K , or in other words, P ( bidder i wins auction j ) depends only on the bid value of bidder i in auction j . The cyclic structure thus implies  Here, we also point out that any β approximate reserves do not affect allocation in auctions A 1 ...A K , simply because any bid value in { b 0 , . . . , b K } is greater than the largest reserve price among agents, namely βv , since α 0 > 1 >β . In other words, under the specific outcome x , allocation anonymity of any auction in A 1 , . . . , A K is preserved with personalized reserves r i,j = βv i,j due to our construction; see also Remark 3.1. For a technical re-statement of Theorem 5.1 and its proof, please refer to Appendix D.2. 6. Extensions: Individual welfare guarantees for GSP and GFP with ML advice In this section, we extend our individual welfare guarantees for the VCG auction in Theorem 4.1 to the GSP and GFP auctions, which are both non-truthful. For technical purposes, we assume that bidder values are 'well-separated' as defined in Definition 4.2. Further, as discussed in Section 2.2, uniform bidding (i.e. setting the same bid multiplier for all auctions) is only optimal in truthful auctions. In GSP and GFP, one can construct instances where non-uniform bidding strictly outperforms uniform bidder (for more details see e.g. Deng et al. (2019)). Thus, for GSP and GFP autobidding instances, we impose no assumptions on the bid values of bidders other than being undominated: we say a bid value b i ∈ R M + is undominated for bidder i if there is no other bid value b ′ i ∈ R M + that strictly outperforms b i in welfare under all competing bid profiles. Mathematically, ∄ b ′ i ∈ R M + such that W i ( X ( b i , b -i )) <W i ( X ( b ′ i , b -i )) for all b -i ∈ R ( N -1) × ( M ) + . The following lemma lower bounds undominated bids in the presence of β -approximate reserves. 25 Lemma 6.1 (Lemma 4.7 & 4.9 of Balseiro et al. (2021a)) Consider the setting where ( A j ) j ∈ [ M ] are all GSP auctions or GFP auctions, and reserve prices r are β -approximate. Denote U ⊆ F to be the set of bid profiles in which each bid is undominated and satisfies all bidders' ROAS constraints. Then for any b ∈U , b i,j must satisfy b i,j ≥ r i,j ≥ βv i,j for any bidder i ∈ [ N ] and auction A j . Finally, our main theorem for this section is the following: Theorem 6.2 Consider the setting where ( A j ) j ∈ [ M ] are all GSP auctions or GFP auctions. Suppose reserve prices r are β -approximate, and values v are ∆ -separated s.t. β > ∆ 2∆ -1 . Consider any undominated bid profile b ∈ U ⊆ F where U is the set of all undominated bids under which every bidder's ROAS constraint is satisfied (see Equation (2)). Then, the individual welfare guarantee (Definition 2.5) is bounded as  Details on implementation of GSP and GFP with personalized reserve prices can be found in Definition 2.3 and Example B.1. The proof for Theorem 6.2 is presented in Appendix E.1. Comparing the individual welfare guarantees in Theorem 4.1 for VCG and Theorem 6.2 for GSP/GFP, we observe when values are ∆ -separated and ML advice is β -accurate, when bidders adopt small enough uniform multipliers in VCG (i.e. α i -1 <β -∆ 2∆ -1 ), GSP/GFP provides a better individual welfare guarantee compared to VCG, whereas for large multipliers (i.e. α i -1 >β -∆ 2∆ -1 ), individual welfare in VCG dominates that in the considered non-truthful auctions.",
  "7. Numerical studies": "Recall in Sections 4 and 6 we theoretically showed that setting personalized reserve prices with ML advice (see Definition 3.1) ensures worst-case welfare guarantees on the individual bidder level in VCG, GSP, GFP auctions, and moreover, such guarantees improves as ML advice becomes more accurate. In this section, we complement this theoretical result for worst case scenarios by showcasing how setting personalized reserve prices with ML advice can safeguard individual welfare in an average sense, using semi-synthetic data derived from real auction data in a search ad platform. We remark that in this section we only experiment with VCG auctions, particularly because bidders' bidding strategies can be restricted to uniform bidding (see Proposition 2.1 and discussions thereafter), whereas computing near-optimal/best response bidding strategies in GSP and GFP auctions introduces an additional dimension of complexity without adding new insights; see discussions in Deng et al. (2021), Balseiro et al. (2021a), Ai et al. (2022). 26",
  "7.1. Experiment procedure": "Data Generation. We derive semi-synthetic data from ad auction logs of a search ad platform with which we simulate VCG auctions for auto bidders. In particular, each entry j of the dataset contains the necessary information to rerun an auction, including the number of ad slots sold L j , the CTRs for each ad slot µ j =( µ j (1) , . . . µ j ( L j )) ∈ [0 , 1] L j , a set of candidates and their respective conversion values v i,j , etc. Here, the conversion value of an advertiser is the perceived monetary value that she would attain due to a user conversion action (e.g. download, email sign-up, in-app purchase etc). We emphasize that the main objective for our empirical study is to validate key insights for our theoretical findings rather than investigating the individual welfare of real systems actually implemented in practice. Generating ML advice. For accuracy level β ∈ { 0 . 25 , 0 . 5 , 0 . 75 } , we sample s β i,j ∼ Uniform [ β, 1] independently for each i, j . We then calculate ML advice v β i,j = s β i,j · v i,j , and it is obvious that the ML advice produced this way is β -accurate, i.e. v β i,j ∈ [ βv i,j , v i,j ] as defined in Definition 3.1. Calculating uniform bid multipliers. Here we describe the procedure to generate bid multipliers for bidders in two scenarios, one with reserve prices set with ML advice we generated earlier, and the other without reserve price which we call the 'control experiment' (for consistency we let β =0 correspond to this no-reserve price setup). We first describe the procedure to generate bid multipliers for the scenario with reserve prices. In particular, we calculate each advertiser's uniform bid multiplier using gradient descent to emulate uniform bidding practices in reality, because descent/primal-dual methods have been widely adopted for real world autobidding and has proven to have near-optimal convergence and performance guarantees (see e.g. Nesterov (2003), Balseiro et al. (2021b), Aggarwal et al. (2019). Formally, for each accuracy level β ∈{ 0 . 25 , 0 . 5 , 0 . 75 } , we run 2 T rounds of gradient descent, where in each round we keep the auction environment, including advertiser values, number of slots and CTRs the same as those we derived from the aforementioned semi-synthetic data. The first T rounds are dedicated to 'warm start' our treatments for reserve prices with different accuracy level: we simulate VCG auctions without reserves until all bidders' uniform bid multipliers convergence. In particular, with an initial uniform bid multiplier α i, 1 for bidder i , for each round t ∈ [ T ] , set advertiser i 's bid multiplier to be α i,t , and run M VCG auctions without reserves, where values are v =( v i,j ) i ∈ [ N ] ,j ∈ [ M ] , ad slot numbers are ( L j ) j ∈ [ M ] and corresponding CTRs are ( µ j ) j ∈ [ M ] . For round t ∈ [ T ] , denoting w i,t and p i,t as the total realized welfare and payment for bidder i across all M auctions, we update the uniform bid multiplier with gradient descent in the log-space (note that a similar approach has been used in Deng et al. (2021), Balseiro et al. (2021a))  27 Here η t are properly chosen step-sizes that ensure convergence within T rounds. Intuitively, when w i,t >p i,t , the per-round ROAS balance for bidder i is positive, so in the next round the bidder would have leeway to bid more aggressively with larger bid multipliers to acquire more welfare. We take the bid-multiplier value α i,T +1 for β ∈{ 0 , 0 . 25 , 0 . 5 , 0 . 75 } to be our initial uniform bid multipliers for treatments of VCG auctions with personalized reserves. For the next T rounds, we repeat the above procedure for running VCG auctions, but with personalized reserve prices r i,j = v β i,j for treatment trials corresponding to β ∈ { 0 . 25 , 0 . 5 , 0 . 75 } , respectively, where we compute ( α β i,t ) i ∈ [ N ] ,t = T +1 ... 2 T according to Eq. (16). Finally, we arrive at our bid multipliers α β i := α β i, 2 T . We repeat the above procedure for our control experiment with no reserve price, and again arrive at bid multipliers α β i := α β i, 2 T for β =0 .",
  "7.2. Experiment results": "For each accuracy level β ∈ { 0 , 0 . 25 , 0 . 5 , 0 . 75 } where we recall β =0 corresponds to the control experiment with no personalized reserve prices, we let W β i be the realized total welfare for advertiser i ∈ [ N ] across M VCG auctions w.r.t. bid multipliers ( α β i ) i ∈ [ N ] , values v =( v i,j ) i ∈ [ N ] ,j ∈ [ M ] , ad slot numbers ( L j ) j ∈ [ M ] and CTRs ( µ j ) j ∈ [ M ] (see details in Subsection 7.1). Figure 2 Empirical cdf defined as θ ( z ; β ) = 1 N ∑ i ∈ [ N ] I { W β i OPT i ≤ z } for all accuracy levels β =0 . 25 , 0 . 5 , 0 . 75 and the control experiment where we set no personalized reserve prices. For fixed z < 1 , the empirical cdf decreases in accuracy level β . As an example when z =0 . 8 , θ ( z =0 . 8; β =0) = 0 . 17 , θ ( z =0 . 8; β =0 . 25) = 0 . 13 , θ ( z =0 . 8; β =0 . 5) = 0 . 11 , and θ ( z =0 . 8; β =0 . 75) = 0 . 08 . 1.0 control ß = 0.5 0.8 2 0.6 0.4 0.17 0.13 0.11 0.2 0.08 0.8 0.0 0.6 1.0 1.2 1.4 28 Recalling OPT i as the welfare of bidder i ∈ [ N ] under the efficient outcome (see Eq. (4)), we define the empirical cdf θ ( z ; β ) = 1 N ∑ i ∈ [ N ] I { W β i OPT i ≤ z } to be the proportion of advertisers whose realized welfare is at most least z times her welfare under the efficient outcome. Note that z can be less or greater than 1, where θ ( z ; β ) for z < 1 is the proportion of advertisers who incur a welfare loss compared to OPT i . In Figure 2, we plot the empirical distribution θ ( z ; β ) for β ∈{ 0 , 0 . 25 , 0 . 5 , 0 . 75 } . We observe that for z < 1 , θ ( z ; β ) decreases as β increases, meaning as we set personalized reserve prices with more accurate ML advice, the proportion of advertisers who lose at least (1 -z ) × 100% of their welfare under the efficient outcome drops. As an example when z =0 . 8 as illustrated in Figure 2 which corresponds to losing at least 20% of the welfare under the efficient outcome, the proportion of bidders who incurs such a welfare loss when β =0 (i.e. no reserve prices) is 17% , and 13% , 11% , 8% for β =0 . 25 , 0.5, 0.75, respectively. The main takeaway is improving ML advice accuracy enables the ad platform to decrease the number of advertisers who incur a certain percentage of welfare loss compared to what would have been attained under the efficient outcome. As another observation, we see that the empirical cdf approaches the step function with a jump at z =1 , which intuitively means that as ML accuracy improves, more and more advertisers will approach their efficient outcome welfare.",
  "References": "Aggarwal G, Badanidiyuru A, Mehta A (2019) Autobidding with constraints. International Conference on Web and Internet Economics , 17-30 (Springer). Ai R, Wang C, Li C, Zhang J, Huang W, Deng X (2022) No-regret learning in repeated first-price auctions with budget constraints. arXiv preprint arXiv:2205.14572 . Balseiro S, Deng Y, Mao J, Mirrokni V, Zuo S (2021a) Robust auction design in the auto-bidding world. Advances in Neural Information Processing Systems 34. Balseiro S, Kim A, Mahdian M, Mirrokni V (2021b) Budget management strategies in repeated auctions. Operations Research Forthcoming. Balseiro S, Kim A, Mahdian M, Mirrokni V (2021c) Budget-management strategies in repeated auctions. Operations Research 69(3):859-876. Balseiro S, Lu H, Mirrokni V (2020) The best of many worlds: Dual mirror descent for online allocation problems. arXiv preprint arXiv:2011.10124 . Balseiro SR, Deng Y, Mao J, Mirrokni VS, Zuo S (2021d) The landscape of auto-bidding auctions: Value versus utility maximization. Proceedings of the 22nd ACM Conference on Economics and Computation , 132-133. 29 30 Golrezaei N, Javanmard A, Mirrokni V (2019b) Dynamic incentive-aware learning: Robust pricing in contextual auctions. Advances in Neural Information Processing Systems 32. Golrezaei N, Lobel I, Paes Leme R (2021b) Auction design for roi-constrained buyers. Proceedings of the Web Conference 2021 , 3941-3952. Indyk P, Mallmann-Trenn F, Mitrovic S, Rubinfeld R (2022) Online page migration with ml advice. International Conference on Artificial Intelligence and Statistics , 1655-1670 (PMLR). Jiang B, Zhang X, Cai T (2008) Estimating the confidence interval for prediction errors of support vector machine classifiers. The Journal of Machine Learning Research 9:521-540. Kanoria Y, Nazerzadeh H (2020) Dynamic reserve prices for repeated auctions: Learning from bids. arXiv preprint arXiv:2002.07331 . Lahaie S, Pennock DM, Saberi A, Vohra RV (2007) Sponsored search auctions. Algorithmic game theory 1:699-716. Lee Kc, Orten B, Dasdan A, Li W (2012) Estimating conversion rate in display advertising from past erformance data. Proceedings of the 18th ACM SIGKDD international conference on Knowledge discovery and data mining , 768-776. Lykouris T, Vassilvtiskii S (2018) Competitive caching with machine learned advice. International Conference on Machine Learning , 3296-3305 (PMLR). McMahan HB, Holt G, Sculley D, Young M, Ebner D, Grady J, Nie L, Phillips T, Davydov E, Golovin D, et al. (2013) Ad click prediction: a view from the trenches. Proceedings of the 19th ACM SIGKDD international conference on Knowledge discovery and data mining , 1222-1230. Mehta A (2022) Auction design in an auto-bidding setting: Randomization improves efficiency beyond vcg. Proceedings of the ACM Web Conference 2022 , 173-181. Munoz A, Vassilvitskii S (2017) Revenue optimization with approximate bid predictions. Advances in Neural Information Processing Systems 30. Nesterov Y (2003) Introductory lectures on convex optimization: A basic course , volume 87 (Springer Science & Business Media). Paes Leme R, Pal M, Vassilvitskii S (2016) A field guide to personalized reserve prices. Proceedings of the 25th international conference on world wide web , 1093-1102. Pai MM, Vohra R (2014) Optimal auctions with financially constrained buyers. Journal of Economic Theory 150:383-425. Richardson M, Dominowska E, Ragno R (2007) Predicting clicks: estimating the click-through rate for new ads. Proceedings of the 16th international conference on World Wide Web , 521-530. Roughgarden T (2015) Intrinsic robustness of the price of anarchy. Journal of the ACM (JACM) 62(5):1-42. 31 Shrestha DL, Solomatine DP (2006) Machine learning approaches for estimation of prediction interval for the model output. Neural networks 19(2):225-235. Sodomka E, Lahaie S, Hillard D (2013) A predictive model for advertiser value-per-click in sponsored search. Proceedings of the 22nd international conference on World Wide Web , 1179-1190. Varian HR (2007) Position auctions. international Journal of industrial Organization 25(6):1163-1178. Wang S, Li J, Wang S (2020) Online algorithms for multi-shop ski rental with machine learned advice. Advances in Neural Information Processing Systems 33:8150-8160. Yang Y, Zhai P (2022) Click-through rate prediction in online advertising: A literature review. Information Processing & Management 59(2):102853. Yuan S, Wang J, Chen B, Mason P, Seljan S (2014) An empirical study of reserve price optimisation in real-time bidding. Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining , 1897-1906. 1",
  "Appendices for": "",
  "Appendix A: Extended Literature Review": "Mechanism design with constrained bidders. This work considers autobidders who aim to maximize welfare while respecting an ROAS constraint that ensures total spend is less than total acquired value, and thus our work relates to the general theme of mechanism design in the presence of constrained agents. The works of Pai and Vohra (2014), Golrezaei et al. (2021b) study revenue-optimal auction design when bidders who maximize quasi-linear utility are constrained by budgets, and return-on-investment (ROI), respectively. Balseiro et al. (2021d) study revenue-maximizing auctions for ROI constrained bidders under different objectives and information structures for values and ROI targets. This work differs from these papers as we do not study new auction formats and platform revenue-optimization, but instead presents insights into how to incorporate ML advice as reserves in classic auctions like VCG, GSP and GFP can improve individual bidder welfare. Algorithmic bidding/learning under constraints The behavior of our bidders of interest are governed by their ROAS constraints, and there has been a growing area of works on bidding-algorithm design under similar financial constraints for online advertising markets. Balseiro et al. (2021b) develops theoretical performance guarantees of the budget pacing strategy for bidders with hard budget cap (see more on budget management strategies in Balseiro et al. (2021c)), while Balseiro et al. (2020) presents a more general mirror descent algorithm for online resource allocation problems. Golrezaei et al. (2021a) present near-optimal bidding algorithms for bidders with both budget and ROI constraints in expectation. Finally, Deng et al. (2023) study a multi-channel ad procurement problem under the autobidding setup where ad platforms, i.e. channels, autobid on behalf of advertisers, and the work develops algorithms that optimizes advertisers' interaction decisions with channels to maximize conversion. In this work, we do not study the design of bidding algorithms but instead consider worst case outcomes under any feasible bidding profile. Reserve price optimization. Reserve price techniques and optimization have been studied for different auction formats and settings. In the single-shot second price auction setting Paes Leme et al. (2016), Beyhaghi et al. (2021), Derakhshan et al. (2022) presents different approaches with theoretical performance guarantees to optimize personalized reserve prices, while Yuan et al. (2014) presents an empirical study on the impact of reserve price on the entire auction system for display advertising. For repeated second price auctions, Golrezaei et al. (2019b,a), Kanoria and Nazerzadeh (2020) dynamically learn reserve prices to maximize cumulative revenue facing strategic agents, where as Feng and Lahaie (2021) optimize reserve prices to balance revenue and bidders' incentives to misreport. For first price auctions, Feng et al. (2021) introduces a gradient-based adaptive algorithm to dynamically optimize reserve prices. Nevertheless, all aforementioned works attempt to design and learn optimal or near optimal reserve prices for the purpose of revenue maximization, whereas in our work we directly set reserves using ML advice provided by some external black-box, and shed light on how reserve prices can improve individual welfare among all bidders. 2",
  "Appendix B: Additional materials for Section 2": "Example B.1 (Personalized-reserve augmented VCG, GSP, GFP auctions) Consider M ≥ 2 parallel position auctions ( A j ) j ∈ [ M ] all of which take the form of VCG, GSP or GFP auctions. Each auction A j is associated with L j ≥ 1 slots and CTRs µ j =( µ j ( ℓ )) ℓ ∈ L j . Assume N bidders submit bid profile b j ∈ R N + to auction A j , where ˜ N j ≤ N are cleared, i.e. greater than respective personalized reserve prices. Define ˜ b j ∈ R ˜ N j + to be all 'cleared bids', and let ˜ b ( ℓ ) j be the ℓ th highest cleared bid. Then, in A j bidders who cleared their reserves are assigned slots according to the ranking of ˜ b j , whereas the bidders who do not clear their reserves never get allocated any slots. The payment for a bidder i who cleared her reserve and allocated slot ℓ i,j ∈ [min { ˜ N j , L j } ] is · VCG: p i,j = ∑ min { ˜ N j ,L j } ℓ = ℓ i,j ( µ j ( ℓ ) -µ j ( ℓ +1) · max { ˜ b ( ℓ +1) j , r i,j } where ˜ b ( ℓ ) j =0 when ℓ > ˜ N j . · GSP: p i,j = µ j ( ℓ i,j ) · max { ˜ b ( ℓ i,j +1) j , r i,j } . · GFP: p i,j = µ j ( ℓ i,j ) · max { ˜ b ( ℓ i,j ) j , r i,j } . It is well known that for the same bid profile b and for any bidder i , the payment under the GFP auction is greater than equal to that under GSP auction, and the payment under the GSP auction is greater than equal to that under VCG; see e.g. Edelman et al. (2007).",
  "Appendix C: Additional materials for Section 4": "",
  "C.1. Proof for Theorem 4.3": "Theorem C.1 (Restatement of Theorem 4.3) Consider 2 bidders competing in three SPA auctions whose values are indicated in the following table for any β ∈ (0 , 1) and y ≥ 0 . Bidder 1's multiplier is fixed to be α 1 > 1 , and consider v = 1 -β α 1 -1 · γ for any γ > 0 . The reserve prices are set to be r i,j = βv i,j . Then, we have  Taking ϵ → 0 shows that bidder 1's welfare is equal to the individual welfare guarantee in Theorem 4.1. Remark C.1 We remark that as ϵ → 0 , OPT -i OPT i = α 1 -1 1 -β v y + v ∈ [ 0 , α 1 -1 1 -β ] , so by varying y ∈ [0 , ∞ ) , the above example demonstrates our individual welfare lower bound in Theorem 4.1 is tight for any nontrivial market share ratio OPT i OPT -i ∈ [ α 1 -1 1 -β , ∞ ) . proof Note that in any feasible outcome, bidder 1 must win auction 1, and bidder 2 must win auction 3. Hence for auction 2, we only need to consider the following outcome: Bidder 1 loses auction 2, and suffers welfare loss v . This outcome can be achieved by setting α 2 such that α 2 ( v -ϵ ) >α 1 v . Bidder 2 accumulates value v + γ + ( 1 1 -β -1 ) ϵ . Her payment for auction 2 is 3 max { α 1 v, β ( v -ϵ ) } , and for auction 3 is β ( γ + 1 1 -β · ϵ ) . The following shows that her ROAS constraint is satisfied:  where in (a) we used the fact β ≤ 1 <α 1 and ϵ → 0 . In the final equality we used the definition that v = 1 -β α 1 -1 · γ . On the other hand, bidder 1's ROAS constraint is apparently satisfied. Under this outcome, denoting bidder 1's welfare as W 1 we have  □",
  "C.2. Proof of Proposition 4.4": "For simplicity, denote δ i,j = OPT i,j -W i,j ( x ) . Then, OPT i -W i ( x ) = ∑ j ∈ [ M ]: δ i,j > 0 δ i,j + ∑ j ∈ [ M ]: δ i,j =0 δ i,j + ∑ j ∈ [ M ]: δ i,j < 0 δ i,j = loss i ( x ) + ∑ j ∈ [ M ]: W i,j ( x ) > OPT i,j ( OPT i,j -W i,j ( x )) ≤ loss i ( x ) ≤ B. Rearranging and dividing both sides by OPT i we get W i ( x ) OPT i ≥ 1 -B OPT i . Here we remark that it is possible to have W i,j ( x ) > OPT i,j because bidders may overbid, and therefore win auctions/slots that they would not have won under the efficient outcome. □",
  "C.3. Proof of Lemma 4.7": "Recall there is ∆ -separation in values. Fix a bidder i and let v + j be the smallest competitor value that is strictly greater than v i,j in any auction A j where bidder i 's value is not the largest, and by definition of ∆ -separated values we have v + j ≥ ∆ v i,j . Hence, by using any multiplier α i ∈ [1 , ∆) and assuming competitors bid truthfully, the outcome of the auctions would be identical to that of everyone (including bidder i ) bidding truthfully. And since truthful bidding is always feasible, we conclude that v -i ∈F u -i ( α i v i ) for α i ∈ [1 , ∆) . □",
  "Appendix D: Additional materials for Section 5": "",
  "D.1. Additional Definitions and Lemmas for Section 5": "The following lemma shows that for anonymous and truthful auctions, the probability of the lowest bidder winning a single auction is capped by a bound that decreases as the number of bidders grow. Lemma D.1 (Lemma 3 in Mehta (2022)) In an anonymous and truthful auction for a single item with N bidders, the bidder who submits the lowest bid wins the item with probability at most 1 N . The following technical definition and lemma (i.e. Definition D.1 and Lemma D.2) concerns the scenario where only one bidder participates in the auction (others bid 0), and present an upper bound on the probability and cost respectively for the single bidder to win the auction. 4 Definition D.1 (Single bidder purchase probability and bid threshold) For any allocationanonymous and truthful auction A , consider the setting with a single bidder who submits bid b > 0 and define  where the limit exists because in a truthful auction, P ( bidder wins item with bid b ) increases in b (see Definition 2.1 for truthful auctions). Assume this max probability is reached at some bid threshold Q A , i.e.  Note that in a deterministic single-slot auction that allocates to the highest bidder, π A =1 , and Q A → 0 . For example, in an SPA with no reserve, the single bidder can win the auction with any arbitrarily small positive bid with probability 1. Lemma D.2 (Lemma 4 in Mehta (2022)) For any allocation-anonymous and truthful auction A with single-bidder purchase probability π A and bid threshold Q A , the expected cost for a single bidder for winning the item is at most π A · Q A .",
  "D.2. Proof of Theorem 5.1": "Theorem D.3 (Restatement of Theorem 5.1) For any auction A that is allocation-anonymous, truthful, and possibly randomized, 8 consider an autobidding problem instance w.r.t. A with M =2 K +1 auctions and N = K +1 bidders. Fix bidder 0's bid multiplier to be α 0 and some β ∈ [0 , 1) . Consider the bidder values { v i,j } i ∈ [ N ] ,j ∈ [ M ] given in the following table. In the table, we let γ > Q A β >Q A , ϵ = O (1 /K 3 ) and v = 1 -β α 0 -1 · π A · γ . Let ρ, y and a large enough K satisfy the following:  8 Here, we assume all auctions of interest are individually rational (IR), i.e. the payment of a bidder is always less than her submitted bid. 5 where Q A , π A are defined in Definition D.1. Further, suppose the platform enforces personalized reference prices r ∈ R N × M + on top of auction A , where r i,j = βv i,j . Then, letting the (possibly random) outcome be x when bidders 1, ... K all adopt the bid multiplier ρ , the ROAS constraints for all bidders are satisfied when K →∞ and ρ → α 0 , and for bidder 0 we have  where E A is taken w.r.t. the randomness in outcome x due to randomness in the auction A . Proof. First note that bidder 0 only has competition in auctions A 1 ...A K , and hence can only incur a loss (that contributes to loss 0 ( x ) defined in Equations (6)) within these auctions. Hence E A [ loss 0 ( x )] = v ∑ j ∈ [ K ] P ( bidder 0 loses auction j ) . Then we consider the following:  Here (a) holds because bidder 0 bids α 0 v for any auction in 1,2...K, which is strictly less than all other bidders' bids as they all adopt multipliers ρ in these auctions, so from Lemma D.1, we have P ( bidder 0 wins auction j ) ≤ 1 K +1 ; in (b) we used the fact that E A [ OPT -0 ] = ∑ 2 K j = K +1 E A [ γ ] = γ · K · π A since there is only a single non-zero bidder in auctions A K +1 . . . A 2 K and each bidder submits a bid ργ > ρ > Q A (see Definition D.1). Therefore we have  where (a) follows from the fact that in our constructed autobidding instance, bidder 0's acquired value in each auction cannot exceed that under the efficient allocation, and hence can only incur loss in welfare. Now it only remains to show that the multiplies ( α 0 , ρ, . . . ρ ) ∈ (1 , ∞ ) K +1 yields a feasible outcome, i.e. the ROI constraints of each bidder is satisfied in expectation. Let V i,j and C i,j be the expected value and cost of bidder i in auction A j , respectively. 1. Showing bidder 0 's ROI constraint is satisfied . We show by the following: bidder 0 only incurs a non-zero expected cost in auctions A 1 . . . A K and A 2 K +1 , and we will show that the expected value V 0 , 2 K +1 is lower bounded by the expected costs C 0 , 2 K +1 + ∑ j ∈ [ K ] C 0 ,j . Since α 0 y > Q A , the definition of the single-bidder purchasing probability in Definition D.1 implies that bidder 0 acquires an expected value from auction A 2 K +1 of V 0 , 2 K +1 = π A y . Further, since bidder 0 is submits the lowest bids in auctions A 1 . . . A K under bid multiplier profile ( α 0 , ρ . . . ρ ) ∈ (0 , ∞ ) K +1 , from Lemma D.1, we have P ( bidder 0 wins auction j ) ≤ 1 K +1 for all j ∈ [ K ] . Since the payment of a bidder in an auction is at most her submitted bid (as the auction is IR), we know that ∑ j ∈ [ K ] C 0 ,j ≤ K · α 0 v K +1 <π A y = V 0 , 2 K +1 , where the inequality follows from the definition of y in Equation (20) such that y > max { Q A α 0 , α 0 v π A } . This implies bidder 0's ROI constraint is satisfied. 2. Showing bidder i 's ROI constraint is satisfied for any i =1 , 2 . . . K . We show this by considering the following: bidder i only incurs a non-zero expected cost in auctions A 1 . . . A K and A K + i , and we will show that the expected values V i,K + i + ∑ k ∈ [ K ] V i,j is lower bounded by the expected costs C i,K + i + ∑ j ∈ [ K ] C i,j . 6 · Calculate cost C i,K + i : For auction A K + i , bidder i 's bid is ργ > γ > Q A from the definition of γ , so by Definition D.1, the probability of i winning the item in auction A K + i is π A , and the expected cost is  where the final inequality follows from the definition r i,K + i = βγ · Upper bound costs ∑ j ∈ [ K ] C i,j : For auctions [ K ] = 1 . . . K , bidder i 's total expected cost can be bounded as  where the first inequality follows from a bidder's payment is at most her submitted bid since the auction is IR. · Calculate V i,K + i : Considering auction A K + i , bidder i is the only bidder, and since ργ > γ > Q A , the definition of the single-bidder purchasing probability in Definition D.1 implies that bidder i 's acquires an expected value from this auction of  · Lower bound ∑ k ∈ [ K ] V i,j :  Combining Equations (24),(25),(26) and (27), we get  , where (a) follows from the definition v = 1 -β α 0 -1 · π A · γ ; In (b) we used the fact that ρ > α 0 > 1 and ∑ j ∈ [ K ] P ( bidder i wins auction A j ) ≤ 1 due to the following: Consider the set of bid values B = { α 0 v, α 0 v + 7 ϵ, α 0 v +2 ϵ . . . α 0 v + Kϵ } ⊆ R > 0 , and we recognize that any bid value b k ∈ B exceeds the maximim reserve price βv in auctions A 1 ...A K . Therefore the constructed reserve prices do not affect allocation, and hence by anonymity of auction A there exists probabilities q ( B ) = ( q 0 ( B ) , q 1 ( B ) . . . q K ( B )) ∈ [0 , 1] K +1 where  We recognize that in each auction A 1 . . . A K , under bid multipliers ( α 0 , ρ, . . . ρ ) ∈ (1 , ∞ ) K +1 the submitted bid profile is a cyclic permutation of B . Therefore we know that  Finally, by taking ρ → α 0 and K →∞ in Equation (28), and utilizing ϵ = O (1 /K 3 ) we have  This shows that bidder i 's ROI constraint is satisfied. □",
  "Appendix E: Proofs for Section 6": "",
  "E.1. Proof of Theorem 6.2": "For convenience, define δ =2 -1 ∆ , so ∆ > 1 implies δ ∈ (1 , 2) , and further 1 >β> ∆ 2∆ -1 implies 1 δ <β< 1 . Fix a bidder i ∈ [ K ] and any feasible competing bid profile b ∈U . Denote the corresponding outcome as x = X ( b ) , where x =( x 1 ... x M ) where x j ∈ { 0 , 1 } N × L j is the outcome vector in auction A j . Note that by definition of U which is the set of undominated and feasible bids, under the outcome x all bidders' ROAS constraints are satisfied. Denote ℓ k,j , ℓ ∗ k,j to be the position of bidder k ∈ [ N ] in auction j ∈ [ M ] under outcome x and the efficient outcome, respectively. Recall in Eq.(8) the definition for the set of all 'coverings' for bidder i , denoted as C i ( x ) :  where L i ( x ) = { j ∈ [ M ] : W i,j ( x ) < OPT i,j } is the set of auctions in which bidder i 's acquired welfare is less than that of her welfare under the efficient outcome; see Definition 4.1. Denote p k,j as the payment of any bidder k , and ˆ b ℓ,j as the ℓ th largest bid in any auction j ∈ [ M ] . Similar to the proof of Theorem 4.1, fix any covering C ⊆ C i ( x ) , and any bidder k ∈C , such that in some auction 8 j ∈ B i ( k ; x ) , we have v k,j <v i,j but ℓ k,j ≤ ℓ ∗ i,j <ℓ i,j . Thus following a similar deduction as Eq. (12) in the proof of Theorem 4.1, bidder k 's payment is lower bounded as  Here , (a) follows from the fact that for a fix bid profile, the payment of GSP or GFP for each bidder in an auction dominates that of VCG (see Example B.1 and discussions thereof); (b) follows from ˆ b ℓ,j ≥ b i,j for ℓ ≤ ℓ i,j , and since b ∈ U ⊆ R N × M + is an undominated bid profile, Lemma 6.1 applies and b i,j ≥ βv i,j . Also p i,j ≥ r i,j ≥ βv i,j be the definition of β -approximate reserves; (c) follows from the fact that β > 1 δ and µ ( ℓ ∗ i,j ) ≤ µ ( ℓ k,j ) since ℓ k,j ≤ ℓ ∗ i,j for any k ∈C ⊆C i ( x ) and j ∈B i ( k ; x ) ; see definition in Eq. (8). On the other hand, we have  where the first inequality follows from bidder k 's ROAS constraint; the second inequality follows from the fact that any winning bidder's payment must be greater than her β -approximate reserves. Combining the above inequalities and rearranging we get  9 Summing Eq.(29) over all j ∈B i ( k ; x ) and combining with Eq. (30), we get   We now upper bound Y :  where in (a) we recall δ > 1 and ℓ k,j <ℓ i,j for any k ∈C and j ∈B i ( k ; x ) so that µ ( ℓ k,j ) >µ ( ℓ i,j ) ; (b) follows from the fact that values are δ -separated, so v i,j >v k,j for k ∈C and j ∈B i ( k ; x ) implies v k,j v ≤ 1 ∆ =2 -δ ; in i,j (c) we used the fact that β > 1 δ so 1 -β < 1 -1 δ , and the fact that v k,j <v i,j for any k ∈C and j ∈B i ( k ; x ) . 10 Combining Equations (31) and (32) we get   where (a) follows from µ ( ℓ ∗ i,j ) ≤ µ ( ℓ k,j ) due to the fact that ℓ k,j <ℓ i,j for any k ∈C and j ∈B i ( k ; x ) . Summing the above over all k ∈C , and following the same arguments as in Eq.(10) of the proof of Theorem 4.1, we have  Rearranging we get loss i ( x ) ≤ 1 -β β -1 δ OPT -i = 1 -β β -∆ 2∆ -1 OPT -i . Finally, applying Proposition 4.4 w.r.t. upper bound of loss i ( x ) and using the fact that the competing bid profile is arbitrary, we obtain the desired welfare guarantee lower bound. □",
  "keywords_parsed": [
    "Individual welfare guarantee",
    "mechanism design",
    "machine-learned advice",
    "welfare maximization"
  ],
  "references_parsed": [
    {
      "ref_id": "b1",
      "title": "Autobidding with constraints"
    },
    {
      "ref_id": "b2",
      "title": "No-regret learning in repeated first-price auctions with budget constraints"
    },
    {
      "ref_id": "b3",
      "title": "Robust auction design in the auto-bidding world"
    },
    {
      "ref_id": "b4",
      "title": "Budget management strategies in repeated auctions"
    },
    {
      "ref_id": "b5",
      "title": "Budget-management strategies in repeated auctions"
    },
    {
      "ref_id": "b6",
      "title": "The best of many worlds: Dual mirror descent for online allocation problems"
    },
    {
      "ref_id": "b7",
      "title": "The landscape of auto-bidding auctions: Value versus utility maximization"
    },
    {
      "ref_id": "b8",
      "title": "Dynamic incentive-aware learning: Robust pricing in contextual auctions"
    },
    {
      "ref_id": "b9",
      "title": "Auction design for roi-constrained buyers"
    },
    {
      "ref_id": "b10",
      "title": "Online page migration with ml advice"
    },
    {
      "ref_id": "b11",
      "title": "Estimating the confidence interval for prediction errors of support vector machine classifiers"
    },
    {
      "ref_id": "b12",
      "title": "Dynamic reserve prices for repeated auctions: Learning from bids"
    },
    {
      "ref_id": "b13",
      "title": "Sponsored search auctions"
    },
    {
      "ref_id": "b14",
      "title": "Estimating conversion rate in display advertising from past performance data"
    },
    {
      "ref_id": "b15",
      "title": "Competitive caching with machine learned advice"
    },
    {
      "ref_id": "b16",
      "title": "Ad click prediction: a view from the trenches"
    },
    {
      "ref_id": "b17",
      "title": "Auction design in an auto-bidding setting: Randomization improves efficiency beyond vcg"
    },
    {
      "ref_id": "b18",
      "title": "Revenue optimization with approximate bid predictions"
    },
    {
      "ref_id": "b19",
      "title": "Introductory lectures on convex optimization: A basic course"
    },
    {
      "ref_id": "b20",
      "title": "A field guide to personalized reserve prices"
    },
    {
      "ref_id": "b21",
      "title": "Optimal auctions with financially constrained buyers"
    },
    {
      "ref_id": "b22",
      "title": "Predicting clicks: estimating the click-through rate for new ads"
    },
    {
      "ref_id": "b23",
      "title": "Intrinsic robustness of the price of anarchy"
    },
    {
      "ref_id": "b24",
      "title": "Machine learning approaches for estimation of prediction interval for the model output"
    },
    {
      "ref_id": "b25",
      "title": "A predictive model for advertiser value-per-click in sponsored search"
    },
    {
      "ref_id": "b26",
      "title": "Position auctions"
    },
    {
      "ref_id": "b27",
      "title": "Online algorithms for multi-shop ski rental with machine learned advice"
    },
    {
      "ref_id": "b28",
      "title": "Click-through rate prediction in online advertising: A literature review"
    },
    {
      "ref_id": "b29",
      "title": "An empirical study of reserve price optimisation in real-time bidding"
    }
  ]
}