{
  "Optimized Cost Per Click in Online Advertising: A Theoretical Analysis": "Kaichen Zhang 1 , Zixuan Yuan 2 , Hui Xiong 1 , 3 , âˆ— 1 Artificial Intelligence Thrust, Hong Kong University of Science and Technology (Guangzhou) 2 Financial Technology Thrust, Hong Kong University of Science and Technology (Guangzhou) 3 Department of Computer Science and Engineering, Hong Kong University of Science and Technology kzhangbi@connect.ust.hk,zixuanyuan@hkust-gz.edu.cn,xionghui@ust.hk",
  "ABSTRACT": "",
  "1 INTRODUCTION": "In recent years, Optimized Cost Per Click (OCPC) and Optimized Cost Per Mille (OCPM) have emerged as the most widely adopted pricing models in the online advertising industry. However, the existing literature has yet to identify the specific conditions under which these models outperform traditional pricing models like Cost Per Click (CPC) and Cost Per Action (CPA). To fill the gap, this paper builds an economic model that compares OCPC with CPC and CPA theoretically, which incorporates out-site scenarios and outside options as two key factors. Our analysis reveals that OCPC can effectively replace CPA by tackling the problem of advertisers strategically manipulating conversion reporting in out-site scenarios where conversions occur outside the advertising platform. Furthermore, OCPC exhibits the potential to surpass CPC in platform payoffs by providing higher advertiser payoffs and consequently attracting more advertisers. However, if advertisers have less competitive outside options and consistently stay in the focal platform, the platform may achieve higher payoffs using CPC. Our findings deliver valuable insights for online advertising platforms in selecting optimal pricing models, and provide recommendations for further enhancing their payoffs. To the best of our knowledge, this is the first study to analyze OCPC from an economic perspective. Moreover, our analysis can be applied to the OCPM model as well.",
  "CCS CONCEPTS": "",
  "Â· Information systems â†’ Online advertising .": "",
  "KEYWORDS": "online advertising, optimized cost per mille, optimized cost per click, OCPM, OCPC, pricing models",
  "ACMReference Format:": "Kaichen Zhang 1 , Zixuan Yuan 2 , Hui Xiong 1 , 3 , âˆ— . 2018. Optimized Cost Per Click in Online Advertising: A Theoretical Analysis. In Proceedings of Make sure to enter the correct conference title from your rights confirmation emai (Conference acronym 'XX). ACM, New York, NY, USA, 12 pages. https://doi. org/XXXXXXX.XXXXXXX âˆ— Corresponding author. Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. Conference acronym 'XX, June 03-05, 2018, Woodstock, NY Â© 2018 Association for Computing Machinery. ACM ISBN 978-1-4503-XXXX-X/18/06...$15.00 https://doi.org/XXXXXXX.XXXXXXX Recent decades have witnessed remarkable growth in the online advertising industry. According to Interactive Advertising Bureau [3], U.S. revenues roared to $209.7 billion in 2022, which marks an extraordinary 30-fold increase over the 2002 figures. Alongside this rapid expansion, the pricing models in online advertising have also consistently evolved over the years to adapt to market demands and technological advancements, as demonstrated in Figure 1. In essence, the pricing model aims to determine how advertisers bid and pay for their ads to be displayed on advertising platforms. For instance, the Cost Per Mille (CPM) model allows advertisers to bid for ad displays. Then, the advertiser who offers the highest bid price will be secured with the right to display its ad. However, similar to traditional advertising media, CPM is not cost-efficient as it often distributes ads to unrelated users, which is well captured by the famous marketing quote, \"Half the money I spend on advertising is wasted; the trouble is I don't know which half.\" To address this issue, the performance-based pricing models, Cost Per Click (CPC) and Cost Per Action (CPA), were developed in quick succession. In the CPC model, advertisers bid for ad clicks and only pay when a user clicks their ad. The CPA model takes a step further, allowing advertisers to directly bid for a desired action (e.g. making a purchase), and only pay when the user completes the desired action. Each time the user completes the desired action, it results in a conversion. Most recently, Facebook introduced Optimized Cost Per Click (OCPC) and Optimized Cost Per Mille (OCPM). Both models inherit the good property of CPA that allows direct bidding for a conversion, while advertisers are still obliged to pay when a click occurs or an ad is displayed, like CPC and CPM. Hence, OCPC and OCPM have now become the most widely adopted pricing models in the industry, embraced by major platforms such as Google, Meta, TikTok, and Taobao. In contrast, the CPA model, once hailed as the \"Holy Grail\" of online advertising, now faces restrictions or is outright banned in many cases. It has been relegated to a limited set of scenarios, often accompanied by qualification requirements. Despite their widespread adoption in practice, the existing literature has yet to identify the specific conditions under which OCPC and OCPM can outperform traditional models and the consequences of choosing them over alternatives. To fill this gap, we build an economic model to theoretically compare OCPC with traditional pricing models, CPC and CPA. Although our primary focus is on OCPC as an exemplar, it is worth noting that our analysis and insights can also apply to OCPM, considering their analogous structure. We include OCPM and CPM in Appendix A.1. 1 Conference acronym 'XX, June 03-05, 2018, Woodstock, NY Kaichen Zhang 1 , Zixuan Yuan 2 , Hui Xiong 1 , 3 , âˆ— Figure 1: U.S. Online Advertising Revenue and Pricing Model Milestones 6.0 billions 17.8 billions 59.5 billion$ 209.7 billion$ 2002 2006 2015 2022 1990s 1996 2006 2015 Now CPM appeared Yahoo! adopted Google adopted Facebook adopted OCPM&OCPC (Cost Per Mille) CPC CPA OCPM, OCPC have become the (Cost Per Click) (Cost Per Action) (Optimized Cost Per Mille, most widely used Optimized Cost Per Click) pricing models In our model, we solve an extensive-form game between one focal platform and two distinct types of advertisers. The game progresses through several stages. First, the platform selects a pricing model among CPC, CPA, or OCPC. Second, advertisers decide whether to enter the subsequent auction based on the selected pricing model. Third, a second-price auction ensues for an ad display. Finally, advertisers finalize payments and all parties realize payoffs. Our model incorporates two crucial and realistic factors that previous pricing model research has overlooked. Firstly, we consider the fact that advertisers have alternative options beyond the focal platform. Advertisers, particularly those with budget constraints, may opt not to enter the auction to maximize return on investment (ROI) unless their payoffs exceed their outside options. On the other hand, some advertisers do not face budget constraints and can continue bidding for ads, such as paid video games, as long as their average cost remains lower than the marginal gain. Consequently, our model features one advertiser with an outside option and another without, representing these two types. Furthermore, we emphasize the impact of conversion rate prediction algorithms. These platforms now employ machine learning to predict conversion rates for each user and ad, a feat difficult for advertisers to achieve independently. However, the accuracy of these predictions hinges on an unbiased training sample. This requirement may be compromised when conversions occur outside of platforms and depend on advertisers' reporting. As a result, we distinguish between in-site and out-site scenarios based on whether advertisers can manipulate conversion reporting. Our model explains why OCPC outperforms CPA in practice. CPA is vulnerable to conversion reporting manipulation, resulting in negligible platform payoffs in out-site scenarios. In contrast, although advertisers can still manipulate conversion rates under OCPC, our analysis shows that they possess an incentive to maintain accurate conversion rates. There, OCPC functions effectively across a wider range of out-site scenarios. Additionally, this paper highlights the trade-offs between OCPC and CPC. At first glance, platforms might always favor the so-called \"optimized\" pricing model, OCPC, over CPC. This preference stems from the potential for increased platform payoffs through OCPC, as it can attract more advertisers by offering them higher payoffs as well. However, if advertisers have less competitive outside options and consistently select the focal platform, the platform may actually achieve higher payoffs using CPC. We further generalize our findings for the optimal pricing model selection among a set of pricing models. We suggest that platforms should choose a model that strikes a balance between platform payoffs with a predetermined number of advertisers and advertiser payoffs that attract more advertisers. When user value is high, platforms are advised to adopt models that yield higher platform payoffs. Conversely, platforms should opt for models that provide greater advertiser payoffs in an alternative manner. This paper also offers suggestions for platforms to further enhance their payoffs. Firstly, platforms should consider shifting their attention from predicting conversion rates to actively increasing them, which can improve payoffs in a dual-pronged way. Secondly, platforms can employ subsidies or coupons to indirectly reduce outside options, subsequently attracting more advertisers. Lastly, platforms can develop innovative pricing models that allow advertisers to bid for aspects that fall between clicks and conversions to fill the gap between CPC and OCPC. In summary, this paper makes the following contributions: Â· To the best of our knowledge, this is the first study to analyze OCPC from an economic perspective, providing theoretical foundations to online advertising pricing models. Â· Wehaveidentified two critical factors that account for OCPC's prevalence over other pricing models: OCPC surpasses CPA as it is applicable to the broader out-site scenarios; OCPC outperforms CPC by attracting a greater number of advertisers with outside options . Â· Our findings provide valuable insights and recommendations for online advertising platforms to select the optimal pricing model and enhance their overall payoffs.",
  "2 RELATED LITERATURE": "Information systems have been widely used in marketing [18, 24], among which Real-time Bidding (RTB) in online advertising allows ads to be bought and sold on a per-impression (per-ad display) basis in real-time [23]. This process is rooted in auction theories [6, 8, 17, 22], where an auction among advertisers is conducted as soon as a user lands on a website. Modern RTB predominantly employs the generalized second-price (GSP) auction model [7, 20], in which the highest bidder secures the top ad placement and pays the second-highest bid. Similarly, the second-highest bidder acquires the second placement and pays the third-highest bid, and so forth. 2 Optimized Cost Per Click in Online Advertising: A Theoretical Analysis Conference acronym 'XX, June 03-05, 2018, Woodstock, NY A comprehensive overview of online display advertising markets was provided by Choi et al. [5]. Economic models have been used to examine pricing models. Hu [10] initially compared the CPM and CPC using the optimal contract design framework, while Asdemir et al. [2] analyzed the same models under the principal-agent framework. Both studies argued that the performance-based CPC model can incentivize publishers and advertisers to enhance advertising performance. Agarwal et al. [1] differentiated CPA from CPC. Hu et al. [9] delved deeper into the trade-offs between CPA and CPC, focusing on incentive issues. Zhu et al. [26] and Liu et al. [15] investigated hybrid auctions that allow advertisers to select their preferred pricing models. However, existing literature on pricing models exhibits several gaps. Firstly, to the best of our knowledge, no existing study has examined OCPC (or OCPM) as a pricing model. Although some papers [11, 19, 25] have explored OCPC's algorithm system architecture, it is still unclear under which conditions OCPC should be employed in comparison to other pricing models. Secondly, the extant literature on pricing models often assumes that advertisers always participate in the auction, thereby overlooking the significance of entry [4, 12-14]. This assumption may not accurately reflect real-world scenarios where advertisers decide whether to enter based on their outside options. Thirdly, current research on pricing models does not consider the impact of conversion rate prediction algorithms. Lu et al. [16] highlighted that conversion trackers provided by platforms are just a piece of JavaScript code that can be arbitrarily excused or not by advertisers and online advertising platforms are no way to ascertain that they capture all the conversions without advertisers' truthful reports, which may considerably influence pricing models in a non-trivial manner.",
  "3 PRELIMINARY": "In online advertising, an impression occurs when an ad is displayed on a website or app. A click occurs when a user clicks on the displayed ad. A conversion occurs when a user completes a desired action, such as making a purchase, after clicking on the ad. The CTR (click-through rate) of an ad is the probability of its impression resulting in a click. The CVR (conversion rate) of an ad is the probability of its click resulting in a conversion. We define a pricing model based on what advertisers bid for and what they ultimately pay for. In CPC (Cost Per Click), advertisers bid for clicks and pay for clicks. In CPA (Cost Per Action), advertisers bid for conversions and pay for conversions. In OCPC (Optimized Cost Per Click), advertisers bid for conversions but pay for clicks. For instance, in the CPA model, an advertiser might bid $10 for a conversion, signifying their willingness to pay up to $10 for each conversion. If a conversion occurs, the advertiser has to pay the platform up to $10. Alternatively, in the OCPC model, an advertiser can also bid $10 for a conversion but it makes the payment when a click occurs. In this case, the payment could be up to $1 per click, assuming the platform's predicted CVR is 0.1. We categorize transactions that take place entirely within the ad platform as the in-site scenario . Conversely, when users are directed from the platform to an external site after clicking on an ad, we refer to this as the out-site scenario . To illustrate, Amazon belongs to the in-site scenario; Facebook belongs to the out-site scenario. Table 1: Notation Summary",
  "4 MODEL": "We build an economic model of a game between two representative advertisers and one advertising platform using the second-price sealed bid auction under various pricing models. The purpose of economic models is a simplification of and abstraction from complex reality. Previous research on pricing models typically uses a few representative advertisers to capture the essence of the focused pricing models while greatly simplifying the analysis. 1 For instance, [2] evaluates CPC and CPM by one agent advertiser; [9] compares CPA and CPC by two advertisers with distinct types. We follow this trend while discussing various extensions to more realistic settings in Appendix A.10.",
  "4.1 Settings": "We have clearly divided the settings into four groups: Advertiser , CTR and CVR , In-site and Out-site scenario , and Auction . Table 1 summarizes this paper's main notations. In addition, we justify this paper's assumptions in Appendix A.2.",
  "Advertiser:": "We denote the marginal gain from a conversion for advertiser ğ‘– as ğ‘š ğ‘– , indicating the profit obtained from each sale/conversion. We assume advertiser 1 has no outside option, while advertiser 2 has an outside option ğ‘Ÿ . Consequently, advertiser 1 always enters the auction and advertiser 2 enters the auction if and only if its expected payoffs in the auction surpass its outside option, ğ‘Ÿ . This asymmetry setting accounts for advertiser diversity. Advertiser 1 represents the group of advertisers without budget constraints, who will pursue conversions at a cost lower than marginal gain across different platforms. Advertiser 2 represents another group of advertisers with budget constraints, who will spend their budget on the most valuable platform to maximize their profit. In practice, the two groups of advertisers may prefer auto-bidders that maximize conversion volume or that manage budgets respectively.",
  "CTR and CVR:": "We represent advertiser ğ‘– 's CTR as ğ‘ ğ‘– and CVR as ğ‘ ğ‘– , drawn from the respective distributions ğ¶ ğ‘– and ğ‘ƒ ğ‘– . We define ğ¸ ( ğ¶ ğ‘– ) = ğœ‡ ğ‘ ğ‘– , ğ‘‰ ğ‘ğ‘Ÿ ( ğ¶ ğ‘– ) = ğœ ğ‘ ğ‘– and ğ¸ ( ğ‘ƒ ğ‘– ) = ğœ‡ ğ‘ ğ‘– , ğ‘‰ ğ‘ğ‘Ÿ ( ğ‘ƒ ğ‘– ) = ğœ ğ‘ ğ‘– . Online advertising platforms now employ machine learning to predict CTR and CVR for each ad, a feat difficult for advertisers to achieve independently. Therefore, we assume that the platform's 1 Google's Chief Economist Hal Varian advises: \"An economic model is supposed to reveal the essence of what is going on: your model should be reduced to just those pieces that are required to make it work.\" [21] 3 Conference acronym 'XX, June 03-05, 2018, Woodstock, NY Kaichen Zhang 1 , Zixuan Yuan 2 , Hui Xiong 1 , 3 , âˆ— decisions are based on its predictions of ğ‘ ğ‘– and ğ‘ ğ‘– , while advertisers make decisions based on the distribution of ğ¶ ğ‘– and ğ‘ƒ ğ‘– and their belief in the accuracy of the platform's predictions. We denote the platform's prediction for ğ‘ ğ‘– as Â¯ ğ‘ ğ‘– and ğ‘ ğ‘– as Â¯ ğ‘ ğ‘– . We denote advertiser ğ‘– 's belief in Â¯ ğ‘ ğ‘– as Â¯ ğ¶ ğ‘– and belief in Â¯ ğ‘ ğ‘– as Â¯ ğ‘ƒ ğ‘– . For example, consider advertiser 1's CTR follows a uniform distribution: ğ¶ 1 âˆ¼ ğ‘ˆ ( 0 . 2 , 0 . 4 ) . In a specific auction, the actual CTR could be 0.36, ğ‘ 1 = 0 . 36. If the platform consistently underestimates the CTR by 50%, then the predicted CTR would be Â¯ ğ‘ 1 = 0 . 5 âˆ— 0 . 36 = 0 . 18. Although advertiser 1 is not aware of the actual CTR (0.36) or the platform's prediction (0.18), it can still form a belief about the platform's prediction, denoted as Â¯ ğ¶ 1 âˆ¼ ğ‘ˆ ( 0 . 1 , 0 . 2 ) .",
  "In-site and Out-site scenario:": "We distinguish between in-site and out-site scenarios based on whether advertisers can manipulate conversion reporting. In the in-site scenario, we assume the platform's predictions are accurate, with Â¯ ğ‘ ğ‘– = ğ‘ ğ‘– and Â¯ ğ‘ ğ‘– = ğ‘ ğ‘– , and advertisers' beliefs are consistent, with Â¯ ğ¶ ğ‘– = ğ¶ ğ‘– and Â¯ ğ‘ƒ ğ‘– = ğ‘ƒ ğ‘– . In the out-site scenario, advertiser ğ‘– can establish a reporting strategy ğ›¼ ğ‘– âˆˆ [ 0 , 1 ] , which signifies that a conversion is only reported with probability ğ›¼ ğ‘– upon receipt. We then assume the platform's predictions to be Â¯ ğ‘ ğ‘– = ğ‘ ğ‘– and Â¯ ğ‘ ğ‘– = ğ›¼ ğ‘– ğ‘ ğ‘– , with advertisers' beliefs at Â¯ ğ¶ ğ‘– = ğ¶ ğ‘– and Â¯ ğ‘ƒ ğ‘– = ğ›¼ ğ‘– ğ‘ƒ ğ‘– . Our assumptions regarding the platform's predictions are based on the characteristics of real-world CTR/CVR supervised learning, making them suitable for analyzing pricing models. This approach takes into account the biased sampling error that may arise from advertisers' strategic conversion reports while excluding trivial learning errors to emphasize the primary role of pricing models.",
  "Auction:": "Werepresent advertiser ğ‘– 's bid as ğ‘ ğ‘– . In CPC, ğ‘ ğ‘– denotes advertiser ğ‘– 's bid per click, whereas, in CPA and OCPC, ğ‘ ğ‘– signifies advertiser ğ‘– 's bid per conversion. We introduce the concept of advertiser i's equivalent bid on an impression as ğ‘’ ğ‘– , which refers to the industry concept of ECPM [25]. The ğ‘’ ğ‘– facilitates comparisons across various pricing models. For example, consider a scenario where Â¯ ğ‘ 1 = 0 . 3, Â¯ ğ‘ 1 = 0 . 2, and advertiser 1 bids 100 for a conversion, denoted as ğ‘ 1 = 100. In this case, the equivalent bid is calculated as ğ‘’ 1 = 0 . 3 âˆ— 0 . 2 âˆ— 100 = 6. This suggests that, from the platform's viewpoint, advertiser 1 bidding 6 for an impression is equivalent. If advertiser 1 bids 10 for a click, the equivalent bid becomes ğ‘’ 1 = 10 âˆ— 0 . 3 = 3. The platform selects the advertiser with the highest equivalent bid on an impression as the winner, denoted as ğ‘¤ = ğ‘šğ‘ğ‘¥ ğ‘– ğ‘’ ğ‘– . Another advertiser is deemed the loser, represented as ğ‘™ = ğ‘šğ‘–ğ‘› ğ‘– ğ‘’ ğ‘– .",
  "4.2 Timeline": "The following timeline outlines the progression of the game: (1) The platform selects a model among CPC, CPA, or OCPC. (2) Advertiser 2 determines whether to enter the auction. (3) Advertisers select their bids and, if in the out-site scenario, also decide on their reporting strategy ğ›¼ ğ‘– . (4) The actual values of ğ‘ ğ‘– and ğ‘ ğ‘– are realized, while the platform predicts Â¯ ğ‘ ğ‘– and Â¯ ğ‘ ğ‘– , and calculates ğ‘’ ğ‘– . (5) The platform identifies the auction winner ( ğ‘¤ = ğ‘ğ‘Ÿğ‘”ğ‘šğ‘ğ‘¥ ğ‘– ğ‘’ ğ‘– ) and display its ad. (6) The winner makes payments and all parties realize payoffs. We will analyze the game in both the in-site and out-site scenarios. The key difference between the two scenarios is that advertisers need to decide on a conversion reporting strategy in the out-site scenario (step 3), which also affects the payment process (step 6). To solve the overall game, we will employ backward induction, focusing on each subgame where the platform has chosen a specific pricing model and both advertisers have opted to participate in the auction. We will begin our analysis from step 3 for each subgame.",
  "5 IN-SITE SCENARIO": "We initiate our analysis from the in-site scenario, in which advertising platforms can accurately track conversions. For each subgame, we will explore the optimal bidding strategy employed by advertisers and evaluate the resulting payoffs for all parties involved.",
  "5.1 Cost Per Click": "In CPC, advertisers bid for clicks and pay for clicks. As advertisers bid for clicks, the platform predicts advertiser ğ‘– 's equivalent bid on an impression as ğ‘’ ğ‘– = Â¯ ğ‘ ğ‘– ğ‘ ğ‘– . Following the secondprice auction, the platform selects the advertiser with the highest equivalent bid on an impression, denoted as ğ‘¤ = ğ‘ğ‘Ÿğ‘”ğ‘šğ‘ğ‘¥ ğ‘– ğ‘’ ğ‘– = ğ‘ğ‘Ÿğ‘”ğ‘šğ‘ğ‘¥ ğ‘– Â¯ ğ‘ ğ‘– ğ‘ ğ‘– , to be the winner and receive the impression. As advertisers pay for clicks, the auction winner has to pay Â¯ ğ‘ ğ‘™ ğ‘ ğ‘™ Â¯ ğ‘ ğ‘¤ if a click occurs. The loser pays 0. This payment is based on the intuition that the equivalent payment for an impression is Â¯ ğ‘ ğ‘™ ğ‘ ğ‘™ , where ğ‘™ denotes the advertiser with the second-highest bid in the model. However, since advertisers pay for a click in CPC, the auction winner should pay Â¯ ğ‘ ğ‘™ ğ‘ ğ‘™ Â¯ ğ‘ ğ‘¤ for each click because every 1 Â¯ ğ‘ ğ‘¤ impression generates a click on average. Given another advertiser ğ‘˜ 's equivalent bid on an impression ğ‘’ ğ‘˜ , advertiser ğ‘– 's utility is:  when advertiser ğ‘– bid ğ‘ ğ‘– per click in CPC. The first component, ğ‘ƒğ‘Ÿ ( Â¯ ğ¶ ğ‘– ğ‘ ğ‘– > ğ‘’ ğ‘˜ ) , represents advertiser ğ‘– 's winning probability. The second component represents its expected gain upon winning. The ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ‘š ğ‘– represents its revenue from the auctioned impression, while ğ¶ ğ‘– ğ‘’ ğ‘˜ Â¯ ğ¶ ğ‘– represents the associated cost. Proposition 5.1. Under CPC, a dominant strategy for advertiser ğ‘– is to bid ğ‘ ğ‘– = ğœ‡ ğ‘ ğ‘– ğ‘š ğ‘– , which is equal to the product of the expected conversion rate and the marginal gain from a conversion. Proof. We show that ğœ‹ ğ‘– ( ğœ‡ ğ‘ ğ‘– ğ‘š ğ‘– | ğ‘’ ğ‘˜ ) â‰¥ ğœ‹ ğ‘– ( ğ‘ ğ‘– | ğ‘’ ğ‘˜ ) for any ğ‘’ ğ‘˜ .  because ğ‘ƒ ğ‘– is independent of the condition Â¯ ğ¶ ğ‘– ğ‘ ğ‘– > ğ‘’ ğ‘˜ . 4 Optimized Cost Per Click in Online Advertising: A Theoretical Analysis Conference acronym 'XX, June 03-05, 2018, Woodstock, NY  ğœ‹ ğ‘– ( ğ‘ ğ‘– | ğ‘’ ğ‘˜ )     ğœ‹ ğ‘– ( ğœ‡ ğ‘ ğ‘– ğ‘š ğ‘– | ğ‘’ ğ‘˜ )     ğ‘– This optimal bidding strategy aligns with the truth-telling property in second-price auctions, where an advertiser's optimal bid is equal to their valuation of the auctioned impression. However, due to the lack of knowledge regarding the actual conversion rate ( ğ‘ ğ‘– ), advertisers can only estimate the valuation using their average conversion rate ( ğœ‡ ğ‘ ğ‘– ). In practice, this average conversion rate can be calculated by dividing the total number of conversions by the total number of clicks. Next, we determine the payoffs for each party in the CPC model, focusing on the in-site scenario, denoted by ğ¼ -.  ğ¸ ( ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ‘š ğ‘– -ğ¶ ğ‘˜ ğœ‡ ğ‘ ğ‘˜ ğ‘š ğ‘˜ | ğ¶ ğ‘– ğœ‡ ğ‘ ğ‘– ğ‘š ğ‘– > ğ¶ ğ‘˜ ğœ‡ ğ‘ ğ‘˜ ğ‘š ğ‘˜ ) ğ‘ƒğ‘Ÿ ( ğ¶ ğ‘– ğœ‡ ğ‘ ğ‘– ğ‘š ğ‘– > ğ¶ ğ‘˜ ğœ‡ ğ‘ ğ‘˜ ğ‘š ğ‘˜ ) = ğ¸ ( ğ¶ ğ‘– ğœ‡ ğ‘ ğ‘– ğ‘š ğ‘– -ğ¶ ğ‘˜ ğœ‡ ğ‘ ğ‘˜ ğ‘š ğ‘˜ | ğ¶ ğ‘– ğœ‡ ğ‘ ğ‘– ğ‘š ğ‘– > ğ¶ ğ‘˜ ğœ‡ ğ‘ ğ‘˜ ğ‘š ğ‘˜ ) ğ‘ƒğ‘Ÿ ( ğ¶ ğ‘– ğœ‡ ğ‘ ğ‘– ğ‘š ğ‘– > ğ¶ ğ‘˜ ğœ‡ ğ‘ ğ‘˜ ğ‘š ğ‘˜ ) Platform's payoff, ğœ‹ ğ‘ƒ ğ¼ -ğ¶ğ‘ƒğ¶ : ( ğ¸ ( ğ¶ 2 ğœ‡ ğ‘ 2 ğ‘š 2 | ğ¶ 1 ğœ‡ ğ‘ 1 ğ‘š 1 > ğ¶ 2 ğœ‡ ğ‘ 2 ğ‘š 2 ) ğ‘ƒğ‘Ÿ ( ğ¶ 1 ğœ‡ ğ‘ 1 ğ‘š 1 > ğ¶ 2 ğœ‡ ğ‘ 2 ğ‘š 2 )+ ğ¸ ( ğ¶ 1 ğœ‡ ğ‘ 1 ğ‘š 1 | ğ¶ 1 ğœ‡ ğ‘ 1 ğ‘š 1 < ğ¶ 2 ğœ‡ ğ‘ 2 ğ‘š 2 ) ğ‘ƒğ‘Ÿ ( ğ¶ 1 ğœ‡ ğ‘ 1 ğ‘š 1 < ğ¶ 2 ğœ‡ ğ‘ 2 ğ‘š 2 )) = ğ¸ ( ğ‘šğ‘–ğ‘› ( ğ¶ 1 ğœ‡ ğ‘ 1 ğ‘š 1 , ğ¶ 2 ğœ‡ ğ‘ 2 ğ‘š 2 )) Social welfare, ğœ‹ ğ‘† ğ¼ -ğ¶ğ‘ƒğ¶ = ğ¸ ( ğ‘šğ‘ğ‘¥ ( ğ¶ 1 ğœ‡ ğ‘ 1 ğ‘š 1 , ğ¶ 2 ğœ‡ ğ‘ 2 ğ‘š 2 )) .",
  "5.2 Cost Per Action": "In CPA, advertisers bid for conversions and pay for conversions. As advertisers bid for conversions, the platform's prediction on advertiser ğ‘– 's equivalent bid on an impression is ğ‘’ ğ‘– = Â¯ ğ‘ ğ‘– Â¯ ğ‘ ğ‘– ğ‘ ğ‘– . As advertisers pay for conversions, the auction winner has to pay Â¯ ğ‘ ğ‘™ Â¯ ğ‘ ğ‘™ ğ‘ ğ‘™ Â¯ ğ‘ ğ‘¤ Â¯ ğ‘ ğ‘¤ if a conversion occurs. The loser pays 0. In the in-site scenario, the platform can accurately track conversions, which ensures a conversion will always result in a payment. Given another advertiser ğ‘˜ 's equivalent bid on an impression ğ‘’ ğ‘˜ , advertiser ğ‘– 's utility is:  when advertiser ğ‘– bid ğ‘ ğ‘– per conversion in CPA. Proposition 5.2. Under CPA in the in-site scenario, a dominant strategy for advertiser ğ‘– is to bid ğ‘ ğ‘– = ğ‘š ğ‘– . The proof of Proposition 5.2 can be found in Appendix A.3. Proposition 5.2 reinforces the assertion that \"CPA, or cost per action, is the Holy Grail for targeted advertising\", because advertisers only need to bid their marginal gain from a conversion without any estimation on CTR and CVR. This is particularly important for fresh ad campaigns and advertisers who are new to the platform because there is no historical data for accurate estimation. These advertisers can circumvent the potential losses resulting from biased estimations, by directly bidding their marginal gain. We then examine the payoffs associated with CPA for each party. Advertiser ğ‘– 's payoff, ğœ‹ ğ‘– ğ¼ -ğ¶ğ‘ƒğ´ :  Platform's payoff, ğœ‹ ğ‘ƒ ğ¼ -ğ¶ğ‘ƒğ´ = ğ¸ ( ğ‘šğ‘–ğ‘› ( ğ¶ 1 ğ‘ƒ 1 ğ‘š 1 , ğ¶ 2 ğ‘ƒ 2 ğ‘š 2 )) . Social welfare, ğœ‹ ğ‘† ğ¼ -ğ¶ğ‘ƒğ´ = ğ¸ ( ğ‘šğ‘ğ‘¥ ( ğ¶ 1 ğ‘ƒ 1 ğ‘š 1 , ğ¶ 2 ğ‘ƒ 2 ğ‘š 2 )) .",
  "5.3 Optimized Cost Per Click": "In OCPC, advertisers bid for conversions but pay for clicks. As advertisers bid for conversions, the platform's prediction on advertiser ğ‘– 's equivalent bid on an impression is ğ‘’ ğ‘– = Â¯ ğ‘ ğ‘– Â¯ ğ‘ ğ‘– ğ‘ ğ‘– . As advertisers pay for clicks, the auction winner has to pay Â¯ ğ‘ ğ‘™ Â¯ ğ‘ ğ‘™ ğ‘ ğ‘™ Â¯ ğ‘ ğ‘¤ if a click occurs. The loser pays 0. In both CPA and OCPC, advertisers bid for conversions, resulting in an equivalent bid on an impression, denoted as ğ‘’ ğ‘– . However, OCPC's payment structure differs from CPA, as advertisers pay for clicks instead of conversions. OCPC's payment would be calculated as Â¯ ğ‘ ğ‘™ ğ‘ ğ‘™ per click, rather than ğ‘ ğ‘™ per conversion. Given another advertiser ğ‘˜ 's equivalent bid on an impression ğ‘’ ğ‘˜ , advertiser ğ‘– 's utility is:  when advertiser ğ‘– bid ğ‘ ğ‘– per conversion in OCPC. Proposition 5.3. Under OCPC in the in-site scenario, a dominant strategy for advertiser ğ‘– is to bid ğ‘ ğ‘– = ğ‘š ğ‘– . The proof of Proposition 5.3 can be found in Appendix A.4. We then derive the payoffs for each party in OCPC. Advertiser ğ‘– 's payoff, ğœ‹ ğ‘– ğ¼ -ğ‘‚ğ¶ğ‘ƒğ¶ :  Platform's payoff, ğœ‹ ğ‘ƒ ğ¼ -ğ‘‚ğ¶ğ‘ƒğ¶ = ğ¸ ( ğ‘šğ‘–ğ‘› ( ğ¶ 1 ğ‘ƒ 1 ğ‘š 1 , ğ¶ 2 ğ‘ƒ 2 ğ‘š 2 )) Social welfare, ğœ‹ ğ‘† ğ¼ -ğ‘‚ğ¶ğ‘ƒğ¶ = ğ¸ ( ğ‘šğ‘ğ‘¥ ( ğ¶ 1 ğ‘ƒ 1 ğ‘š 1 , ğ¶ 2 ğ‘ƒ 2 ğ‘š 2 )) . . Focusing on the in-site scenario, we observe that advertisers employ a similar bidding strategy in OCPC as in CPA, wherein they conveniently bid their marginal gain. Moreover, the payoffs for each party remain consistent across both pricing models. We 5 Conference acronym 'XX, June 03-05, 2018, Woodstock, NY Kaichen Zhang 1 , Zixuan Yuan 2 , Hui Xiong 1 , 3 , âˆ— will provide a comprehensive analysis of these aspects in Section 7, following our discussion of the out-site scenario in Section 6.",
  "6 OUT-SITE SCENARIO": "In this section, we discuss CPC, CPA, and OCPC in the out-site scenario, where advertisers can manipulate conversion reporting.",
  "6.1 Cost Per Click": "Recall that in CPC, advertisers bid for clicks and pay for clicks. The auction winner, denoted as ğ‘¤ = argmax ğ‘– Â¯ ğ‘ ğ‘– ğ‘ ğ‘– , receives the auctioned impression and has to pay Â¯ ğ‘ ğ‘™ ğ‘ ğ‘™ Â¯ ğ‘ ğ‘¤ if a click occurs. It is important to note that CPC does not require online platforms to predict conversion rates. This simplifies the deployment of the CPC model, which likely explains their emergence before CPA. Additionally, in CPC, payments are made irrespective of conversions. The transaction between the platform and the winning advertiser concludes upon a click, whether or not it occurs. From that point onward, the advertiser bears the risk or benefit of a click eventually leading to a conversion. These characteristics show CPC is irrelevant to CVR predictions. As a result, CPC does not differ between the in-site and out-site scenarios that differ in CVR prediction manipulation: Proposition 6.1. Under CPC, there is no difference between the subgame in the in-site scenario and the subgame in the out-site scenario. Advertiser ğ‘– also bids ğ‘ ğ‘– = ğœ‡ ğ‘ ğ‘– ğ‘š ğ‘– for a click. Furthermore, the payoffs for each party in the out-site scenario ( ğ‘‚ -) are identical to the payoffs in the in-site scenario ( ğ¼ -). Advertiser ğ‘– 's payoff, ğœ‹ ğ‘– ğ‘‚ -ğ¶ğ‘ƒğ¶ :  Platform's payoff, ğœ‹ ğ‘ƒ ğ‘‚ -ğ¶ğ‘ƒğ¶ = ğ¸ ( ğ‘šğ‘–ğ‘› ( ğ¶ 1 ğœ‡ ğ‘ 1 ğ‘š 1 , ğ¶ 2 ğœ‡ ğ‘ 2 ğ‘š 2 )) . Social welfare, ğœ‹ ğ‘† ğ‘‚ -ğ¶ğ‘ƒğ¶ = ğ¸ ( ğ‘šğ‘ğ‘¥ ( ğ¶ 1 ğœ‡ ğ‘ 1 ğ‘š 1 , ğ¶ 2 ğœ‡ ğ‘ 2 ğ‘š 2 )) .",
  "6.2 Cost Per Action": "Recall that in CPA, advertisers bid for conversions and pay for conversions. The auction winner, represented by ğ‘¤ = ğ‘ğ‘Ÿğ‘”ğ‘šğ‘ğ‘¥ ğ‘– Â¯ ğ‘ ğ‘– Â¯ ğ‘ ğ‘– ğ‘ ğ‘– , receives the impression and must pay Â¯ ğ‘ ğ‘™ Â¯ ğ‘ ğ‘™ ğ‘ ğ‘™ Â¯ ğ‘ ğ‘¤ Â¯ ğ‘ ğ‘¤ if a conversion occurs. The main difference in the in-site scenario is that advertiser ğ‘– will select a reporting strategy ğ›¼ ğ‘– âˆˆ [ 0 , 1 ] , indicating that it only reports a conversion with probability ğ›¼ ğ‘– when a conversion occurs. The reporting strategy ğ›¼ ğ‘– impacts the game in two ways. First, by setting ğ›¼ ğ‘– < 1, the advertiser can make the payment less frequent. This creates an incentive for advertisers not to report conversions, as it can reduce their payment. However, the advertising platform will also adjust its CVR prediction to Â¯ ğ‘ ğ‘– = ğ›¼ ğ‘– ğ‘ ğ‘– , which decreases the likelihood of advertiser ğ‘– winning the auction. As a result, the overall effect of conversion self-reporting remains unclear. Thus, given another advertiser ğ‘˜ 's equivalent bid on an impression ğ‘’ ğ‘˜ , advertiser ğ‘– 's utility is:  when advertiser ğ‘– bid ğ‘ ğ‘– per conversion in CPA. Note that there is an additional ğ›¼ ğ‘– term in the out-site scenario. Proposition 6.2. Under CPA in the out-site scenario, an equilibrium does not exist, as advertisers can always obtain a higher payoff by reducing their reporting strategy ğ›¼ ğ‘– . Proof. We use proof by contradiction. If an equilibrium exists, in which the reporting strategy of advertiser ğ‘– is ğ›¼ ğ‘– âˆ— . In this equilibrium, we have Â¯ ğ‘ ğ‘– = ğ›¼ ğ‘– âˆ— ğ‘ ğ‘– and Â¯ ğ‘ƒ ğ‘– = ğ›¼ ğ‘– âˆ— ğ‘ƒ ğ‘– . If ğ›¼ ğ‘– âˆ— = 0, then Â¯ ğ‘ ğ‘– = 0 and ğ‘’ ğ‘– = 0. In this case, advertiser ğ‘– always loses the auction and attains a payoff of 0. Consequently, advertiser ğ‘– can deviate to a positive ğ›¼ ğ‘– âˆ— to achieve a positive payoff. If ğ›¼ ğ‘– âˆ— > 0, we can deduce that for any ğ›¼ ğ‘– > 0, the optimal ğ‘ ğ‘– = ğ‘š ğ‘– ğ›¼ ğ‘– , i.e., ğœ‹ ğ‘– ( ğ‘š ğ‘– ğ›¼ ğ‘– , ğ›¼ ğ‘– | ğ‘’ ğ‘˜ ) â‰¥ ğœ‹ ğ‘– ( ğ‘ ğ‘– , ğ›¼ ğ‘– | ğ‘’ ğ‘˜ ) for any ğ‘’ ğ‘˜ . The full proof is provided in Appendix A.5. When ğ‘ ğ‘– = ğ‘š ğ‘– ğ›¼ ğ‘– , we have: ğœ‹ ğ‘– ( ğ›¼ ğ‘– | ğ‘’ ğ‘˜ )  Note that ğœ‹ ğ‘– increases as ğ›¼ ğ‘– decreases. By deviating to ğ›¼ ğ‘– = ğœ–ğ›¼ ğ‘– âˆ— , where 0 < ğœ– < 1, advertiser ğ‘– can achieve a higher payoff, which leads to a contradiction. â–¡ When advertisers adopt a fixed reporting strategy, regardless of the value of ğ›¼ ğ‘– (0.1 or even 0), the platform can compensate for this effect on payment by adjusting their CVR prediction to align with the reporting strategy, such that Â¯ ğ‘ ğ‘– = ğ›¼ ğ‘– ğ‘ ğ‘– . However, the consequence of CPA in the out-site scenario is highly detrimental for platforms. Advertisers will continually lower their reporting strategy to evade payment, causing the platform's revenue to approach zero. The platform cannot immediately detect or respond to the lowered reporting probability because the CVR prediction algorithm learning takes time. Furthermore, the auction loses its effectiveness in selecting the highest value ad, as it devolves into a competition of who can submit the largest number, considering that ğ‘ ğ‘– = ğ‘š ğ‘– ğ›¼ ğ‘– . Consequently, both advertisers may have an equal 50% chance of winning under the CPA model in the out-site scenario. So we have: Advertiser ğ‘– 's payoff, ğœ‹ ğ‘– ğ‘‚ - ğ¶ğ‘ƒğ´ = 1 2 ğ¸ ( ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ‘š ğ‘– ) . Platform's payoff, ğœ‹ ğ‘ƒ ğ‘‚ - ğ¶ğ‘ƒğ´ = 0. Social welfare, ğœ‹ ğ‘† ğ‘‚ - ğ¶ğ‘ƒğ´ = 1 2 ( ğ¸ ( ğ¶ 1 ğ‘ƒ 1 ğ‘š 1 ) + ğ¸ ( ğ¶ 2 ğ‘ƒ 2 ğ‘š 2 )) .",
  "6.3 Optimized Cost Per Click": "Recall that in OCPC, advertisers bid for conversions but pay for clicks. The auction winner, represented by ğ‘¤ = ğ‘ğ‘Ÿğ‘”ğ‘šğ‘ğ‘¥ ğ‘– Â¯ ğ‘ ğ‘– Â¯ ğ‘ ğ‘– ğ‘ ğ‘– , receives the impression and has to pay Â¯ ğ‘ ğ‘™ Â¯ ğ‘ ğ‘™ ğ‘ ğ‘™ Â¯ ğ‘ ğ‘¤ if a click occurs. Advertiser ğ‘– will also select a reporting strategy ğ›¼ ğ‘– . We aim to investigate whether this reporting strategy also results in a dysfunctional OCPC, similar to the issues observed in CPA. 6 Optimized Cost Per Click in Online Advertising: A Theoretical Analysis Conference acronym 'XX, June 03-05, 2018, Woodstock, NY Figure 2: Equilibrium Payoffs When the Outside Option ğ‘Ÿ is Varying TCPC TocPc TSPc T?cPc (1 ) (2 ) (3 ) (4 ) Given another advertiser ğ‘˜ 's equivalent bid on an impression ğ‘’ ğ‘˜ , advertiser ğ‘– 's utility is:  when advertiser ğ‘– bid ğ‘ ğ‘– per conversion in OCPC. Proposition 6.3. Under OCPC in the out-site scenario, a set of dominant strategies for advertiser ğ‘– is to bid ğ›¼ ğ‘– ğ‘ ğ‘– = ğ‘š ğ‘– . Proof. We first show that ğ›¼ ğ‘– and ğ‘ ğ‘– always appear together. So we can represent ğœ‹ ğ‘– ( ğ‘ ğ‘– , ğ›¼ ğ‘– | ğ‘’ ğ‘˜ ) by ğœ‹ ğ‘– ( ğ›¼ ğ‘– ğ‘ ğ‘– | ğ‘’ ğ‘˜ ) .   We can then deduce that ğœ‹ ğ‘– ( ğ‘š ğ‘– | ğ‘’ ğ‘˜ ) â‰¥ ğœ‹ ğ‘– ( ğ›¼ ğ‘– ğ‘ ğ‘– | ğ‘’ ğ‘˜ ) for any ğ‘’ ğ‘˜ . The full proof can be found in Appendix A.6. â–¡ Proposition 6.3 suggests that the possible bidding and reporting strategy combinations include ğ›¼ ğ‘– = 0 . 2 , ğ‘ ğ‘– = 5 ğ‘š ğ‘– and ğ›¼ ğ‘– = 0 . 5 , ğ‘ ğ‘– = 2 ğ‘š ğ‘– , among others. The truth-telling strategy, ğ›¼ ğ‘– = 1 , ğ‘ ğ‘– = ğ‘š ğ‘– , is also part of their dominant strategies. Consequently, we have Corollary 6.4. Truth-telling, i.e., bidding ğ‘ ğ‘– = ğ‘š ğ‘– and ğ›¼ ğ‘– = 1 , is a dominant strategy under OCPC in the out-site scenario. Corollary 6.4 implies that the game outcome of OCPC in the out-site scenario is identical to the in-site scenario, as the optimal bidding strategy for advertisers is always to bid their marginal gain, ğ‘š ğ‘– . Although advertisers can manipulate conversion reporting in the out-site scenario, our proofs reveal that their optimal strategies consistently correspond to no manipulation. Hence, the payoffs for each party are as follows: Advertiser ğ‘– 's payoff, ğœ‹ ğ‘– ğ‘‚ -ğ‘‚ğ¶ğ‘ƒğ¶ : ğ¸ ( ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ‘š ğ‘– -ğ¶ ğ‘˜ ğ‘ƒ ğ‘˜ ğ‘š ğ‘˜ | ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ‘š ğ‘– > ğ¶ ğ‘˜ ğ‘ƒ ğ‘˜ ğ‘š ğ‘˜ ) ğ‘ƒğ‘Ÿ ( ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ‘š ğ‘– > ğ¶ ğ‘˜ ğ‘ƒ ğ‘˜ ğ‘š ğ‘˜ ) Platform's payoff, ğœ‹ ğ‘ƒ ğ‘‚ -ğ‘‚ğ¶ğ‘ƒğ¶ = ğ¸ ( ğ‘šğ‘–ğ‘› ( ğ¶ 1 ğ‘ƒ 1 ğ‘š 1 , ğ¶ 2 ğ‘ƒ 2 ğ‘š 2 )) . Social welfare, ğœ‹ ğ‘† ğ‘‚ -ğ‘‚ğ¶ğ‘ƒğ¶ = ğ¸ ( ğ‘šğ‘ğ‘¥ ( ğ¶ 1 ğ‘ƒ 1 ğ‘š 1 , ğ¶ 2 ğ‘ƒ 2 ğ‘š 2 )) .",
  "7 ANALYSIS": "",
  "7.1 Comparison between OCPC and CPA": "The main advantage of OCPC over CPA is its applicability to the out-site scenarios. In such scenarios, the platform's payoff under CPA, denoted as ğœ‹ ğ‘ƒ ğ‘‚ -ğ¶ğ‘ƒğ´ , is zero due to conversion reporting manipulation. However, in OCPC, even though advertisers can manipulate conversion rates, our analysis indicates that it still yields positive platform payoffs, represented as ğœ‹ ğ‘ƒ ğ‘‚ -ğ‘‚ğ¶ğ‘ƒğ¶ = ğ¸ ( ğ‘šğ‘–ğ‘› ( ğ¶ 1 ğ‘ƒ 1 ğ‘š 1 , ğ¶ 2 ğ‘ƒ 2 ğ‘š 2 )) = ğœ‹ ğ‘ƒ ğ¼ -ğ‘‚ğ¶ğ‘ƒğ¶ > 0. This outcome is consistent with the in-site scenario as well. Furthermore, the social welfare in OCPC surpasses that in CPA, as evidenced by ğœ‹ ğ‘† ğ‘‚ -ğ‘‚ğ¶ğ‘ƒğ¶ > ğœ‹ ğ‘† ğ‘‚ -ğ¶ğ‘ƒğ´ , since OCPC can effectively screen out the ad with the highest value in out-site scenarios, which CPA is unable to do. Additionally, even in the in-site scenario, OCPC achieves identical results as CPA: both the platform's payoff, ğœ‹ ğ‘ ğ¼ -ğ‘‚ğ¶ğ‘ƒğ¶ = ğœ‹ ğ‘ ğ¼ -ğ¶ğ‘ƒğ´ , the advertisers' payoffs, ğœ‹ ğ‘– ğ¼ -ğ‘‚ğ¶ğ‘ƒğ¶ = ğœ‹ ğ‘– ğ¼ -ğ¶ğ‘ƒğ´ , and the social welfare, ğœ‹ ğ‘† ğ¼ -ğ‘‚ğ¶ğ‘ƒğ¶ = ğœ‹ ğ‘† ğ¼ -ğ¶ğ‘ƒğ´ are the same. Our analysis explains why OCPC prevails over CPA in practice, given its broader applicability to out-site scenarios while maintaining the same performance in in-site scenarios as CPA. Consequently, OCPC serves as an ideal substitute for CPA.",
  "7.2 Comparison between OCPC and CPC": "First, both OCPC and CPC exhibit the desirable property that the outcomes of the out-site scenario align with those of the in-site scenario. This property ensures their broad applicability across various situations. Weproceed to compare the payoffs for each party between OCPC and CPC. We have the following lemma: Lemma 7.1. The social welfare in OCPC is greater than in CPC:  The reason that OCPC yields higher social welfare than CPC lies in its increased efficiency with respect to ad delivery. In OCPC, the platform is responsible for predicting CVR and can employ advanced machine learning techniques to accurately determine the CVR and identify the most valuable ad. In contrast, CPC requires advertisers to estimate their CVR through crude averaging methods. However, we also have: 7 Conference acronym 'XX, June 03-05, 2018, Woodstock, NY Kaichen Zhang 1 , Zixuan Yuan 2 , Hui Xiong 1 , 3 , âˆ— Lemma 7.2. The platform's expected payoff in OCPC is less than in CPC:   The intuition behind Lemmas 7.1 and 7.2 can be illustrated by considering the example of rolling two dice. The expected value of the maximum of these two dice (approximately 4 . 47) should be greater than the maximum of the expected value of two dice (max3 . 5 , 3 . 5 = 3 . 5). Conversely, the expected value of the minimum of these two dice (around 2 . 53) should be less than the minimum of the expected value of two dice (3 . 5). At first glance, Lemma 7.2 may suggest that platforms should opt for CPC over OCPC, as CPC yields a higher platform payoff. However, this is not universally true. The current comparison between OCPC and CPC is based on the subgames in which advertisers have already decided to participate in the auction. Advertiser 2 possesses an outside option, ğ‘Ÿ , and will choose not to enter the auction if the expected payoff is less than ğ‘Ÿ . Furthermore, we have: Lemma 7.3. The advertisers' expected payoff in OCPC is greater than in CPC:   Lemma 7.3 is based on the intuition that social welfare is the sum of platform payoff and advertiser payoff. CPC results in a lower social welfare and a higher platform payoff, which consequently leads to a lower advertiser payoff. The formal proofs of the three lemmas are given in Appendix A.7, A.8, and A.9. Lemma 7.3 suggests that if ğœ‹ 2 ğ‘‚ğ¶ğ‘ƒğ¶ > ğ‘Ÿ > ğœ‹ 2 ğ¶ğ‘ƒğ¶ , advertiser 2 will enter the OCPC auction but not the CPC auction because its payoff in CPC is lower than its outside option. Consequently, advertiser 2's absence from the auction would lead to a decrease in platform payoffs under the CPC model. Our analysis illuminates the trade-offs between OCPC and CPC models. Platforms can achieve higher payoffs by adopting OCPC, as it can draw a larger number of advertisers by providing them with increased payoffs. However, if advertisers have less competitive alternative options and consistently opt for the focal platform, the platform may be able to attain higher payoffs using the CPC model.",
  "7.3 Optimal Pricing Model for Platforms": "We then generalize our findings for the optimal pricing model selection among a set of pricing models, by solving the second and first stages of our game. In the second stage, given that the platform has selected pricing model ğ‘‹ , advertiser 2 will participate in the auction if and only if its payoffs from the auction exceed its outside option ğ‘Ÿ :  Conversely, advertiser 1 consistently enters the auction as it does not have an outside option. This necessitates that the platform opts for a pricing model ensuring advertiser 2's participation in the auction. If only advertiser 1 is present, the platform will invariably receive zero payoffs due to the second-price auction. As a result, in the first stage, the platform selects a pricing model that guarantees advertiser 2's involvement in the auction first and then maximizes its payoffs. The optimal pricing model is  This equation indicates that if a platform impulsively shifts to a pricing model featuring higher platform payoffs but lower advertiser payoffs, it might mistakenly perceive an increase in payoffs through A/B testing. However, its payoffs will ultimately decline as some advertisers with budget constraints opt to leave the platform. Our analysis suggests that platforms maintain a balance between platform payoffs with a predetermined number of advertisers and advertiser payoffs that draw in more advertisers. When user value is substantial, advertisers will naturally join the platform, enabling pricing models with high platform payoffs. Conversely, platforms should adopt pricing models with high advertiser payoffs to enhance their payoffs in an alternative manner.",
  "7.4 Equilibrium": "We further examine the game's equilibriums under various outside options ğ‘Ÿ . Figure 2 illustrates each party's payoff under different outside options in the out-site scenario. Specifically, Figure 2 (1) to (4) show the platform's payoff, social welfare, advertiser 1's payoff, and advertiser 2's payoff, respectively. As seen in Figure 2, when ğ‘Ÿ < ğœ‹ 2 ğ¶ğ‘ƒğ¶ , the platform selects CPC. When ğœ‹ 2 ğ¶ğ‘ƒğ¶ < ğ‘Ÿ < ğœ‹ 2 ğ‘‚ğ¶ğ‘ƒğ¶ , the platform selects OCPC. For ğ‘Ÿ > ğœ‹ 2 ğ‘‚ğ¶ğ‘ƒğ¶ , the platform exhibits indifference between pricing models as the payoffs remain consistently zero. The shaded region in vertical lines highlights the benefits from OCPC's innovation. Prior to OCPC's development, the platform would incur no payoff when ğœ‹ 2 ğ¶ğ‘ƒğ¶ < ğ‘Ÿ < ğœ‹ 2 ğ‘‚ğ¶ğ‘ƒğ¶ , as advertiser 2 would abstain from entering the auction. This shaded region depicted in Figure 2 (1) signifies the enhancement in platform payoffs due to OCPC, indicating that developing a new pricing model that yields higher advertiser payoffs is advantageous for platforms. Interestingly, not all parties benefit from OCPC. The dotted region in Figure 2 (3) signifies a decrease in advertiser 1's payoff. This outcome occurs because OCPC introduces more competitors for those who consistently participate in auctions. As competition intensifies, bidding becomes more aggressive, leading to higher costs and subsequently reducing payoffs for these advertisers.",
  "7.5 Managerial Implications": "Firstly, platforms can increase their payoffs by appropriately shifting their focus from CTR and CVR prediction to improving CTR and CTR. Overemphasizing CTR and CVR prediction and ad ranking may lead to diminishing returns because there is an upper bound on the platform's payoff, in which each ad is ranked accurately based on its value. On the other hand, improving CTR and CVR boost payoffs in two ways: enhancing ğ¶ ğ‘– or ğ‘ƒ ğ‘– directly increases both ğœ‹ ğ‘ƒ ğ¶ğ‘ƒğ¶ and ğœ‹ ğ‘ƒ ğ‘‚ğ¶ğ‘ƒğ¶ and attracts more advertisers by shifting ğœ‹ 2 ğ¶ğ‘ƒğ¶ and ğœ‹ 2 ğ‘‚ğ¶ğ‘ƒğ¶ to the right. To achieve this, platforms can expand their high net worth user base, make ads more contextually relevant to 8 Optimized Cost Per Click in Online Advertising: A Theoretical Analysis Conference acronym 'XX, June 03-05, 2018, Woodstock, NY their services, and improve ad quality. The role of algorithms in facilitating these improvements remains a promising direction for future research. Secondly, platforms can increase their payoffs by indirectly reducing advertisers' outside options. One potential approach involves offering subsidies or coupons to advertisers. For instance, if ğ‘Ÿ = ğœ‹ 2 ğ‘‚ğ¶ğ‘ƒğ¶ , advertiser 2 will not enter the auction, resulting in no payoff for the platform. However, providing a small subsidy, ğœ– , to advertiser 2 will result in their participation in the auction, and the platform will receive a payoff of ğœ‹ ğ‘ƒ ğ‘‚ğ¶ğ‘ƒğ¶ -ğœ– . The primary challenge in delivering subsidies lies in identifying deserving advertisers and determining the minimum subsidy amount, given that advertisers are highly strategic in such games. Figure 3: Cost Per Shopping Cart (CPSC) Example Lastly, platforms can increase their payoffs by developing new pricing models wherein advertisers bid for intermediate outcomes between clicks and conversions. For example, we can develop a pricing model for online retailers called Cost Per Shopping Cart (CPSC), where advertisers bid for instances when a user adds a product to their shopping cart and they pay for clicks or impressions. As illustrated in Figure 3, CPSC attracts more advertisers than CPC and generates higher platform payoffs than OCPC. The shaded region represents its benefits.",
  "8 CONCLUSION": "In conclusion, this paper pioneers the study of the Optimized Cost Per Click (OCPC) pricing model in online advertising from an economic perspective. This paper identifies two key factors contributing to OCPC's prevalence: its versatility in out-site scenarios when advertisers can manipulate conversion reporting and its ability to attract more advertisers with outside options. This paper sheds light on the optimal pricing model selection for online advertising platforms and offers suggestions to further improve their payoffs.",
  "ACKNOWLEDGMENTS": "This work was inspired during Kaichen Zhang's internship at Bytedance. Thanks to Hongyi Zhang, Dingkun Hong, and the Bytedance Adscore team for their help.",
  "REFERENCES": "[1] Nikhil Agarwal, Susan Athey, and David Yang. 2009. Skewed bidding in pay-peraction auctions for online advertising. American Economic Review 99, 2 (2009), 441-47. [2] Kursad Asdemir, Nanda Kumar, and Varghese S Jacob. 2012. Pricing models for online advertising: CPM vs. CPC. Information Systems Research 23, 3-part-1 (2012), 804-822. [3] Interactive Advertising Bureau. 2022. Internet Advertising Revenue Report. https://www.iab.com/wp-content/uploads/2023/04/IAB_PwC_Internet_ Advertising_Revenue_Report_2022.pdf. [4] Xiaoyong Cao and Guoqiang Tian. 2013. Second-Price Auctions with Different Participation Costs. Journal of Economics & Management Strategy 22, 1 (2013), 184-205. [5] Hana Choi, Carl F Mela, Santiago R Balseiro, and Adam Leary. 2020. Online display advertising markets: A literature review and future directions. Information Systems Research 31, 2 (2020), 556-575. [6] Edward H Clarke. 1971. Multipart pricing of public goods. Public choice (1971), 17-33. [7] Benjamin Edelman, Michael Ostrovsky, and Michael Schwarz. 2007. Internet advertising and the generalized second-price auction: Selling billions of dollars worth of keywords. American economic review 97, 1 (2007), 242-259. [8] Theodore Groves. 1973. Incentives in teams. Econometrica: Journal of the Econometric Society (1973), 617-631. [9] Yu Hu, Jiwoong Shin, and Zhulei Tang. 2016. Incentive problems in performancebased online advertising pricing: Cost per click vs. cost per action. Management Science 62, 7 (2016), 2022-2038. [10] Yu Jeffrey Hu. 2004. Performance-based pricing models in online advertising. Available at SSRN 501082 (2004). [11] Aditya Jain and Sahil Khan. 2021. Optimizing Cost per Click for Digital Advertising Campaigns. arXiv preprint arXiv:2108.00747 (2021). [12] Todd Kaplan and Aner Sela. 2022. Second-Price Auctions with Private Entry Costs. Games 13, 5 (2022), 62. [13] Oliver Kirchkamp, Eva Poen, and J Philipp Reiss. 2009. Outside options: Another reason to choose the first-price auction. European Economic Review 53, 2 (2009), 153-169. [14] Dan Levin and James L Smith. 1994. Equilibrium in auctions with entry. The American Economic Review (1994), 585-599. [15] De Liu and Siva Viswanathan. 2014. Information asymmetry and hybrid advertising. Journal of Marketing Research 51, 5 (2014), 609-624. [16] Quan Lu, Shengjun Pan, Liang Wang, Junwei Pan, Fengdan Wan, and Hongxia Yang. 2017. A practical framework of conversion rate prediction for online display advertising. In Proceedings of the ADKDD'17 . 1-9. [17] Roger B Myerson. 1981. Optimal auction design. Mathematics of operations research 6, 1 (1981), 58-73. [18] Petros Petsinis, Kaichen Zhang, Andreas Pavlogiannis, Jingbo Zhou, and Panagiotis Karras. 2024. Robust Reward Placement under Uncertainty. arXiv preprint arXiv:2405.05433 (2024). [19] Pingzhong Tang, Xun Wang, Zihe Wang, Yadong Xu, and Xiwang Yang. 2020. Optimized Cost per Mille in Feeds Advertising. In Proceedings of the 19th International Conference on Autonomous Agents and MultiAgent Systems . 1359-1367. [20] Hal R Varian. 2007. Position auctions. international Journal of industrial Organization 25, 6 (2007), 1163-1178. [21] Hal R Varian. 2016. How to build an economic model in your spare time. The American Economist 61, 1 (2016), 81-90. [22] William Vickrey. 1961. Counterspeculation, auctions, and competitive sealed tenders. The Journal of finance 16, 1 (1961), 8-37. [23] Shuai Yuan, Jun Wang, and Xiaoxue Zhao. 2013. Real-time bidding for online advertising: measurement and analysis. In Proceedings of the seventh international workshop on data mining for online advertising . 1-8. [24] Kaichen Zhang, Jingbo Zhou, Donglai Tao, Panagiotis Karras, Qing Li, and Hui Xiong. 2020. Geodemographic influence maximization. In Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining . 2764-2774. [25] Han Zhu, Junqi Jin, Chang Tan, Fei Pan, Yifan Zeng, Han Li, and Kun Gai. 2017. Optimized cost per click in taobao display advertising. In Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining . 2191-2200. [26] Yi Zhu and Kenneth C Wilbur. 2011. Hybrid advertising auctions. Marketing Science 30, 2 (2011), 249-273. 9 Conference acronym 'XX, June 03-05, 2018, Woodstock, NY Kaichen Zhang 1 , Zixuan Yuan 2 , Hui Xiong 1 , 3 , âˆ—",
  "A APPENDIX": "",
  "A.1 Other Pricing Models": "The definition of CPM and OCPM is included in this section. Their analysis is analogous to CPC and OCPC. A.1.1 Cost Per Mille . In CPM, advertisers bid for impressions and pay for impressions. As advertisers bid for impressions, the platform predicts advertiser ğ‘– 's equivalent bid on an impression as ğ‘’ ğ‘– = ğ‘ ğ‘– . As advertisers pay for impressions, the auction winner has to pay ğ‘ ğ‘™ after the ad display. The loser pays 0. A.1.2 Optimized Cost Per Mille . In OCPM, advertisers bid for conversions but pay for impressions. As advertisers bid for conversions, the platform's prediction on advertiser ğ‘– 's equivalent bid on an impression is ğ‘’ ğ‘– = Â¯ ğ‘ ğ‘– Â¯ ğ‘ ğ‘– ğ‘ ğ‘– . As advertisers pay for impressions, the auction winner has to pay Â¯ ğ‘ ğ‘™ Â¯ ğ‘ ğ‘™ ğ‘ ğ‘™ immediately after the ad display. The loser pays 0.",
  "A.2 Assumption Justification": "We justify the assumptions made in this paper: (1) Advertiser 1 has no outside option, while advertiser 2 has an outside option ğ‘Ÿ : refer to Section 4.1. (2) The platform's decisions are based on its predictions of ğ‘ ğ‘– and ğ‘ ğ‘– : In the real world, ads are ranked by platforms according to CTR/CVR predictions. (3) Advertisers make decisions based on the distribution of ğ¶ ğ‘– and ğ‘ƒ ğ‘– ...: In the real world, advertisers make decisions based on their CTR/CVR, evidenced by various CTR/CVR statics in advertiser panels offered by platforms. (4) ... and their belief in the accuracy of the platform's predictions: Advertisers can't know the real value of the platform's predictions and can only form belief instead. (5) The platform's predictions are accurate, with Â¯ ğ‘ ğ‘– = ğ‘ ğ‘– and Â¯ ğ‘ ğ‘– = ğ‘ ğ‘– : Platforms in the real world optimize their predictions to be accurate. This assumption is made for the sake of mathematical convenience. (6) ... and advertisers' beliefs are consistent, with Â¯ ğ¶ ğ‘– = ğ¶ ğ‘– and Â¯ ğ‘ƒ ğ‘– = ğ‘ƒ ğ‘– : advertisers should form a Rational Expectation, consistent with the truth. (7) Â¯ ğ‘ ğ‘– = ğ‘ ğ‘– , Â¯ ğ‘ ğ‘– = ğ›¼ ğ‘– ğ‘ ğ‘– , Â¯ ğ¶ ğ‘– = ğ¶ ğ‘– and Â¯ ğ‘ƒ ğ‘– = ğ›¼ ğ‘– ğ‘ƒ ğ‘– : Previous assumptions' out-site scenario version.",
  "A.3 Proof of Proposition 5.2": "We show that ğœ‹ ğ‘– ( ğ‘š ğ‘– | ğ‘’ ğ‘˜ ) â‰¥ ğœ‹ ğ‘– ( ğ‘ ğ‘– | ğ‘’ ğ‘˜ ) for any ğ‘’ ğ‘˜ . When ğ‘ ğ‘– > ğ‘š ğ‘– ,       So ğœ‹ ğ‘– ( ğ‘š ğ‘– | ğ‘’ ğ‘˜ ) > = ğœ‹ ğ‘– ( ğ‘ ğ‘– | ğ‘’ ğ‘˜ ) for any ğ‘’ ğ‘˜ .",
  "A.4 Proof of Proposition 5.3": "We show that ğœ‹ ğ‘– ( ğ‘š ğ‘– | ğ‘’ ğ‘˜ ) â‰¥ ğœ‹ ğ‘– ( ğ‘ ğ‘– | ğ‘’ ğ‘˜ ) for any ğ‘’ ğ‘˜ . When ğ‘ ğ‘– > ğ‘š ğ‘– , ğœ‹ ğ‘– ( ğ‘ ğ‘– | ğ‘’ ğ‘˜ )  + ğ‘ƒğ‘Ÿ ( Â¯ ğ¶ ğ‘– Â¯ ğ‘ƒ ğ‘– ğ‘ ğ‘– > ğ‘’ ğ‘˜ > Â¯ ğ¶ ğ‘– Â¯ ğ‘ƒ ğ‘– ğ‘š ğ‘– )   = ğœ‹ ğ‘– ( ğ‘š ğ‘– | ğ‘’ ğ‘˜ ) When ğ‘ ğ‘– < ğ‘š ğ‘– ,     = ğœ‹ ğ‘– ( ğ‘ ğ‘– | ğ‘’ ğ‘˜ ) So ğœ‹ ğ‘– ( ğ‘š ğ‘– | ğ‘’ ğ‘˜ ) > = ğœ‹ ğ‘– ( ğ‘ ğ‘– | ğ‘’ ğ‘˜ ) for any ğ‘’ ğ‘˜ .",
  "A.5 Proof of Proposition 6.2": "Suppose there exists an equilibrium, where advertiser ğ‘– 's reporting strategy is ğ›¼ ğ‘– âˆ— . Then, there is Â¯ ğ‘ ğ‘– = ğ›¼ ğ‘– âˆ— ğ‘ ğ‘– and Â¯ ğ‘ƒ ğ‘– = ğ›¼ ğ‘– âˆ— ğ‘ƒ ğ‘– accordingly in this equilibrium. If ğ›¼ ğ‘– âˆ— = 0, then Â¯ ğ‘ ğ‘– = 0 and ğ‘’ ğ‘– = 0. Advertiser ğ‘– will always lose the auction and have a 0 utility. Thus, advertiser ğ‘– can deviate to a positive ğ›¼ ğ‘– âˆ— to have a positive utility. If ğ›¼ ğ‘– âˆ— > 0, we show that given an ğ›¼ ğ‘– > 0, the optimal ğ‘ ğ‘– = ğ‘š ğ‘– ğ›¼ ğ‘– , i.e., ğœ‹ ğ‘– ( ğ‘š ğ‘– ğ›¼ ğ‘– , ğ›¼ ğ‘– | ğ‘’ ğ‘˜ ) â‰¥ ğœ‹ ğ‘– ( ğ‘ ğ‘– , ğ›¼ ğ‘– | ğ‘’ ğ‘˜ ) for any ğ‘’ ğ‘˜ . 10 Conference acronym 'XX, June 03-05, 2018, Woodstock, NY Optimized Cost Per Click in Online Advertising: A Theoretical Analysis    + ğ‘ƒğ‘Ÿ ( Â¯ ğ¶ ğ‘– Â¯ ğ‘ƒ ğ‘– ğ‘ ğ‘– > ğ‘’ ğ‘˜ > Â¯ ğ¶ ğ‘– Â¯ ğ‘ƒ ğ‘– ğ‘š ğ‘– ğ›¼ ğ‘– )    When ğ‘ ğ‘– < ğ‘š ğ‘– ğ›¼ ğ‘– ,      So ğœ‹ ğ‘– ( ğ‘š ğ‘– ğ›¼ ğ‘– , ğ›¼ ğ‘– | ğ‘’ ğ‘˜ ) â‰¥ ğœ‹ ğ‘– ( ğ‘ ğ‘– , ğ›¼ ğ‘– | ğ‘’ ğ‘˜ ) for any ğ‘’ ğ‘˜ . Then, when ğ‘ ğ‘– = ğ‘š ğ‘– ğ›¼ ğ‘– , ğœ‹ ğ‘– ( ğ›¼ ğ‘– | ğ‘’ ğ‘˜ )   Note that ğœ‹ ğ‘– increases when ğ›¼ ğ‘– decreases. By deviating to ğ›¼ ğ‘– = ğœ–ğ›¼ ğ‘– âˆ— where 0 < ğœ– < 1, advertiser ğ‘– gets a higher utility.",
  "A.6 Proof of Proposition 6.3": "Wefirst show that ğ›¼ ğ‘– and ğ‘ ğ‘– always appear together. So we represent ğœ‹ ğ‘– ( ğ‘ ğ‘– , ğ›¼ ğ‘– | ğ‘’ ğ‘˜ ) by ğœ‹ ğ‘– ( ğ›¼ ğ‘– ğ‘ ğ‘– | ğ‘’ ğ‘˜ ) for convenience.   We then show that ğœ‹ ğ‘– ( ğ‘š ğ‘– | ğ‘’ ğ‘˜ ) â‰¥ ğœ‹ ğ‘– ( ğ›¼ ğ‘– ğ‘ ğ‘– | ğ‘’ ğ‘˜ ) for any ğ‘’ ğ‘˜ . When ğ›¼ ğ‘– ğ‘ ğ‘– > ğ‘š ğ‘– , ğœ‹ ğ‘– ( ğ›¼ ğ‘– ğ‘ ğ‘– | ğ‘’ ğ‘˜ )  + ğ‘ƒğ‘Ÿ ( Â¯ ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ›¼ ğ‘– ğ‘ ğ‘– > ğ‘’ ğ‘˜ > Â¯ ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ‘š ğ‘– )  < = ğ‘ƒğ‘Ÿ ( Â¯ ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ‘š ğ‘– > ğ‘’ ğ‘˜ ) ğ¸ ( ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ‘š ğ‘– -ğ¶ ğ‘– ğ‘’ ğ‘˜ Â¯ ğ¶ ğ‘– | Â¯ ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ‘š ğ‘– > ğ‘’ ğ‘˜ ) = ğœ‹ ğ‘– ( ğ‘š ğ‘– | ğ‘’ ğ‘˜ ) When ğ›¼ ğ‘– ğ‘ ğ‘– < ğ‘š ğ‘– , ğœ‹ ğ‘– ( ğ‘š ğ‘– | ğ‘’ ğ‘˜ )  + ğ‘ƒğ‘Ÿ ( Â¯ ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ›¼ ğ‘– ğ‘ ğ‘– < ğ‘’ ğ‘˜ < Â¯ ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ‘š ğ‘– )",
  "A.7 Proof of Lemma 7.1": "> 0 because ğ‘– = ğ‘ğ‘Ÿğ‘”ğ‘šğ‘ğ‘¥ ğ‘˜ ğ¶ ğ‘˜ ğ‘ƒ ğ‘˜ ğ‘š ğ‘˜ .",
  "A.8 Proof of Lemma 7.2": "< 0 because ğ‘– = ğ‘ğ‘Ÿğ‘”ğ‘šğ‘–ğ‘› ğ‘˜ ğ¶ ğ‘˜ ğ‘ƒ ğ‘˜ ğ‘š ğ‘˜ . 11 Conference acronym 'XX, June 03-05, 2018, Woodstock, NY Kaichen Zhang 1 , Zixuan Yuan 2 , Hui Xiong 1 , 3 , âˆ—",
  "A.9 Proof of Lemma 7.3": "If advertiser ğ‘– wins in both OCPC and CPC, its payoffs are the same ( ğ¶ ğ‘– ğ‘ƒ ğ‘– ğ‘š ğ‘– -ğ¶ ğ‘˜ ğ‘ƒ ğ‘˜ ğ‘š ğ‘˜ ) in both OCPC and CPC. If advertiser ğ‘– loses in both OCPC and CPC, its payoffs are also the same (0). The contribution of such cases to ğœ‹ ğ‘– ğ‘‚ğ¶ğ‘ƒğ¶ -ğœ‹ ğ‘– ğ¶ğ‘ƒğ¶ is 0. As a result,  because both terms are positive.",
  "A.10 Extensions": "A.10.1 Repeated Auctions . Weextend our model to the repeated auction setting, i.e., multiple auctions are in the game. Specifically, the timeline of the new game is as follows: (1) The platform selects a model among CPC, CPA, or OCPC. (2) Advertiser 2 determines whether to enter the auction. (3) Advertisers select their bids and, if in the out-site scenario, also decide on their reporting strategy ğ›¼ ğ‘– . (4) The actual values of ğ‘ ğ‘– and ğ‘ ğ‘– are realized, while the platform predicts Â¯ ğ‘ ğ‘– and Â¯ ğ‘ ğ‘– , and calculates ğ‘’ ğ‘– . (5) The platform identifies the auction winner ( ğ‘¤ = ğ‘ğ‘Ÿğ‘”ğ‘šğ‘ğ‘¥ ğ‘– ğ‘’ ğ‘– ) and display its ad. (6) The winner makes payments and all parties realize payoffs. (7) The steps (3) to (6) will be repeated ğ‘‡ times. Compared to the original game, the new game now has ğ‘‡ auctions. The overall utility of the game is the sum of the utility of each auction. We show that the repeated auction setting has the same bidding strategies as the original setting. Using CPC as an example, the utility of advertiser ğ‘– is:  where another advertiser ğ‘˜ 's equivalent bid on an impression in auction ğ‘¡ is ğ‘’ ğ‘˜ ğ‘¡ , and advertiser ğ‘– bid in auction ğ‘¡ is ğ‘ ğ‘– ğ‘¡ . We notice that bidding ğ‘ ğ‘– ğ‘¡ = ğœ‡ ğ‘ ğ‘– ğ‘š ğ‘– is the dominant strategy in each auction, regardless of how others bid ( ğ‘’ ğ‘˜ ğ‘¡ ). As a result, we have:  where advertiser ğ‘– 's utility in the repeated auctions setting is exactly ğ‘‡ times the original setting. Consequently, the platform's utility is also ğ‘‡ times as much as before. The above analysis demonstrates that the analysis applied to the original setting also applies to the repeated auctions setting, since each agent's utility is scaled up by a factor of ğ‘‡ . A.10.2 Multiple Advertisers . We extend our model to the multiple advertiser setting, where there are ğ‘ advertisers in the game. We show that our main insights also hold in the multiple advertiser setting: for online advertising platforms, (1) OCPC dominates CPA; (2) OCPC does not dominate CPC. We define the highest equivalent bid on an impression of other advertisers as ğ‘’ -ğ‘– for advertiser ğ‘– . By its definition,  In the in-site scenario, advertiser ğ‘– 's utility in CPA and OCPC are respectively   and and   Similarly, in the out-site scenario, advertiser ğ‘– 's utility in CPA and OCPC are respectively     Note that the utility of advertiser ğ‘– in the multiple advertiser setting can be derived by simply replacing ğ‘’ ğ‘˜ with ğ‘’ -ğ‘– . This is because the second-price auction format ensures that whether advertiser ğ‘– wins or loses, and how much it pays, depends only on the highest one among the others. Consequently, the proofs in the original setting also apply to the multiple advertiser setting by replacing ğ‘’ ğ‘˜ with ğ‘’ -ğ‘– . As a result, OCPC also dominates CPA, given its broader applicability to out-site scenarios while maintaining the same performance in in-site scenarios as CPA. To show that OCPC does not dominate CPC, we should find a counterexample where CPC leads to a higher payoff than OCPC for platforms. Obviously, by setting ğ‘ = 2, we have found such a counterexample in this paper's main body. 12",
  "keywords_parsed": [
    "online advertising",
    " optimized cost per mille",
    " optimized cost per click",
    " OCPM",
    " OCPC",
    " pricing models"
  ]
}