{"OpenSiteRec: An Open Dataset for Site Recommendation": "", "Xinhang Li ∗": "Tsinghua Univerisity Beijing, China xh-li20@mails.tsinghua.edu.cn Xiangyu Zhao City Univerisity of Hong Kong Hong Kong xianzhao@cityu.edu.hk Yejing Wang City Univerisity of Hong Kong Hong Kong yejing.wang@my.cityu.edu.hk Yu Liu Tsinghua University Beijing, China liuyu2419@126.com Yong Li Tsinghua University Beijing, China liyong07@tsinghua.edu.cn Cheng Long † Nanyang Technological University Singapore c.long@ntu.edu.sg", "Yong Zhang †": "Tsinghua Univerisity Beijing, China zhangyong05@tsinghua.edu.cn Chunxiao Xing Tsinghua Univerisity Beijing, China xingcx@tsinghua.edu.cn", "ABSTRACT": "As a representative information retrieval task, site recommendation, which aims at predicting the optimal sites for a brand or an institution to open new branches in an automatic data-driven way, is beneficial and crucial for brand development in modern business. However, there is no publicly available dataset so far and most existing approaches are limited to an extremely small scope of brands, which seriously hinders the research on site recommendation. Therefore, we collect, construct and release an open comprehensive dataset, namely OpenSiteRec, to facilitate and promote the research on site recommendation. Specifically, OpenSiteRec leverages a heterogeneous graph schema to represent various types of real-world entities and relations in four international metropolises. To evaluate the performance of the existing general methods on the site recommendation task, we conduct benchmarking experiments of several representative recommendation models on OpenSiteRec. Furthermore, we also highlight the potential application directions to demonstrate the wide applicability of OpenSiteRec. We believe that our OpenSiteRec dataset is significant and anticipated to encourage the development of advanced methods for site recommendation. OpenSiteRec is available online at https://OpenSiteRec.github.io/.", "CCS CONCEPTS": "", "· Information systems → Data mining ; Business intelligence ; Learning to rank ; Recommender systems ; Location based services .": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. © 2018 Association for Computing Machinery. ACM ISBN 978-1-4503-XXXX-X/18/06...$15.00 https://doi.org/XXXXXXX.XXXXXXX", "KEYWORDS": "site recommendation, dataset, heterogeneous graph, benchmark", "ACMReference Format:": "Xinhang Li, Xiangyu Zhao, Yejing Wang, Yu Liu, Yong Li, Cheng Long, Yong Zhang, and Chunxiao Xing. 2018. OpenSiteRec: An Open Dataset for Site Recommendation. In Proceedings of Make sure to enter the correct conference title from your rights confirmation emai (Conference acronym 'XX). ACM, New York, NY, USA, 14 pages. https://doi.org/XXXXXXX.XXXXXXX", "1 INTRODUCTION": "In modern business, selecting an optimal site to open a new branch is definitely crucial for the development of a brand or an institution [19, 21, 71]. An appropriate site will bring substantial profits while an inappropriate site may lead to business failure [29, 58, 59]. Thus, properly determining the best choice from so many candidate sites is quite important yet complex, since it needs to take many factors into accounts [40, 41, 55], such as the brand types and the population surrounding the site. Typically, this task is mainly accomplished by the professional consulting or marketing departments of companies [51], which is usually labor-intensive and time-consuming. Meanwhile, human error and bias can also lead to suboptimal solutions. Therefore, it is difficult for such an artificial approach to fulfill the high demand of rapid development in modern business. Thanks to the booming development in information retrieval, automatic data-driven approaches have been introduced to assist the decision-making and reduce the cost, i.e. site recommendation [8, 26, 35]. These approaches come with a wide variety of definitions of site recommendation, including the association analysis [26] for feature selection, the rating prediction [13], the consumption prediction [36, 37] and the top-N recommendation [31, 34, 64]. While they share the idea of treating the site recommendation problem as a ranking task, their significantly different definitions make it difficult for them to be compared directly. Thus, all these works are independent of each other and they have to undesirably start from scratch instead of making continuous improvements, which is detrimental to the subsequent research on site recommendation. Meanwhile, their datasets only cover very small yet different scopes in site recommendation, such as bike sharing station [6], chain hotel [13] and online stores with courier capacity [61]. This leads to failure in utilizing comprehensive information across scopes and severe data sparsity problems in site recommendation. Even more unfortunately, none of them has released their datasets so far. In most cases, collecting data and creating dataset are necessary in research but low-yielding since the dataset is typically a fundamental part in a scientific thesis. Therefore, the lack of publicly available dataset brings inconvenience to the researchers and forces them to spend long time dealing with the dataset construction, which even hinders the development of site recommendation solutions. According to the above problems, we believe a unified definition and a comprehensive open dataset of site recommendation are necessary and crucial for the benign development of the following research on site recommendation. To this end, we propose a formal problem definition of site recommendation by jointly considering and summarizing the definitions of existing studies. Based on this problem definition, we collect, construct and release an Open benchmarking dataset for Site Rec ommendation, namely OpenSiteRec . Specifically, OpenSiteRec consists of four international metropolises, including Chicago , New York City , Singapore and Tokyo . Different from the datasets used by the existing approaches, our proposed OpenSiteRec contains all the brands and regions from all the scopes and types in the whole cities and thus yields a wide-range, much larger and more comprehensive dataset. Meanwhile, OpenSiteRec provides sufficient trustworthy commercial relationships and organizes the different types of real-world concepts into a heterogeneous graph to offer more comprehensive information. Furthermore, we also conduct benchmarking experiments of several representative baselines on OpenSiteRec to facilitate future research. Some discussions of the potential application directions of OpenSiteRec in other research areas, including brand entry forecasting and business area planning, and also the limitations of OpenSiteRec are presented to give a broader view of OpenSiteRec. The contributions of this paper are summarized as follows: · We introduce a formal definition of site recommendation by summarizing the task definitions of existing works, which unifies them to provide open benchmarks for the following research. · We collect, construct and release an open comprehensive dataset of four international metropolises, namely OpenSiteRec , to facilitate the subsequent research on site recommendation. To the best of our knowledge, OpenSiteRec is the first publicly available dataset for site recommendation. · We conduct benchmarking experiments of 16 widely-used baseline models in recommendation on OpenSiteRec, to verify their effectiveness in site recommendation and to facilitate future research for comparison. · Besides site recommendation, various other research areas such as brand expansion, urban planning and facility location can benefit from OpenSiteRec given that it embeds rich information on both commercial and geographical aspects of urban spaces.", "2 RELATED WORKS": "Site recommendation for store brands and public facilities is a widely-studied problem with strong practical significance in modern business [1] and urban planning [49]. The most seminal attempt [23, 24] proposes to investigate the potential effects of different features for retail store site identification. Following it, some data mining approaches are proposed in evaluating the correlations between the street centrality and the geographical distribution of activities in Bologna [48] and Barcelona [47]. With the booming development of machine learning algorithms, applying them for site recommendation becomes an effective and efficient solution, which has attracted increasing interest and thus yields many approaches. Unfortunately, not only their datasets are limited to small scopes but also none of them has released their datasets. The detailed comparison between the datasets of these approaches and our OpenSiteRec is shown in Table 1. Geo-Spotting [26] first extends the early data mining approaches with machine learning algorithms to better analyze the effectiveness of geographical and mobility features in site recommendation. This approach focuses on 3 fast food brands in New York City and analyzes the key factors of site recommendation separately for each brand with sufficient samples. ANNRR [6] proposes a semisupervised feature selection method on heterogeneous urban data to predict bike trip demand for the bike sharing station recommendation in two cities. In this work, the site recommendation is limited to bike sharing station. PAM [31] utilizes the traffic information with partitioning around medoids algorithm to determine the optimal location of new ambulance station. Although there are a great number of candidate regions, there are only 34 existing stations available for training that may do harm to the credibility of results. BL-G-CoSVD [64] introduces bias learning and integrates both location and commercial features into SVD to recommend the suitable shop-type for each site. Contrary to the other approaches that predict the optimal region for a given brand, this approach predicts the shop-type for a given region with only 5 candidate shoptypes so that the difficulty of this task is much lower. DD3S [60] learns to rank the candidate demand centers for two coffee shop brands and two chain hotel brands by predicting the number of customers at the given location with multiple spatial-temporal data sources. Since the candidate demand centers are predetermined by clustering the demand and supply gaps, there are only about 10 regions being determined as candidates, which is a small number. DeepStore [36] leverages a deep neural network on both dense and sparse features for predicting the consumption level of 49 stores in their surrounding areas of 13 cities to recommend the optimal site. However, the limited amount of data significantly increases the dependence of this task to the quality of features. While these approaches consider the site recommendation of different cities individually, there are also some works focusing on knowledge transfer across different cities. CityTransfer [13] transfers knowledge from a source city to a target city via both inter- and intra-city views for site recommendation of 3 chain hotel brands in a new city. Specifically, it chooses Beijing or Shanghai as the source city and Xi'an or Nanjing as the target city to improve the performance on the cities with less stores. WANT [37] employs adversarial learning to diminish the distribution discrepancy between the source city and target city for predicting the consumption of stores in given areas. Then, it ranks the candidate areas in the target city according to the consumption for site recommendation. Similar to DeepStore, the dataset used by WANT is also small in size. Despite their success, all these traditional site recommendation approaches rely heavily on feature engineering with simple model structures, especially the fine-grained manually-crafted features [13, 26, 36, 37, 60, 64], which are hard to design and may introduce human biases. Different from them, the recent approaches pay efforts in utilizing complex models to automatically capture the latent features from multi-source data for site recommendation, which is a new research trend of site recommendation. UrbanKG [34] constructs a knowledge graph from urban data, built upon which a relational graph neural network model is designed for efficient and effective site recommendation. UrbanKG utilizes a comprehensive dataset and the well-defined data structure is suitable for the research of site recommendation. However, this dataset focuses on the giant brands and has not been released for publicly available. 𝑂 2 -SiteRec [61] conducts site recommendation by ranking the candidate regions with order number and delivery time from the courier capacity perspective in Online-to-Offline (O2O) stores of delivery platforms. This approach only uses the data of a small scope of brands from a single city, which is not sufficient. UUKG [42] proposes an urban knowledge graph as the foundation for downstream spatial-temporal prediction tasks. Although UUKG is not designed for site recommendation, the link prediction task on it shares many similarities with site recommendation. Differently, it only have 15 broad categories to distinguish the POIs rather than fine-grained brands and more than 80% of the POIs are from merely 2 categories. Therefore, the vanilla UUKG is not sufficient to well support site recommendation. Compared with their datasets, our proposed OpenSiteRec has outstanding superiorities from four perspectives: · Wide-range and Large-scale : Existing site recommendation approaches mainly consider a small range of brands or focus on a specific scenario, such as chain hotel and courier capacity. Therefore, they usually collect data only for the specific demand, which yields a small size of data in the final task. In contrast, OpenSiteRec takes all the brands and regions in the city into account and thus yields much larger data size. · Rich Commercial Features : Existing approaches focus more on leveraging the features of regions for prediction while paying less attention to the features of brands. In contrast, OpenSiteRec provides more commercial features of brands and institutions via various types of relations among them. POI Brand Region BrandOf LocateAt Business Area Category Broad Medium Narrow BelongTo CategoryOf Geographical Commercial Competitive / Related NearBy / Similar · Comprehensive Information : Most of the existing approaches manually define the fine-grained features using original geographical and demographical information, which may lead to human bias and information loss. In contrast, OpenSiteRec models the data as a heterogeneous graph with different types of nodes and edges, which provides more comprehensive information, such as the competitive relations between brands, along with the original features. for site recommendation task by considering the common parts among all the definitions of existing works as follows. · Publicly Available : None of the existing studies have released their datasets. To the best of our knowledge, OpenSiteRec is the first publicly available dataset for site recommendation. The released OpenSiteRec dataset will encourage continuous research in site recommendation.", "3 DATA DESCRIPTION": "In this section, we will first introduce the schema definition to better illustrate the overview of OpenSiteRec. Then, we will describe the whole process of data construction in detail. Finally, we will provide the statistics along with the usage of OpenSiteRec.", "3.1 Problem Definition": "While most of the existing works formulate the site recommendation as a ranking task ultimately, their data is usually used for a specific purpose and thus it yields different definitions of site recommendation, such as store-type recommendation [64], consumption level prediction [36] and knowledge graph link prediction [34]. From the higher level of perspective in abstraction, all these existing definitions of site recommendation share the same prototype. No matter what kinds of aspects of information they use or forms of task they apply, the ultimate objective of them is the same to obtain the ranking list of sites. Since there is no precise consentient definition of site recommendation, we propose a formal definition Definition 3.1. Let B = { 𝑏 1 , 𝑏 2 , ..., 𝑏 𝑀 } denote the brand set with 𝑀 brands and R = { 𝑟 1 , 𝑟 2 , ..., 𝑟 𝑁 } denote the region set with 𝑁 regions. Each POI that belongs to brand 𝑏 𝑖 and locates at region 𝑟 𝑗 contributes to a value 𝑃 𝑖 𝑗 = 1 in the matrix P = { 0 , 1 } ∈ R 𝑀 × 𝑁 . Therefore, the site recommendation task aims at predicting a ranking list of candidate regions for each given brand. Different from the definitions of other studies, our definition is more general that unifies the different concepts, such as brand, store and shop type, and requires no additional definition, e.g. the relation in knowledge graph link prediction. Moreover, such a definition is more straightforward that directly considers the ultimate ranking objective rather than converting the other objectives to ranking.", "3.2 Schema Definition": "In order to clarify the goal of data to collect and the final structure of dataset to construct, we deliver a schema as shown in Figure 1 for illustration. Such an overall schema has a graph structure, which consists of different types of entities to represent the real-world concepts and different types of edges between entities to indicate the commercial or geographical relations. Since there is much different domain-specific information for each kind of brands or scenarios that provides additional complexity as mentioned above, such as the house price in site recommendation for chain hotel brands [13], we only consider the general and fundamental information in OpenSiteRec according to our proposed problem definition. Based on this schema, we elaborate the definition of each kind of entities and relations in details in the following paragraphs. To be in line with the aforementioned problem and schema definition, we first define five types of entities to denote the realworld concepts following UrbanKG [34]: · Brand : Brands denote either commercial brands in business that own multiple branches, e.g., Starbucks and Apple, or institutions that refer to special functions, e.g., Columbia University and United States Postal Service. · Related : This commercial relation means that two different brands belong to the same company or group, e.g., KFC and Pizza Hut both belong to Yum! Brands. · Category : Categories represent the functions of the venues. Due to the significant functional differences between venues, we define three levels of categories (broad, medium and narrow) for classification. For example, a Starbucks store has the categories of 'Food and Beverage', 'Beverage Shop' and 'Coffee and Tea Shop' for broad, medium and narrow respectively. · POI : POIs are the basic functional venues in a city, such as shops, restaurants and schools. Each POI has sufficient commercial and geographical information. · Business Area : Business areas denote the special planned areas for business to form the scale effect, where the venues are usually very dense. · Region : Regions refer to the geographical divisions planned by the city governments. The principle and granularity of region division varies depending on the city governments. For example, the regions in Chicago are relatively large with only numbers for reference while the regions in Tokyo are much smaller with specific names like 'Ginza 1 Ch¯ ome'. Specifically, these five types of entities can be further categorized into three aspects by the types of their data source, which are commercial data ( Brand and Category ), site data ( POI ) and geographical data ( Business Area and Region ). From this perspective, we define the relation types between these five types of entities as Table 2. Each POI can be mapped to a Brand and a Region from the commercial and geographical aspects of it. Therefore, the POI serves as a bridge to connect Brand and Region to construct the dataset for site recommendation. Meanwhile, the Category and Business Area of a POI are uniquely determined. However, according to the real-world situation, a Brand may have multiple relations of Category and a Business Area may consist of several parts from multiple instances of Region . So the relations between Brand and Category , Region and Business Area can not be exactly defined. Moreover, there are also plenty of relations within Brand ( Competitive and Related ) and relations within Region ( NearBy and Similar ) that may be useful for site recommendation as follows: · Competitive : This commercial relation means that two different brands are competitive, e.g., KFC and McDonald's. · NearBy : This geographical relation means that two different regions are close in physical space, e.g., 'Ginza 1 Ch¯ ome' and 'Ginza 2 Ch¯ ome'. · Similar : This commercial relation means that two different regions have similar distributions of POI category, e.g., 'Ginza 1 Ch¯ ome' and 'Toranomon 4 Ch¯ ome'.", "3.3 Data Construction": "Due to the requirements of data quality to produce reliable dataset, wechoosefour international metropolises for OpenSiteRec at present considering their information comprehensiveness and data integrity, which are Chicago , New York City , Singapore and Tokyo . In order to better support and promote the research for site recommendation, we plan to add more cities into OpenSiteRec on the premise of ensuring data quality in the future. Note that all of the data is collected from open-source data sources and our OpenSiteRec is distributed under the same licence with them to fulfill the ethical regulations. Onthe basis of the schema, we collect data separately from different sources for the aforementioned three aspects. First, the site data, which is the core to connect commercial data and geographical data, is obtained by extracting the POIs from OpenStreetMap 1 , licensed under the Open Data Commons Open Database License (ODbL) 2 . OpenStreetMap [15] is an open-source community-built map service that consists of three types of geographic unit, including nodes, ways and relations. Typically, each node denotes a geographical point in a map while each way and each relation represents a line and a polygon that consist of series of points. Specifically, we extract the data from the data distribution service 3 on December 1st, 2022. For each geographic unit, OpenStreetMap provides a series of tags to describe its characteristics, such as name, brand and amenity. Here we filter the POIs by extracting all the geographic units with at least one type of name tag since the nameless objects are mostly meaningless either. To represent the geographical location of each POI to identify its region, we convert the original geographical information of different objects into their centroids' coordinates, which are pairs of longitude and latitude. Then, we obtain the commercial data by assigning the POIs to the brands from Wikidata 4 . For the POIs that already have the brand tags, it is as simple as directly taking the information from the tags like the wikidata code to extract their brands. Unfortunately, the majority of POIs don't have any brand tags and the brand information is mainly contained in their names. Meanwhile, there may be multiple brand names that correspond to the same brand. Therefore, it is essential to design an effective method for brand matching. In order to achieve more accurate and reliable brand matching, we apply a combination of phonetic matching and text matching algorithms. Specifically, we utilize the soundex [70] algorithm for phonetic matching and the Jaro distance [9, 22] as edit distance for text matching. For each brand name, we first translate it to Unicode by its pronunciation, which means the Japanese words are translated using Hepburn romanization and the Chinese words are translated using Hanyu Pinyin. Two brand names are defined as matching only when they are matched by both two algorithms. Here, we implement the matching algorithms using the open-source library jellyfish 5 and apply Jaro distance with 0 . 8 as threshold of matching. After the brand matching, the brands are grouped together into several disjoint sets according to their matches and each set will choose one specific brand name which has record in Wikidata as the corresponding name for the whole set. Through this process, we can successfully obtain the precise brand of POIs without ambiguity. For the sake of ensuring the reliability of such an automatic brand matching approach, we manually evaluate 5% of the matched brands in each city and the evaluation results are quite convincing. For each POI, the hierarchical categories are determined based on its functional tags and the brand information from Wikidata. Specifically, the broad category and medium category types are manually defined and the narrow category types are directly extracted from Wikidata. Take a branch store of Starbucks as example, the broad category 'Food and Beverage' is determined by its functional tags 'amenity=restaurant' and the narrow category 'Cafe and Tea Shop' is obtained from the brand information of Starbucks in Wikidata while the medium category is then defined to be 'Beverage Shop'. Next, the geographical data is collected from the free public data on the data portal of Chicago 6 , New York City 7 , Singapore 8 and Tokyo 9 governments. Specifically, the Tokyo government has not released the business area planning data so we omit the business area data of Tokyo. Typically, the data is officially released by the government agencies of each city and thus the region partitions and the business area plannings are credible. For the officially defined regions and business areas, we formulate them into polygon boundaries which consist of a series of coordinates. Subsequently, we determine the geographical assignment of POIs by computing the inclusion relationships between the boundaries of the regions or business areas and the centroids of the POIs. After obtaining all the entities, we further identify the intrarelations within Brand and Region to provide more comprehensive commercial and geographical information. For the relations within Brand , i.e. Competitive and Related , we directly extract them by the provided statements from Wikidata. Specifically, we define all the other brands in the same lowest category as Competitive and define the brands in 'See Also' section as Related . Since these two relations are obtained from Wikidata, it is not abnormal for a brand to have no provided Competitive or Related brand. For the relations within Region , we calculate the shortest distances between pairs of regions to identify NearBy relations with a maximum threshold 0 . 5km and we calculate the cosine similarity of narrow category distributions of POIs to identify Similar relations with a minimum threshold 0 . 9. Let the POI category distribution of region 𝑖 be 𝑑𝑖𝑠𝑡 𝑖 = [ 𝑛 1 , 𝑛 2 , ..., 𝑛 𝐾 ] where 𝑛 𝑘 is the POI number of category 𝑘 in region 𝑖 and 𝐾 is the number of narrow category types, the cosine similarity between region 𝑖 and 𝑗 is defined as 𝑠𝑖𝑚 = 𝑑𝑖𝑠𝑡 𝑖 · 𝑑𝑖𝑠𝑡 𝑗 | 𝑑𝑖𝑠𝑡 𝑖 | | 𝑑𝑖𝑠𝑡 𝑗 | . Also, it is common for a region to have no Similar region.", "3.4 Statistics and Usage": "Through the whole process of data collection and processing, we finally obtain the well-formulated and comprehensive OpenSiteRec dataset. The detailed statistics are shown in Table 3. In each city, we have thousands of brands and regions that serve the role of users and items in personalized recommendation systems, respectively. Thus, the existing POIs that belong to specific brands and locate in specific regions serve the role of user-item interactions, whose amounts are about tens of thousand in each city. Meanwhile, each POI has a series of hierarchical categories from about a hundred of types and locates in a specific business area (except for Tokyo). Here we provide an example of a branch store of Starbucks in Tokyo as illustrated in Table 4. In order to better facilitate the usage of OpenSiteRec, we further explore the characteristics of OpenSiteRec by analyzing the dataset Chicago 1 2 3 4 5 6 7 8 9 10 Broad Category 0.0 0.1 0.2 0.3 0.4 0.5 Proportion 1 2 3 4 5 6 7 8 9 10 Broad Category 0.0 0.1 0.2 0.3 0.4 0.5 Proportion", "New York City": "Singapore 1 2 3 4 5 6 7 8 9 10 Broad Category 0.0 0.1 0.2 0.3 0.4 0.5 Proportion 1 2 3 4 5 6 7 8 9 10 Broad Category 0.0 0.1 0.2 0.3 0.4 0.5 Proportion Tokyo distributions. Due to the different urban planning and lifestyles of people, the distributions of site counts of categories are also different in each city. From the comparison of distributions in Figure 2, we can explore the highlights in these four metropolises. For example, the people in Chicago and New York City are more likely to pay attention to the sports facilities, the choices of eating are more diverse in Singapore and the public transportation may be more convenient in Tokyo. However, on the perspectives of brands and regions, the distributions are much more imbalanced. As shown in Figure 3, the site counts of different brands are extremely imbalanced that the top 10% of brands occupy over 50% of sites. This phenomenon indicates that the giant brands are actually dominating the commerce in every city. Similarly, the uneven color distributions in Figure 4 show that the vast majority of POIs (up to 80%) locate in several centres or sub-centres composed of a few regions while most regions have only a few POIs. Such an inequality among different regions shows the different roles of the regions in urban planning, e.g., business areas are dense of POIs while residential areas are sparse. All these distributions indicate the significant imbalance of OpenSiteRec, which is an important problem in utilizing the dataset for site recommendation. On the basis of these statistics of OpenSiteRec, we conclude five unique characteristics of the site recommendation task compared with other top-N recommendation tasks: · The data is quite sparse . Different from the user-oriented recommendation tasks, such as e-commerce or POI recommendation, the site recommendation task is brand-oriented. Due to the realworld concepts, the amounts of brands, regions and POIs are limited. Thus, each data point is very valuable and important. · The city-specific characteristics are significant. It is necessary for site recommendation to effectively capture the latent essential of the city caused by urban planning and lifestyles. Meanwhile, 0 300 600 900 0 200 400 600 800 Site Counts Chicago 0 800 1600 2400 0 200 400 600 800 1000 Site Counts New York City 0 600 1200 1800 0 150 300 450 600 Site Counts Singapore 0 1500 3000 4500 0 300 600 900 1200 1500 Site Counts Tokyo the inter-city commonalities and differences will also play important roles in the researches of site recommendation, especially the researches on knowledge transfer across cities. · The data distribution is extremely imbalanced . The significant imbalance may lead to undesirable predictions or other problems like popularity bias. Therefore, solving the imbalance problem is an important criterion in site recommendation. · The domain-specific features are very crucial. Although there are rich domain-specific features in each domain, these features often have limited effects on the performance, such as the social [69] and geographical [5] features in POI recommendation. However, due to the data rareness, the commercial and geographical features are crucial in site recommendation. · The correlations are highly complex . While social relationships can be treated as positive correlations [11] in social recommendation, the relationships between brands and between regions are much more complex. For example, two competitive brands may open stores in the same region and a brand may open stores in nearby regions, which is anti-intuitive but not unusual.", "4 BENCHMARK EXPERIMENTS": "To better illustrate the significant importance of OpenSiteRec and deliver the facilitation for future research on site recommendation, we conduct a benchmark experiment. In this section, we will report the experimental results with some widely-used baselines on OpenSiteRec under different scenarios as the benchmark.", "4.1 Experimental Settings": "4.1.1 Dataset Split & Evaluation Metrics. Since the original OpenSiteRec is extremely imbalanced on both brands and regions because of the urban planning, we filter the dataset by 5-core setting on the brands (all the brands have possessed at least 5 POIs) in the benchmarking experiments. Specifically, we randomly split the POIs of each brand with 70%, 10% and 20% as training, validation and test sets, respectively. To assess the model performance, we choose the widely-used standard evaluation metrics Recall@20 and nDCG@20 and regard all regions as candidates, i.e. all-ranking protocol. 4.1.2 Baselines. In order to explore the effectiveness of our proposed OpenSiteRec in practical application, we conduct experiments of site recommendation with several representative recommendation models as the benchmarks. Since the existing site recommendation approaches have their own experimental settings and do not release their codes, they are not capable of directly being employed in our settings and we exclude them for comparison. Specifically, the chosen models include machine learning models, collaborative filtering [53] models, click-through rate (CTR) prediction [52] models and graph-based models. For machine learning models, we choose: · LR [20], namely logistic regression, is a simple yet effective model in classification. · GBDT [12], namely gradient boosting decision tree, is an ensemble model with decision tree model as the backbone. · SVC [2] employs support vector machine (SVM) to tackle the classification problem. · RankNet [3] is a famous learning to rank architecture in recommendation. Specifically, we utilize a two-layer neural network as the backbone here. For collaborative filtering models, we choose: · MF-BPR [50] is a variant of Matrix Factorization (MF) [28] optimized by the Bayesian personalized ranking (BPR) loss. · NeuMF [18] combines neural network and Matrix Factorization (MF) for collaborative filtering with point-wise loss. · FISM [25] extends MF by aggregating the item embeddings of interacted items to represent the user via item similarity. · NAIS [17] introduces attention mechanism onto FISM to conduct weighted aggregation of items. For CTR prediction models, we choose: · DNN [10] applies deep neural network to capture the complex interaction between features for CTR prediction. · Wide&Deep [7] jointly utilizes linear transformation and DNN for CTR prediction. · DeepFM [14] combines the factorization machine (FM) and DNN to model the first-, second- and high-order feature interactions. · xDeepFM [32] leverages the compressed interaction network (CIN) to achieve vector-wise feature interactions. For graph-based models, we choose: · GC-MC [56] is a general graph neural network architecture for recommendation. · GraphRec [11] introduces graph neural network into social recommendation by aggregating the embeddings with social relationships. Here we remove the social aggregation component. · NGCF [57] namely Neural Graph Collaborative Filtering, conducts graph message passing on user-item interaction graph for recommendation. Site Number 0-9 9-23 23-48 48-106 106-228 Site Number 0-5 5-14 14-30 30-55 55-122 Site Number 0-22 22-65 65-156 156-270 270-413 (c) Singapore Site Number 0-9 9-25 25-53 53-96 96-187 · LightGCN [16] simplifies the graph convolutional network with only neighborhood aggregation for collaborative filtering. 4.1.3 Implementation Details. The experiments are implemented on the server with an Intel Xeon E5-2640 CPU, a 188GB RAM and two NVIDIA GeForce RTX 2080Ti GPUs. According to the proposed problem definition, the brands and the regions actually serve the role of the users and the items, the categories and the business areas are treated as descriptive features and the site recommendation can be seen as a top-N recommendation task. Specifically, for the traditional machine learning models, including LR, GDBT and SVC, we implement them with scikit-learn [46] 1.0.2. For other models that involve low-dimensional embeddings, we implement them with PyTorch [44] 1.12.1 and set the embedding dimension as 100. The model parameters are initialized with Xavier initialization and optimized by Adam [27]. For all models, we tune hyper-parameters with the performance on the validation set via grid search. The detailed implementation codes could be found at the git repository 10 .", "4.2 Benchmark Results": "The benchmark results of the baselines on OpenSiteRec are shown in Table 5. In order to deliver our insights for future research, we analyze the experimental results and summarize the following points: · Traditional machine learning methods are not capable to handle the complex scenario of site recommendation. Although LR, GBDT and SVC are essentially different types of methods, they all converge to the same local optimal point and thus have the same performance. Given the situation with highly limited data but highly rich features, it is extremely difficult for the traditional machine learning methods not to over-fit to the training set. Thus, they fail to generalize to new POIs and are not suitable for site recommendation without additional mechanisms. baseline models, including LR, RankNet, MF-BPR, NeuMF, DNN, DeepFM, NGCF and LightGCN, under the long-tail scenario. Specifically, we regard the bottom 90% of regions with fewer POIs as the long-tail regions which totally occupy less than 50% of POIs and are only for testing. · The pair-wise loss is significantly better than the point-wise loss. As shown in the results, the models with pair-wise loss (i.e. BPR loss) including RankNet, MF-BPR, FISM, NAIS, NGCF, LightGCN, all outperform the models with point-wise loss (i.e. BCE loss) including NeuMF, DNN, Wide&Deep, DeepFM, xDeepFM, GC-MC, GraphRec. This phenomenon indicates that the pair-wise loss is more suitable than the point-wise loss in site recommendation. · The feature interaction has marginal effects on performance. From DNN to xDeepFM, the degree of feature interaction is increasing but the performance improvement is not significant. This may be because the correlations of features are either fully dependent (broad category and narrow category) or fully independent (brand category and geographical coordinate). · The high-order interactions between brands and regions are crucial. Under the same condition of other factors, such as loss and feature interaction components, the graph-based models are substantially better than others. Since the data are highly sparse in site recommendation, high-order interactions are important to make correct predictions. Therefore, exploiting the graph representation learning techniques to better model the high-order interactions between brands and regions, especially the explicitly defined relations like Competitive , are beneficial to obtain high performance in site recommendation.", "4.3 Long-tail Scenario": "Since the imbalance problem is severe in site recommendation, we conduct an additional experiment to evaluate some representative As shown in Figure 5, the performances of the baseline models drop dramatically on these long-tail regions, which implies a big challenge in site recommendation. Meanwhile, we can also find that the advantage of graph-based models is not as significant as it under the vanilla scenario, which is an important point in designing the model architecture. From the perspective of the cities, the greater drop in performance from the vanilla scenario to the long-tail scenario indicates a higher degree of centrality in urban planning. According to the results, Chicago and Singapore have a higher degree of centrality than New York City and Tokyo , which means the giant brands have more dominant positions in Chicago and Singapore . However, to better achieve fairness, which is especially crucial to provide forward-looking recommendation results to promote urban development, addressing this extreme data imbalance issue is also an important and valuable research topic in site recommendation.", "5 POTENTIAL APPLICATIONS": "Besides site recommendation, our OpenSiteRec also support many other potential applications, including spatial object recommendation [38], transportation demand prediction [33, 62], electric vehicle charging recommendation [67, 68] and high-potential startup detection [65], which demonstrates the strong applicability of OpenSiteRec. In this section, we discuss the significance and show the feasibility via case study and visualization of two potential tasks: brand entry forecasting [39, 54] and business area planning [63]. Rec@20 nDCG@20 0.00 0.05 0.10 0.15 0.20 0.25 Chicago LR RankNet MF-BPR NeuMF DNN DeepFM NGCF LightGCN Rec@20 nDCG@20 0.00 0.03 0.06 0.09 0.12 0.15 New York City LR RankNet MF-BPR NeuMF DNN DeepFM NGCF LightGCN Rec@20 nDCG@20 0.00 0.02 0.04 0.06 0.08 0.10 Singapore LR RankNet MF-BPR NeuMF DNN DeepFM NGCF LightGCN Rec@20 nDCG@20 0.00 0.02 0.04 0.06 0.08 0.10 Tokyo LR RankNet MF-BPR NeuMF DNN DeepFM NGCF LightGCN", "5.1 Brand Entry Forecasting": "People in different cities have different preferences for brands due to culture, history, lifestyle and other reasons [30, 43]. These factors along with the commercial strategies of brands result in the different brand distributions in different cities [45]. Typically, some brands are more international that have been spread all over the world while some brands are more local that only open stores at a few cities. Obviously, all these international brands started from local brands with decades of expansion to reach current standings. Therefore, many brands that are very popular in local now have a great potential to expand to other cities around the world [4]. A feasible way is to exploit the existing brands in different cities to mine the brands with a high probability to succeed in other cities [65, 66], i.e. brand entry forecasting. Since our proposed OpenSiteRec provides plenty of brands in four world-class metropolises, it is credible to carry out such research with OpenSiteRec. In order to demonstrate the applicability of our OpenSiteRec to support the brand entry forecasting, we also present a case study by ranking the brands of Fast Food and Cafe & Dessert in different cities. As illustrated in Table 6, many popular international brands like Starbucks have multiple similar brands that are popular in local, such as Coffee Bean in Singapore and Doutor in Tokyo . The fact that these local brands have the ability to pose a position in the fierce commercial competition with the international giant brands not only demonstrates their success in commerce so far, but also indicates their adequate competitiveness to success in other places in the future. Therefore, it is fair to believe that these brands have a high potential to enter other cities and our OpenSiteRec is capable to provide valuable information for this research topic.", "5.2 Business Area Planning": "To form a strong scale effect, planning business area [63] (i.e. central business district) is crucial in the development of the city. Generally, business area planning takes many factors into account, such as population, traffic convenience and surrounding environments. Since the POI distributions and the geographical information already indicate these factors implicitly [26], we deem that OpenSiteRec is quite beneficial to support business area planning. To verify this idea, we visualize the planned business area (except for Tokyo, whose government has not released the official business area planning) and POI distributions for comparison. From Figure 6, we can see that the distributions of business areas are relatively uniform in the cities and have high coincidence with the traffic hubs. Such a regular pattern is consistent with the POI distributions and it is also true that the more concentrated the POIs are, the more business districts are planned. Our OpenSiteRec provides tens of thousands of POIs along with their categories and other characteristics. By analyzing these characteristics of all the POIs in an area, it is to effectively grasp the essential factors of the area. For example, the areas with high density of shopping sites or the areas serving as transportation hubs will be more possible and reasonable to be planned as business areas. Therefore, applying OpenSiteRec to conduct research in business area planning is feasible and reliable.", "6 DISCUSSION & CONCLUSION": "In this paper, we collect, construct and release the first open dataset OpenSiteRec for site recommendation, which consists of multisource data from four international metropolises and is comprehensive to support the following research. Specifically, OpenSiteRec leverages a heterogeneous graph schema with the entities to represent the different types of real-world concepts, including category, brand, POI, business area and region, and the relations to denote the corresponding commercial and geographical relationships. recommendation, none of them have released their datasets, which brings inconvenience for the researchers and is harmful to the research in this area. Meanwhile, most of the existing approaches only focus on a small scope of site recommendation, yielding limited significance and impact. Our OpenSiteRec provides comprehensive and variety of information across multiple cities to better support more practical and valuable research. Overall, site recommendation is an important and beneficial information retrieval task for the development of brands or institutions in real-world applications, which has been established for decades. However, it was until recent years that the research on site recommendation has made much progress, but it is still very slow compared with other rapidly developing areas, such as POI recommendation. Despite the success of recent approaches in site To verify the applicability of our OpenSiteRec and the suitability of the existing recommendation models on site recommendation task, we conduct benchmarking experiments of totally 16 representative baseline models on OpenSiteRec. The experimental results fully demonstrate the great support for site recommendation and the detailed analysis also provides some insights in developing more advanced models. Furthermore, we explore the potential research directions and deliver toy experiments of urban computing, including brand entry forecasting and business area planning, which indicates the applicability of our OpenSiteRec in supporting various real-world applications. Unfortunately, there are still some potential limitations of OpenSiteRec for now. The greatest limitation consists in the lack of temporal dimension, which means OpenSiteRec collects the data at a specific time without variation from urban development. Therefore, our OpenSiteRec contains the real-world data but not necessarily the best options of regions for the brands. A better solution considering the temporal dimension is to collect data and construct dataset at multiple time points on annually, quarterly, or even monthly. However, due to the requirements of original data and the high workload, we can not afford to achieve it at present and it is left for future work. In addition, OpenSiteRec currently contains four metropolises, which are still limited. We have planned to expand it by adding more cities to better support the research of site recommendation. In conclusion, site recommendation is is still an underestimated topic considering its significance in modern business and its predicted impacts. Therefore, we believe that the emergence of our OpenSiteRec dataset will strongly promote the research on it and help the development of business intelligence in the next few years.", "REFERENCES": "[1] Oded Berman and Dmitry Krass. 2002. The generalized maximal covering location problem. Comput. Oper. Res. 29, 6 (2002), 563-581. [2] Erin J. Bredensteiner and Kristin P. Bennett. 1999. Multicategory Classification by Support Vector Machines. Comput. Optim. Appl. 12, 1-3 (1999), 53-79. [3] Christopher J. C. Burges, Tal Shaked, Erin Renshaw, Ari Lazier, Matt Deeds, Nicole Hamilton, and Gregory N. Hullender. 2005. Learning to rank using gradient descent. In Machine Learning, Proceedings of the Twenty-Second International Conference (ICML 2005), Bonn, Germany, August 7-11, 2005 (ACM International Conference Proceeding Series) , Vol. 119. ACM, 89-96. [4] Gregory S. Carpenter and Kent Nakamoto. 1990. Competitive Strategies for Late Entry into a Market with a Dominant Brand. Management Science 36 (1990), 1268-1278. [5] Buru Chang, Gwanghoon Jang, Seoyoon Kim, and Jaewoo Kang. 2020. Learning Graph-Based Geographical Latent Representation for Point-of-Interest Recommendation. In CIKM '20: The 29th ACM International Conference on Information and Knowledge Management, Virtual Event, Ireland, October 19-23, 2020 . ACM, 135-144. [6] Longbiao Chen, Daqing Zhang, Gang Pan, Xiaojuan Ma, Dingqi Yang, Kostadin Kushlev, Wangsheng Zhang, and Shijian Li. 2015. Bike sharing station placement leveraging heterogeneous urban open data. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, UbiComp 2015, Osaka, Japan, September 7-11, 2015 . ACM, 571-575. [7] Heng-Tze Cheng, Levent Koc, Jeremiah Harmsen, Tal Shaked, Tushar Chandra, Hrishi Aradhye, Glen Anderson, Greg Corrado, Wei Chai, Mustafa Ispir, Rohan Anil, Zakaria Haque, Lichan Hong, Vihan Jain, Xiaobing Liu, and Hemal Shah. 2016. Wide & Deep Learning for Recommender Systems. In Proceedings of the 1st Workshop on Deep Learning for Recommender Systems, DLRS@RecSys 2016, Boston, MA, USA, September 15, 2016 . ACM, 7-10. [8] Richard L. Church and Alan T. Murray. 2008. Business Site Selection, Location Analysis and GIS. [9] William W. Cohen, Pradeep Ravikumar, and Stephen E. Fienberg. 2003. A Comparison of String Distance Metrics for Name-Matching Tasks. In Proceedings of IJCAI-03 Workshop on Information Integration on the Web (IIWeb-03), August 9-10, 2003, Acapulco, Mexico . 73-78. [10] Paul Covington, Jay Adams, and Emre Sargin. 2016. Deep Neural Networks for YouTube Recommendations. In Proceedings of the 10th ACM Conference on Recommender Systems, Boston, MA, USA, September 15-19, 2016 . ACM, 191-198. [11] Wenqi Fan, Yao Ma, Qing Li, Yuan He, Yihong Eric Zhao, Jiliang Tang, and Dawei Yin. 2019. Graph Neural Networks for Social Recommendation. In The World Wide Web Conference, WWW 2019, San Francisco, CA, USA, May 13-17, 2019 . ACM, 417-426. [12] Jerome H. Friedman. 2001. Greedy function approximation: A gradient boosting machine. Annals of Statistics 29 (2001), 1189-1232. [13] Bin Guo, Jing Li, Vincent W. Zheng, Zhu Wang, and Zhiwen Yu. 2017. CityTransfer: Transferring Inter- and Intra-City Knowledge for Chain Store Site Recommendation based on Multi-Source Urban Data. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 4 (2017), 135:1-135:23. [14] Huifeng Guo, Ruiming Tang, Yunming Ye, Zhenguo Li, and Xiuqiang He. 2017. DeepFM: A Factorization-Machine based Neural Network for CTR Prediction. In Proceedings of the Twenty-Sixth International Joint Conference on Artificial Intelligence, IJCAI 2017, Melbourne, Australia, August 19-25, 2017 . ijcai.org, 17251731. [15] Mordechai (Muki) Haklay and Patrick Weber. 2008. OpenStreetMap: UserGenerated Street Maps. IEEE Pervasive Comput. 7, 4 (2008), 12-18. [16] Xiangnan He, Kuan Deng, Xiang Wang, Yan Li, Yong-Dong Zhang, and Meng Wang. 2020. LightGCN: Simplifying and Powering Graph Convolution Network for Recommendation. In Proceedings of the 43rd International ACM SIGIR conference on research and development in Information Retrieval, SIGIR 2020, Virtual Event, China, July 25-30, 2020 . ACM, 639-648. [17] Xiangnan He, Zhankui He, Jingkuan Song, Zhenguang Liu, Yu-Gang Jiang, and Tat-Seng Chua. 2018. NAIS: Neural Attentive Item Similarity Model for Recommendation. IEEE Trans. Knowl. Data Eng. 30, 12 (2018), 2354-2366. [18] Xiangnan He, Lizi Liao, Hanwang Zhang, Liqiang Nie, Xia Hu, and Tat-Seng Chua. 2017. Neural Collaborative Filtering. In Proceedings of the 26th International Conference on World Wide Web, WWW 2017, Perth, Australia, April 3-7, 2017 . ACM, 173-182. [19] Tony Hernández and David J. Bennison. 2000. The art and science of retail location decisions. International Journal of Retail & Distribution Management 28 (2000), 357-367. [20] David W. Hosmer and Stanley Lemeshow. 1991. Applied Logistic Regression. [21] David L. Huff. 1966. A Programmed Solution for Approximating an Optimum Retail Location. Land Economics 42 (1966), 293-303. [22] Matthew A. Jaro. 1989. Advances in Record-Linkage Methodology as Applied to Matching the 1985 Census of Tampa, Florida. J. Amer. Statist. Assoc. 84 (1989), 414-420. [23] Pablo Jensen. 2006. Network-based predictions of retail store commercial categories and optimal locations. Physical review. E, Statistical, nonlinear, and soft matter physics 74 3 Pt 2 (2006), 035101. [24] Pablo Jensen. 2009. Analyzing the Localization of Retail Stores with Complex Systems Tools. In Advances in Intelligent Data Analysis VIII, 8th International Symposium on Intelligent Data Analysis, IDA 2009, Lyon, France, August 31 September 2, 2009. Proceedings (Lecture Notes in Computer Science) , Vol. 5772. Springer, 10-20. [25] Santosh Kabbur, Xia Ning, and George Karypis. 2013. FISM: factored item similarity models for top-N recommender systems. In The 19th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD 2013, Chicago, IL, USA, August 11-14, 2013 . ACM, 659-667. [26] Dmytro Karamshuk, Anastasios Noulas, Salvatore Scellato, Vincenzo Nicosia, and Cecilia Mascolo. 2013. Geo-spotting: mining online location-based services for optimal retail store placement. In The 19th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD 2013, Chicago, IL, USA, August 11-14, 2013 . ACM, 793-801. [27] Diederik P. Kingma and Jimmy Ba. 2015. Adam: A Method for Stochastic Optimization. In 3rd International Conference on Learning Representations, ICLR 2015, San Diego, CA, USA, May 7-9, 2015, Conference Track Proceedings . [28] Yehuda Koren, Robert M. Bell, and Chris Volinsky. 2009. Matrix Factorization Techniques for Recommender Systems. Computer 42, 8 (2009), 30-37. [29] Prof Vikas Kumar and Kiran Karande. 2000. The Effect of Retail Store Environment on Retailer Performance. Journal of Business Research 49 (2000), 167-181. [30] Donald R. Lehmann and Yigang Pan. 1994. Context Effects, New Brand Entry, and Consideration Sets. Journal of Marketing Research 31 (1994), 364 - 374. [31] Yuhong Li, Yu Zheng, Shenggong Ji, Wenjun Wang, Leong Hou U, and Zhiguo Gong. 2015. Location selection for ambulance stations: a data-driven approach. In Proceedings of the 23rd SIGSPATIAL International Conference on Advances in Geographic Information Systems, Bellevue, WA, USA, November 3-6, 2015 . ACM, 85:1-85:4. [32] Jianxun Lian, Xiaohuan Zhou, Fuzheng Zhang, Zhongxia Chen, Xing Xie, and Guangzhong Sun. 2018. xDeepFM: Combining Explicit and Implicit Feature Interactions for Recommender Systems. In Proceedings of the 24th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining, KDD 2018, London, UK, August 19-23, 2018 . ACM, 1754-1763. [33] Hao Liu, Qiyu Wu, Fuzhen Zhuang, Xinjiang Lu, Dejing Dou, and Hui Xiong. 2021. Community-Aware Multi-Task Transportation Demand Prediction. In Thirty-Fifth AAAI Conference on Artificial Intelligence, AAAI 2021, Thirty-Third Conference on Innovative Applications of Artificial Intelligence, IAAI 2021, The Eleventh Symposium on Educational Advances in Artificial Intelligence, EAAI 2021, Virtual Event, February 2-9, 2021 . AAAI Press, 320-327. [34] Yu Liu, Jingtao Ding, and Yong Li. 2021. Knowledge-driven Site Selection via Urban Knowledge Graph. CoRR abs/2111.00787 (2021). [35] Yu Liu, Jingtao Ding, and Yong Li. 2022. Developing knowledge graph based system for urban computing. Proceedings of the 1st ACM SIGSPATIAL International Workshop on Geospatial Knowledge Graphs (2022). [36] Yan Liu, Bin Guo, Nuo Li, Jing Zhang, Jingmin Chen, Daqing Zhang, Yinxiao Liu, Zhiwen Yu, Sizhe Zhang, and Lina Yao. 2019. DeepStore: An Interaction-Aware Wide&Deep Model for Store Site Recommendation With Attentional Spatial Embeddings. IEEE Internet Things J. 6, 4 (2019), 7319-7333. [37] Yan Liu, Bin Guo, Daqing Zhang, Djamal Zeghlache, Jingmin Chen, Ke Hu, Sizhe Zhang, Dan Zhou, and Zhiwen Yu. 2021. Knowledge Transfer with Weighted Adversarial Network for Cold-Start Store Site Recommendation. ACM Trans. Knowl. Discov. Data 15, 3 (2021), 47:1-47:27. [38] Hui Luo, Jingbo Zhou, Zhifeng Bao, Shuangli Li, J. Shane Culpepper, Haochao Ying, Hao Liu, and Hui Xiong. 2020. Spatial Object Recommendation with Hints: When Spatial Granularity Matters. In Proceedings of the 43rd International ACM SIGIR conference on research and development in Information Retrieval, SIGIR 2020, Virtual Event, China, July 25-30, 2020 . ACM, 781-790. [39] Stijn Maesen and Lien Lamey. 2022. The Impact of Organic Specialist Store Entry on Category Performance at Incumbent Stores. Journal of Marketing 87 (2022), 97 - 113. [40] Michael T. Marsh and David A. Schilling. 1994. Equity measurement in facility location analysis: A review and framework. European Journal of Operational Research 74 (1994), 1-17. [41] Daniel McFadden. 1977. Modelling the Choice of Residential Location. Transportation Research Record (1977). [42] Yansong Ning, Hao Liu, Hao Wang, Zhenyu Zeng, and Hui Xiong. 2023. UUKG: Unified Urban Knowledge Graph Dataset for Urban Spatiotemporal Prediction. CoRR abs/2306.11443 (2023). [43] Yigang Pan and Donald R. Lehmann. 1993. The Influence of New Brand Entry on Subjective Brand Judgments. Journal of Consumer Research 20 (1993), 76-86. [44] Adam Paszke, Sam Gross, Francisco Massa, Adam Lerer, James Bradbury, Gregory Chanan, Trevor Killeen, Zeming Lin, Natalia Gimelshein, Luca Antiga, Alban Desmaison, Andreas Köpf, Edward Z. Yang, Zachary DeVito, Martin Raison, Alykhan Tejani, Sasank Chilamkurthy, Benoit Steiner, Lu Fang, Junjie Bai, and Soumith Chintala. 2019. PyTorch: An Imperative Style, High-Performance Deep Learning Library. In Advances in Neural Information Processing Systems 32: Annual Conference on Neural Information Processing Systems 2019, NeurIPS 2019, December 8-14, 2019, Vancouver, BC, Canada . 8024-8035. [45] Koen H. Pauwels and Shuba Srinivasan. 2004. Who Benefits from Store Brand Entry. Marketing Science 23 (2004), 364-390. [46] F. Pedregosa, G. Varoquaux, A. Gramfort, V. Michel, B. Thirion, O. Grisel, M. Blondel, P. Prettenhofer, R. Weiss, V. Dubourg, J. Vanderplas, A. Passos, D. Cournapeau, M. Brucher, M. Perrot, and E. Duchesnay. 2011. Scikit-learn: Machine Learning in Python. Journal of Machine Learning Research 12 (2011), 2825-2830. [47] Sergio Porta, Vito Latora, Fahui Wang, Salvador Rueda, Emanuele Strano, Salvatore Scellato, Allessio Cardillo, Eugenio Belli, Francisco Cardenas, Berta Cormenzana, and Laura Latora. 2012. Street Centrality and the Location of Economic Activities in Barcelona. Urban Studies 49 (2012), 1471 - 1488. [48] Sergio Porta, Emanuele Strano, Valentino Iacoviello, Roberto Messora, Vito Latora, Alessio Cardillo, Fahui Wang, and Salvatore Scellato. 2009. Street Centrality and Densities of Retail and Services in Bologna, Italy. Environment and Planning B: Planning and Design 36 (2009), 450 - 465. [49] M. Mazhar Rathore, Awais Ahmad, Anand Paul, and Seungmin Rho. 2016. Urban planning and building smart cities based on the Internet of Things using Big Data analytics. Comput. Networks 101 (2016), 63-80. [50] Steffen Rendle, Christoph Freudenthaler, Zeno Gantner, and Lars Schmidt-Thieme. 2009. BPR: Bayesian Personalized Ranking from Implicit Feedback. In UAI 2009, Proceedings of the Twenty-Fifth Conference on Uncertainty in Artificial Intelligence, Montreal, QC, Canada, June 18-21, 2009 . AUAI Press, 452-461. [51] Charles S. Revelle and Horst A. Eiselt. 2005. Location analysis: A synthesis and survey. Eur. J. Oper. Res. 165 (2005), 1-19. [52] Matthew Richardson, Ewa Dominowska, and Robert Ragno. 2007. Predicting clicks: estimating the click-through rate for new ads. In Proceedings of the 16th International Conference on World Wide Web, WWW 2007, Banff, Alberta, Canada, May 8-12, 2007 . ACM, 521-530. [53] Badrul Munir Sarwar, George Karypis, Joseph A. Konstan, and John Riedl. 2001. Item-based collaborative filtering recommendation algorithms. In Proceedings of the Tenth International World Wide Web Conference, WWW 10, Hong Kong, China, May 1-5, 2001 . ACM, 285-295. [54] Satheesh Seenivasan and Debabrata Talukdar. 2016. Competitive Effects of WalMart Supercenter Entry: Moderating Roles of Category and Brand Characteristics. Journal of Retailing 92 (2016), 218-225. [55] Meng Shao, Zhi Han, Jin Wei Sun, Chengsi Xiao, Shu lei Zhang, and Yuan xu Zhao. 2020. A review of multi-criteria decision making applications for renewable energy site selection. Renewable Energy 157 (2020), 377-403. [56] Rianne van den Berg, Thomas N. Kipf, and Max Welling. 2017. Graph Convolutional Matrix Completion. CoRR abs/1706.02263 (2017). [57] Xiang Wang, Xiangnan He, Meng Wang, Fuli Feng, and Tat-Seng Chua. 2019. Neural Graph Collaborative Filtering. In Proceedings of the 42nd International ACM SIGIR Conference on Research and Development in Information Retrieval, SIGIR 2019, Paris, France, July 21-25, 2019 . ACM, 165-174. [58] Yunna Wu, Chao Xie, Chuanbo Xu, and Fang Li. 2017. A Decision Framework for Electric Vehicle Charging Station Site Selection for Residential Communities under an Intuitionistic Fuzzy Environment: A Case of Beijing. Energies 10 (2017), [71] Tezcan Kaşmer Şahin, Saffet Ocak, and Mehmet Top. 2019. Analytic hierarchy process for hospital site selection. Health Policy and Technology (2019)."}
