{
  "MITRE ATT&CK: State of the Art and Way Forward": "BADER AL-SADA ∗ and ALIREZA SADIGHIAN ∗ , Division of Information and Computing Technology, College of Science and Engineering, Hamad Bin Khalifa University, Qatar Foundation, Qatar GABRIELE OLIGERI, Division of Information and Computing Technology, College of Science and Engineering, Hamad Bin Khalifa University, Qatar Foundation, Qatar MITRE ATT&CK is a comprehensive framework of adversary tactics, techniques and procedures based on real-world observations. It has been used as a foundation for threat modelling in different sectors, such as government, academia and industry. To the best of our knowledge, no previous work has been devoted to the comprehensive collection, study and investigation of the current state of the art leveraging the MITRE ATT&CK framework. We select and inspect more than fifty major research contributions, while conducting a detailed analysis of their methodology and objectives in relation to the MITRE ATT&CK framework. We provide a categorization of the identified papers according to different criteria such as use cases, application scenarios, adopted methodologies and the use of additional data. Finally, we discuss open issues and future research directions involving not only the MITRE ATT&CK framework but also the fields of risk analysis and cyber-threat intelligence at large. CCS Concepts: · Security and privacy → Trust frameworks . Additional Key Words and Phrases: MITRE ATT&CK Framework, Cyber-Threat Intelligence, Security Risk Analysis",
  "1 INTRODUCTION": "Inter-connectivity and smart technologies are becoming more and more popular in our daily life. The paradigms of fog, edge and cloud computing enable the end-user to interact with an increasing number of remote services. The global trend of 'get everything connected\" is affecting the industry (Industry 4.0), cities (smart cities), houses (smart homes), etc. Nevertheless, the high density of online services, sensors, and actuators is increasing the likelihood of cyber-security attacks given the amount of known (and unknown, i.e, zero-day) vulnerabilities that are spread in all the on-line services. The perimeter to be monitored, a.k.a., surface of attack, by each organization is becoming too large to guarantee a zero-risk of penetration-eventually resulting on the acceptance of a minimum risk. Given the growing complexity of ICT infrastructures, and the associated cyber-security countermeasures, modern cyber-security attacks are constituted by a sequence of steps that usually initiate from the weakest point in the attack surface (service security mis-configuration), and then, they move towards their final objective, e.g., data exfiltration, denial of service, subversion, etc. Indeed, cyber-security attacks are today's constituted by a sequence of malicious activities performed over long period of time-this is to guarantee stealthiness during the lateral spreading of the attack. The sequence of malicious operations, a.k.a., adversary behaviour, is a fingerprint of the adversary itself. Indeed, the adversary aims at optimizing his workflow re-using the same tools, scripts and the overall methodology to gain access to a system. This pattern makes each adversary different and (at certain extent) identifiable. The MITRE ATT&CK framework is a database of attacks, allowing a cross-match between adversarial objectives, behaviour and attack sources. Firstly, MITRE ATT&CK enables a detailed description of the threat landscape associated with a specific business-this being extremely important to allow the organization to prioritize the deployment of the assets' controls. Moreover, for each attack in the database, ∗ Both authors contributed equally to this research. Authors' addresses: Bader Al-Sada, balsada@hbku.edu.qa; Alireza Sadighian, asadighian@hbku.edu.qa, Division of Information and Computing Technology, College of Science and Engineering, Hamad Bin Khalifa University, Qatar Foundation, Doha, Qatar; Gabriele Oligeri, goligeri@hbku.edu.qa, Division of Information and Computing Technology, College of Science and Engineering, Hamad Bin Khalifa University, Qatar Foundation, Doha, Qatar. 1 2 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri MITRE ATT&CK provides the chain of malicious activities from the initial access to the final attack's objective. This steps represent the adversarial behaviour, which in turn, they can be considered as the fingerprint of the attack allowing the identification of the adversary. Finally, MITRE ATT&CK potentially allows the forecasting of the subsequent actions when the attack is detected as ongoing in the system-this allowing the localization and mitigation of the attack itself. This survey focuses on the MITRE ATT&CK knowledge-base applications and its enhancement and extension methods. To this aim, we identified a comprehensive list of papers that consider the MITRE ATT&CK framework in various ways. Next, we analyzed this list from different perspectives, such as adopted techniques, application scenario, type of their inputs, evaluation techniques, etc., and present our findings and insights. Contributions. The contributions of this paper are manyfold. Firstly, we provide a comprehensive list of state of the art research papers related to the MITRE ATT&CK framework. We summarize each research paper describing its methodology, evaluation technique and future directions. Subsequently, we categorize the list of papers into 4 main categories: (i) Behavioral analytic, (ii) Adversary emulation / Red teaming, (iii) Defensive gap assessment, and finally, (iv) CTI enrichment. We describe our findings and insights according to different categories, such as application scenarios, input types, adopted techniques, and input datasets. Finally, we present the limitations and the existing challenges in the current state of the art while providing some future directions. Roadmap . The rest of this paper is organized as follows. Section 2 is dedicated to the introduction of the background knowledge about the MITRE ATT&CK framework. Section 3 compares the MITRE ATT&CK with other frameworks, while Section 4 introduces the list of the selected paper and a preliminary break-down into use cases. Section 5 wraps up on the key-findings of our survey, while Section 6 highlights open issues and future research directions. Finally, Section 7 draws some conclusion remarks.",
  "2 BACKGROUND ON MITRE ATT&CK FRAMEWORK": "MITRE ATT&CK stands for MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK). It has been created in 2013 as a result of MITRE's Fort Meade Experiment (FMX) where a group of researchers emulated a scenario constituted by adversaries and defenders in an effort to improve the forensic analysis of an attack through the behavioral analysis of the adversary. The MITRE ATT&CK framework is a database of malicious activities from real world-observations. Such activities are classified as belonging to groups or Advanced Persistent Threat (APTs), thus an APT is characterized by a sequence of malicious activities-this one constituting the behavior of the adversary. The malicious activity is deployed by means of a specific procedure which belongs to a technique being the mean the adversary adopts to achieve its goal. Finally, techniques are grouped into tactics , i.e., the short-term objective of the adversary. Therefore, an APT achieves its objective by implementing a sequence of malicious activities that can be modelled as a sequence of Tactics, Techniques, and Procedures (TTPs). Figure 1 shows the typical layout of the ATT&CK matrix, where the tactics and the techniques are organized by columns and rows, respectively. Tactics are organized in a logical way (from left to right) in order to highlight the possible consequential phases of an attack. As a simple example, we consider the well-known wannacry ransomware, classified as software in the MITRE framework, i.e., S0366, involving 8 tactics, i.e., Execution, Persistence, Privilege Escalation, Defense Evasion, Discovery, Lateral Movement, Command and Control, and Impact, and 16 techniques, i.e., T1047, T1543, T1222, T1564, T1083, T1120, T1018, T1016, T1210, T1570, T1563, T1573, T1090, T0866, T1486, T1490, and T1489, as described in the following:",
  "· Execution.": "-T1047. Windows Management Instrumentation MITRE ATT&CK: State of the Art and Way Forward 3",
  "Tactics": "Fig. 1. MITRE ATT&CK matrix: tactics and techniques. Techniques · Persistence -T1543. Create or Modify System Process · Privilege escalation -T1543. Create or Modify System Process · Defense evasion -T1222. File and Directory Permissions Modification -T1564. Hide Artifacts · Discovery -T1083. File and Directory Discovery -T1120. Peripheral Device Discovery -T1018. Remote System Discovery -T1016. System Network Configuration Discovery · Lateral movement -T0866. Exploitation of Remote Services -T1570. Lateral Tool Transfer -T1563. Remote Service Session Hijacking · Command and Control -T1573. Encrypted Channel -T1090. Proxy · Impact. -T1486. Data Encrypted for Impact. -T1490. Inhibit System Recovery. -T1489. Service Stop. 4 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri Fig. 2. WannaCry behaviour as a sequence of techniques. Figure 2 shows the behaviour of WannaCry malware in the ATT&CK matrix and the sequence of observed tactics and techniques. In particular, the sequence of the techniques represents the behaviour of the malware also known as fingerprint. The ATT&CK matrix also refers to sub-techniques , i.e., more specific techniques adopted by the adversary to achieve its goals. As an example, still related to wannacry malware, we may consider T1573 (Encrypted Channel), which is characterized by 2 sub-techniques: T1573.001 (Symmetric Cryptography) and T1573.002 (Asymmetric Cryptography)the later one adopted by wannacry . Each technique (or sub-technique) can be implemented in different ways and a list of implementations are considered within the framework, i.e., the procedures associate with sub-technique T1573.002 are 55. The framework also links each considered malicious software, such as wannacry - S0366, to the groups well-known to have adopted it before, i.e., G0032 - Lazarous Group. The ATT&CK framework also refers to well-known techniques to detect and mitigate each of the technique and sub-technique previously discussed. As a final example, M1031 (Network Intrusion Prevention) and M1020 (SSL/TLS Inspection) are suggested as mitigation to sub-technique T1573.002, while as for detection, DS0029 (Network Traffic) is suggested.",
  "2.1 Framework evolution over time": "The ATT&CK matrix is updated (on average) every 6 months with major changes since 2015 (launched as a wiki) reaching the version 11 at the date of the writing of this manuscript. Figure 3 shows the evolution of the MITRE ATT&CK framework over the time including the counting of tactics, techniques and sub-techniques [1]. A worth-mentioning major change has been introduced with PRE-ATT&CK in 2017 involving tactics and techniques for describing the adversarial behaviour before the actual attack deployment; subsequently, PRE-ATT&CK has been integrated in the ATT&CK framework as the columns Reconnaissance and Resource Development . At the same time (July 2017), Linux and macOS have be been introduced in the framework. In October 2019, ATT&CK for cloud was added to the framework covering the cloud-based Infrastructure as a Service (IaaS). Finally, ATT&CK for Industrial Control Systems (ICSs) has been introduced in the 2020. MITRE ATT&CK: State of the Art and Way Forward 5 Fig. 3. MITRE ATT&CK framework evolution over time in terms of number of Tactics, Techniques and Sub-Techniques. May 2015 Jun 2016 Jan 2017 Apr 2017 Jul 2017 Jan 2018 Apr 2018 Oct 2018 Apr 2019 Jul 2019 Oct 2019 Jul 2020 Oct 2020 Apr 2021 Oct 2021 Time 0 100 200 300 400 500 600 Number of Entities Tactics Techniques Sub-techniques",
  "2.2 Technology domains": "The MITRE attack framework involves three technology domains: Enterprise , Mobile , and ICS . The three domains involve different tactics and techniques-although there are some minor overlaps. Indeed, the three domains are very different each others, thus involving different adversarial behaviour. The attack surfaces are different as well as the adversary objectives, thus requiring ad-hoc tactics, techniques and procedures. Enterprise. This domain involves 191 techniques and 385 sub-techniques including several platform such as Windows, Linux, macOS, etc. This is the richest domain due to its legacy involving observations of attacks from a technology domain that is physiologically broader than the others. Indeed, the enterprise domain involves the platform Windows, macOS, Linux, Cloud, Network and Containers, while being the only one to include specific techniques (within 2 tactics) for the analysis of the preparatory adversarial activities (PRE-ATT&CK). Indeed, worth-noting entry points in the ATT&CK matrix are Search Open Websites/Domains and Search Victim-Owned Websites (Reconnaissance)-typical behaviour for social engineering, while typical adversary objectives are Data Destruction, Disk Wipe and Service Stop (Impact)-techniques that commonly implemented by adversaries in enterprise scenarios. Mobile. The mobile domain takes into account 66 techniques and 41 sub-techniques. The mobile domain has the main objective to perform a behavioral analysis of attacks involving smart-phones and related devices. The increasing adoption of smart-phones for accessing and sharing personal and corporate data, e.g., Bring Your Own Device model (BYOD), significantly expand the attack surface while increasing the number of the associated threats. Indeed, countless attacks have been proposed against smart-phones, and those attacks are becoming more and more targeted to the user's organization, given the entry points offered by the smart-phones vulnerabilities. The mobile ATT&CK matrix addresses this scenario considering specific attack behaviour with typical entry points of smart-phones, e.g., Lockscreen Bypass 6 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri and Supply Chain Compromise (Initial Access), while aiming at targets that can involve more than the user's data, e.g., Input Injection and Data Encrypted for Impact (Impact). Industrial Control Systems (ICSs). The ICS domain is represented by 78 techniques with no sub-techniques. Modern cyber-physical systems are experience the convergence of Information Technology (IT) and Operational Technology (OT) throughout the new models of fog and edge computing. Indeed, the OT infrastructure is now connected to the network with processing capabilities-being able to implement AI techniques in some cases, thus enabling the full integration of data-centric computing (IT) with monitoring and sensing from the physical world (OT). While the increasing integration of OT and IT enhance the effectiveness and efficacy of the industrial processes, it represents an unprecedented opportunity for adversaries than can now jump from one world to the other, thus increasing their chances to affect the physical environment by initiating attacks in the cyber-space. The ICS ATT&CK matrix captures this IT-OT relation by considering attack behaviour that initiate from the IT world, e.g., Spearfishing attachment, Wireless Compromise, Internet Accessible Device (Initial access), ending up with a physical impact in the OT world, e.g., Damage to Property, Denial of Control, and Loss of Safety (Impact).",
  "3 COMPARISON WITH OTHER FRAMEWORKS": "There are mainly 2 other frameworks that can support the risk analysis activity and they can be compared with the MITRE ATT&CK framework: (i) the Lockheed Martin's Cyber Kill Chain (CKC) and (ii) the Microsoft STRIDE framework (STRIDE). Two other minor models are also considered: the Unified Kill Chain (UKC) and the Diamond model (DM). Lockheed Martin's Cyber Kill Chain. This framework involves 7 stages, i.e., Reconnaissance, Weaponization, Delivery, Exploitation, Installation, Command and Control, and Actions on Objectives. The idea behind the framework is rooted on the fact that all the cybersecurity attacks can be either represented or mapped in terms of a sequence of temporal activities belonging to the aforementioned stages. It is strictly important that the temporal sequence is respected: the success of the attack is tight to the temporal sequence of the adversary's actions. Indeed, this makes the attack (or the perception of it) much weaker: any action that breaks the chain (sequence of malicious activities) prevents the adversary to achieve its goal. Microsoft STRIDE. This framework has been proposed and developed by Praerit Garg and Loren Kohnfelder at Microsoft [2]. The model leverages 6 threat categories: Spoofing, Tampering with data, Repudiation, Information disclosure, Denial of service and Elevation of privilege. The main idea is to identify a specific service from the corporate architecture, and then, adopt the 6 categories to identify all the possible threats, and finally, iterating the methodology for each service in the organization. This framework allows to identify vulnerabilities, and the associated threats, while been driven by the STRIDE categories. Although the three frameworks have been analyzed and dissected by several blogs, they cannot be really compared. Indeed, ATT&CK is mainly a database of malicious activities, CKC is an attack model based on sequence of causal activities, while STRIDE is a category-based threat identification process. The objectives and the scopes of the frameworks are different: ATT&CK aims at supporting cybersecurity experts with a wide range of previously identified attacks and the associated mitigation actions, while CKC is a general attack model that can be exploited to identify the most effective response strategies, and finally, STRIDE aims at supporting the threat identification process in the corporate environment. While serving different purposes, their integration and inter-operation is still at the early stage. For example, STRIDE might be used to identify a threat associated with one or more services in the organization, CKC might support the MITRE ATT&CK: State of the Art and Way Forward 7 Fig. 4. ATT&CK, Cyber Kill Chain and STRIDE: comparison and application scenarios. Reconnaissance Weaponization Delivery Exploitation Installation Command And Control Actions And Objectives Cyber kill chain S poofing T ampering with data R epudiation I nformation disclosure D enial of Service E levation of Privilege STRIDE ATT&CK Adversary Objective Step 1 Step 2 Step 3 Step 4 Step 5 Step 6 modelling of the attack associated with the threat while highlighting potential mitigation, and finally, MITRE ATT&CK can be used to identify similar attacks, the associated groups, the activities (techniques) deployed to achieve the adversarial goal, and finally, identify the countermeasures. Figure 4 shows a diagram (center of the figure) associated with a generic cybersecurity attack involving several steps (from Step 1 to Step 6) affecting the ICT infrastructure before reaching the final adversary objective. The STRIDE framework can support the analysis and early identification of vulnerabilities associated with the entry point (Step 1), each of the services exploited by the adversary to move throughout the ICT infrastructure (Step 2 TO 5), and finally, the vulnerability associated with the target objective (Step 6). Conversely, CKC can be effectively adopted to create a model of the consecutive and causal events that allows the adversary to reach its objective (Step 6) from early stages (Step 1)-it is worth highlighting that a proper modelling can help the security risk assessment team to break the attack at each step by deploying the correct countermeasure thus preventing the adversary to move forward and reaching its objective. The Unified Kill Chain (UKC) [3] has been proposed by Paul Pols in 2017 as the result of his Master Thesis. UKC both extends and improves the CKC by considering threats that go beyond malware and the corporate perimeter. Nevertheless, UKC is still based on a (more extended) sequence of adversary actions being based on the concept of kill chain . Finally, we report the Diamond model (DM) [4] mainly considered in the field of intrusion analysis. DM involves 4 entities, i.e., the adversary, the capability, the infrastructure, and the victim. The analysis of the intrusion is performed by considering a description of the 'adversary\", its 'capabilities\", how it interacts with the target 'infrastructure\" in order to achieve its objectives against the 'victim\".",
  "4 IN-DEPTH ANALYSIS AND USE CASES MAPPING": "In this section, we introduce the list of the papers taken into account in this survey. The resulting list has been obtained by searching for the keywords 'MITRE\" and 'ATT&CK\" in Google Scholar. We only consider the contributions where 8 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri Table 1. Our reference list of papers (1/2). the MITRE ATT&CK framework is a strict requirement for achieving the objectives of the paper, while we discarded all the other ones. Table 1 and 2 shows the list of the considered papers, where we report the title of the paper, the year of the publication, the authors' country, and finally, the number of citations collected up to the writing of this survey. Figure 5 shows the 'cloud of words\" generated from the text extracted from the considered papers. While attack is the most common word, as expected other common words are threat and technique which are core concepts in the framework, while the security and system concepts are instantiated depending on the scenario application. Inspired by the seminal white paper [63], we initiate our analysis by categorizing the works as a function of the use cases proposed by [63]: -Behavioral analytic MITRE ATT&CK: State of the Art and Way Forward 9 Table 2. Our reference list of papers (2/2). Table 3. Use-case categories. -Adversary emulation / Red teaming -Defensive gap assessment -CTI enrichment Table 3 summarizes this categorization, while in the following, we map the papers to each identified category.",
  "4.1 Behavioural analytic": "In this section, we consider all the papers addressing the analytical description of the adversary behaviour throughout different methodologies, input and metrics. Indeed, the behaviour of the adversary is a key component for both forensic 10 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri feature follow Fig. 5. WordCloud computed over the set of papers considered for this survey. attack threat security technique system cyber datum base model network information tactic mitre adversary process malware access analysis attacker action framework level result ttps control https report intelligence method detection provide vulnerability approach event defense table procedure step show work propose tool ieee different target identify high scenario file knowledge enterprise include figure create dataset chain software risk label time matrix graph first describe emulator case exploit available team group number type source cluster section research user score apply example classification ontology present conference machine analyst detect phase perform require behavior generate malicious multi value cybersecurity support operation and forecasting purposes, while the ATT&CK framework represents a rich source of information to this goal. In the remainder of this section, we consider all the papers dealing with the analysis of the adversarial behaviour by either considering the data from the ATT&CK matrix or from real-world dataset which are mapped to the tactics, techniques and procedures in the ATT&CK matrix. 4.1.1 Learning the Associations of MITRE ATT&CK Adversarial Techniques, 2020, [9]. Authors propose a machine learning based approach employing hierarchical clustering in particular to extract the associations of attack techniques from APT and software attack data from the MITRE ATT&CK framework. This work identifies three key challenges: (i) how important is the establishing an appropriate distance metric for clustering technique associations while maintaining interpretability; (ii) handling multi-dimensional relationships demonstrated by attack techniques; and finally, (iii) Verifying the consistency and importance of the learned hierarchical clustering and techniques associations. For this purpose, authors explore various partitioned clustering methods, e.g., Partion Around Medoids (PAM), K-means, and Fuzzy clustering, and hierarchical methods for clustering attack techniques that take place together in the TTP chain. Nevertheless, given the complexity of the adversarial behaviour and the associated techniques constituting the attack, most of the classic clustering algorithms fails to capture usable associations; therefore, based on their results, they choose hierarchical clustering to represent attack patterns. Accordingly, from APT attacks dataset, they are able to infer 37 fine-grain technique associations and from software attack dataset, they are able to infer 61 technique associations. Mutual information has been considered as main criterion for evaluation, and their results show acceptable predictability for APT attacks: 78% of the fine-grain and 75% coarse-grain technique associations. 4.1.2 Characterizing Attacker Behavior in a Cybersecurity Penetration Testing Competition, 2019, [19]. This research proposes an analytical approach to characterise attackers behavior based on a dataset of events collected from the 2018 National Collegiate Penetration Testing Competition (CPTC'18). The main objective is to familiarize developers and administrators with attackers mindsets using tactics and techniques from the MITRE ATT&CK framework. For MITRE ATT&CK: State of the Art and Way Forward 11 this purpose, authors analyze a inter-modal dataset including over 500 million events from six teams of attackers. The main phases of the proposed approach is evidence gathering by analyzing exploited vulnerabilities and behavior characterization by mapping captured events to the tactics and techniques of the ATT&CK framework. The evaluation is performed by applying the identified methodology to the events associated with the different teams. 4.1.3 Modeling Attack, Defense and Threat Trees and the Cyber Kill Chain, ATT&CK and STRIDE Frameworks as Blackboard Architecture Networks, 2020, [20]. Authors propose the Blackboard Architecture Cyber Command Entity Attack Route (BACCER) that is a generalized approach to model and analyze framework/paradigm-based attacks. While best practices involve the deployment of a single exploit for a single identified target, authors propose to combine rules and facts that demonstrate attack types and corresponding decision making logic with actions: BACCER uses Blackboard Architecture networks [65] to model and analyze attack paradigms. BACCER's efficiency has been verified by modelling and implementing samples of attack and defense trees. Finally, authors also discussed its efficacy to model other types of frameworks, such as the MITRE ATT&CK framework. 4.1.4 Tactical Provenance Analysis for Endpoint Detection and Response Systems, 2020, [8]. This research introduces a concept, called Tactical Provenance, that represents casual dependencies between threat alerts generated by Endpoint Detection and Response (EDR) solutions. They encode casual dependencies into Tactical Provenance Graphs (TPG) that are more compressed compared to classical whole-system provenance graphs as of their abstract nature and better visualization capabilities. This helps the security analysts to optimize the inspection process. As the next phase of their research, the authors propose a threat scoring algorithm based on TPGs to assign appropriate scores and rank threat alerts. MITRE ATT&CK framework is used as a knowledge base for their threat analyzing and processing tasks. The proposed approach is evaluated using the Symantec EDR tool in an enterprise environment. They claim that the achieved results show 87% overhead reduction in system logs storage. Moreover, the proposed approach enhances the threat detection precision of the Symantec EDR. 4.1.5 Sok: Att&ck techniques and trends in Windows malware, 2019, [14]. This research has conducted an automated analysis and investigation of a sample dataset of 951 Windows malware families mapped and plotted on the MITRE ATT&CK framework. The authors claim that this research work is the first to use the MITRE ATT&CK framework to present the results of analyzing a large samples of malware. The malware samples have been collected from Malpedia that is a malware database developed and maintained by Fraunhofer FKIE 1 . For malware analysis, the authors use Joe Sandbox Cloud 2 which is a public environment automating dynamic inspection for static and network analysis. Their results show an improvement in the implementation of file-less execution vectors using Windows Management Instrumentation (WMI) and PowerShell, discovery of security software and DLL side-loading for defense evasion. These results indicate how malware developers are empowering their tactics in order to bypass classic and traditional defense strategies. 4.1.6 A Threat Hunting Framework for Industrial Control Systems, 2021, [39]. An ICS Threat Hunting Framework (ICS-THF) for early ICS cyber threat detection is proposed in [39]. The proposed framework has three main phases: (i) an initial phase devoted to the detection of any event or external resource triggering the hunting stage, e.g., notifications from third parties and data received from security analysts; (ii) a threat hunting phase that combines and aggregates two source of data, MITRE ATT&CK framework and Diamond intrusion analysis model, in order to define and build 1 https://malpedia.caad.fkie.fraunhofer.de/ 2 https://www.joesandbox.com/ 12 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri a hunting hypothesis for predicting the future actions of the adversary; and finally, (iii) a Cyber Threat Intelligence (CTI) phase to generate Indicators of Compromises (IoCs), such as TTPs, IPs, etc., to aid organizations learning existing threats. In the proposed framework, CTI is extracted from the actions of identified adversaries. For the evaluation of the proposed approach, they use three scenarios: (i) Black Energy 3 malware, (ii) PLC-Blaster malware, and finally, (iii) SWaT dataset. Based on the obtained results, the authors claim that enterprises can leverage the proposed framework to design and develop customized threat hunting solutions for their own ICS networks. 4.1.7 MITRE ICS Attack Simulation and Detection on EtherCAT Based Drinking Water System, 2021, [42]. Authors propose a machine learning based detection approach along with a host based intrusion detection for protecting EtherCAT based drinking water system. In particular, authors propose a SVM-based detection algorithm for detecting attacks on field devices. Moreover, they use Wazuh HIDS 3 for detecting attacks within the SCADA system control center. Attack vectors have been designed based on the techniques of the MITRE ICS ATT&CK matrix during their design and development. Finally, they adopted Elasticsearch, Logstash and Kibana (ELK Stack) to visualize the proposed detection system. 4.1.8 Clustering Using a Similarity Measure Approach Based on Semantic Analysis of Adversary Behaviors, 2020, [45]. This work describes a 3-layers approach to analyze the statistical features of APT groups. Those 3 layers are Goal, Behavior and Capability. Authors mainly concentrate on the statistical features of APT groups, and utilize this model to analyze optimized methods of using threat intelligence information. Next, they present a similarity measuring method to capture similarity degree considering different semantic relationships between groups. Finally, they considered the Girvan-Newman clustering algorithm [66] to find community groups. In their experiments, they build a knowledge network for the behavior analysis leveraging the MITRE ATT&CK data, and finally, they considered the similarity among the groups by building a knowledge network from the collected data. 4.1.9 MITRE ATT&CK-driven Cyber Risk Assessment, 2022, [53]. Authors propose a hybrid cyber risk assessment methodology based on (i) vulnerability-oriented approach, (ii) asset/impact-oriented approach, (iii) threat-oriented approach. This work combines the ATT&CK repository with attack graphs to calculate attacks' occurrence probability and their potential success rate. For this purpose, first, it identifies business-critical objectives and corresponding threats. Then, it identifies special threat and environmental parameters to analyze the threat and its potential impacts. To summarize, the proposed methodology has 3 main steps: (i) organization modeling, (ii) threat modeling, and finally, (iii) impact assessment. The evaluation is supported by a case study of a health center located in the United Kingdom to conduct a series of risk analysis tasks against two adversary groups, i.e., Lazarus and menuPass. 4.1.10 HOLMES: Real-time APT Detection through Correlation of Suspicious Information Flows, 2019, [5]. Authors propose an APT detection system, namely HOLMES, that correlates tactics, techniques, and procedures deployed to carry out by each APT. This work proposes an APT detection system (HOLMES) that extracts suspicious information during cyberattacks. HOLMES starts with host logs or audit data, such as Linux auditd or Windows ETW data, and by leveraging the ATT&CK matrix, it issues a detection alert mapping the phases of an ongoing APT campaign. Then, it generates a high-level scenario graph (HSG) that represents the attacker's malicious actions in real-time. HSG is employed by security analysts for designing real-time cyber-response operations. The authors have evaluated HOLMES on a dataset provided by DARPA Transparent Computing program that employed a professional red-team simulating 3 https://documentation.wazuh.com/3.13/user-manual/capabilities/anomalies-detection/how-it-works.html MITRE ATT&CK: State of the Art and Way Forward 13 nine real-world APT threats on a dynamic network consisting of different platforms. Based on the obtained results, they believe that HOLMES is able to detect and analyze APT campaigns with an acceptable accuracy and low false alarm rate. Finally, HOLMES can be deployed to serve as a real-time intrusion detection tool. 4.1.11 A machine learning framework for investigating data breaches based on semantic analysis of adversary's attack patterns in threat intelligence repositories, 2019, [10]. This work proposes a machine learning based framework that detects suspicious and malicious activities based on its previously observed attack patterns used as its training dataset. The proposed solution semantically identifies and correlates threats and TTPs provided by popular knowledge-bases, e.g., MITRE ATT&CK, with corresponding detection mechanisms to build a semantic network. Such a dynamic semantic network is employed by security experts to detect various attacks by forming probabilistic relationships among threats and TTPs. For training the proposed framework, the authors use a TTP taxonomy dataset, and they use threat artifacts reported in threat reports for its performance evaluation. Finally, the authors have conducted experimental tests based on a financial malware case study. Their results show 92% accuracy rate and significantly low false positive rate. 4.1.12 Optimal Machine Learning Algorithms for Cyber Threat Detection, 2018, [15]. This work presents multiple examples about leveraging machine learning analytic to enhance cybersecurity monitoring and analysis. The authors propose machine learning techniques as an ideal choice to design and develop context-aware detection mechanisms helping to reduce false positive rate. To this aim, they firstly analyze multiple taxonomies to choose a standard cyberthreat knowledge-base. They select ATT&CK and CAPEC to design their methodology. Next, they analyze applications of supervised, semi-supervised and unsupervised techniques in threat detection, and they conclude that semi-supervised algorithms, e.g., One-Class SVM, are significantly efficient and cost-effective enabling Security Operation Centers (SOC) analysts conduct new detection methods and discovering new indicators of compromise (IoCs). 4.1.13 Artificial Intelligence empowered Cyber Threat Detection and Protection for Power Utilities, 2019, [30]. This work analyse how Artificial Intelligence can enhance the performance and efficiency of traditional cyberattacks detection systems. More specifically, the authors investigate how Machine Learning (ML) techniques can detect different attack stages of APT. MITRE ATT&CK framework is employed for this purpose. They believe that AI-enabled detection systems can detect anomalies in wider patterns of adversary activities and present more comprehensive and dynamic detection capabilities. IBM Watson 4 is adopted for cyber analysis tasks and detecting security threats. Finally, authors consider as a main use case the power utilities SCADA systems. 4.1.14 Automating Cyber Threat Hunting Using NLP, Automated Query Generation, and Genetic Perturbation, 2021, [36]. Authors propose AI-based techniques for the automation of DSL entries in support of threat detection. This work introduces the WILEE system which is an automated attack hunting system translating high-level abstract cyberthreat reports into multiple detailed concepts. Custom domain specific language (DSL) is used to represent both high-level and corresponding detailed concepts. WILEE uses such concepts to automatically generate queries to validate the hypotheses tied to the potential adversarial activities. Next, two AI components of WILEE that automate its query generation for hunting are described in details: (i) a hunt component, called Malmo, that automates extraction and translation of known threat descriptions from MITRE ATT&CK into machine digestible format using NLP techniques, (ii) a genetic programming hunt component, called Genetic Perturbations Engine (GPE), as a generator of implementations of threats. 4 https://www.ibm.com/watson 14 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri 4.1.15 GroupTracer: Automatic Attacker TTP Profile Extraction and Group Cluster in Internet of Things, 2020, [37]. Authors propose a framework, called GroupTracer, for automatically observing and predicting complex IoT attacks based on ATT&CK matrix. The proposed framework identifies attacks activities by leveraging IoT honeypots and it retrieves complementary information from corresponding logs. Next, it maps the attack behaviors to the ATT&CK matrix to perform automatic TTP profiles extraction. Finally, using hierarchical clustering techniques and based on four feature groups (TTP profiles, Time, IP, URL) and 18 characteristics derived from log entries, it clusters attack behaviors and generates attack trees for each cluster in order to discover potential groups behind complex attacks. In the experiment phase, they compare their proposed algorithm with two baseline algorithms by evaluating 395,006 log entries from 3,025 IPs. Based on the achieved results, they claim that GroupTracer can reach to highly acceptable performance as the Calinski-Harabasz index reaches 3416.93. 4.1.16 DMAPT: Study of Data Mining and Machine Learning Techniques in Advanced Persistent Threat Attribution and Detection, 2021, [47]. This work analyses machine learning and data mining techniques performance and efficiency for APT malware detection and profiling. First, it compares different APT detection techniques and highlights their research gaps to be addressed by cybersecurity community. The authors believe that even though researchers have proposed different APT detection techniques, there are significant shortcomings to be addressed in order to enhance current detection mechanisms. The identified challenges are: (i) lack of qualified benchmark datasets for training and evaluation, (ii) continuous changes in TTP usage by APTs resulting high false positive rate. Consequently, qualified and comprehensive benchmark datasets and well-designed robust machine learning models are needed in order to characterize and detect APTs. 4.1.17 Open Source Intelligence for Malicious Behavior Discovery and Interpretation, 2021, [50]. Authors propose a MITRE ATT&CK based malicious behavior analysis system (MAMBA) incorporating ATT&CK knowledge into neural network models for MS Windows malware detection. This work exploits Open Source Intelligence (OSINT) for the analysis of several malware. The goal is to discover malicious activities and corresponding TTPs by analyzing the execution trace associated with the malware under the Windows operating system. For this purpose, they follow 3 main phases: (i) OSINT for cyber threat intelligence, (ii) malicious behavior discovery, and finally, (iii) malicious behavior explanation. Next, they propose the MAMBA system addressing the aforementioned aspects. MAMBA uses a well-designed neural network model to extract TTPs from the ATT&CK matrix and correlate them with corresponding malware API execution call sequences. For regular synchronization with ATT&CK updates, MAMBA automatically collects knowledge in an incremental process. Consequently, they authors believe that MAMBA is explainable, comprehensive and extendable with a significantly high detection rate compared to the other analyzed methods and approaches. To prove this, MAMBA has been evaluated based on four scenarios: (i) performance evaluation and comparison with other methods, (ii) ablation test, (iii) APT29 case study, and finally, (iv) resource and API locating. 4.1.18 Game-Theoretic Decision Support for Cyber Forensic Investigations, 2021, [54]. This work models the interaction between a cybersecurity analyst and an advanced attacker using a game-theoretic framework (Bayesian game). A graph of actions representing the investigator and the attacker moving across different hosts is generated. The graph edges represent TTPs among different network nodes and the graph nodes represent parties' decisions. Hence, using this modeling the investigator can identify the optimal policies by inspecting the cost and impact of every action. Accordingly, a game-theoretic decision support framework is proposed trying to improve the performance of an investigator against a highly capable attacker. The authors believe that this is the first step towards using game-theoretic concepts for MITRE ATT&CK: State of the Art and Way Forward 15 forensic investigations. As for the evaluation, they conduct a series of experiments by constructing a real-life case study based on: (i) threat reports collected from the MITRE ATT&CK STIX repository, (ii) Common Vulnerability Scoring System (CVSS), and finally, (iii) consultations with cyber-security experts. They compare the achieved results with two other investigative methods (Uniform and CSS) and three different types of attackers. 4.1.19 Fingerprint for Mobile-Sensor APT Detection Framework (FORMAP) Based on Tactics Techniques and Procedures (TTP) and MITRE, 2022, [56]. This work proposes a fingerprint for mobile-sensor APT detection framework (FORMAP) based on the correlation between the MITRE framework, the mobile sensors and the attack trees. The goal of the proposed framework, namely FORMAP, is to improve the security awareness to detect APT attacks on smartphones. The main objectives of this work are: (i) studying smartphone sensors (inertial, positioning and ambient) vulnerabilities exposed to APT attacks, (ii) designing a set of attacks trees for Mobile APT based on MITRE ATT&CK framework, and finally, (iii) proposing a smartphone APT detection framework. The authors believe that FORMAP can be a ground knowledge for researchers to better understand mobile phones TTPs. 4.1.20 Evolution of IoT Linux Malware: A MITRE ATT&CK TTP Based Approach, 2021, [58]. Regarding the significant increase on the attacks targeting Internet of Things (IoT) devices, this research proposes an approach to keep track of the evolution path of techniques and capabilities employed by IoT linux malware. For this purpose, they leverage MITRE ATT&CK matrix to discover and characterise current threats (also covering pre- and post-exploitation aspects) and provide useful insights. In their analysis environment, they analyze 14 unique IoT Linux malware families collected recently. Based on the achieved results, they claim that ransmoware are more static respect to botnet malware, which indeed changes quickly and can be employed by different kinds of adversary techniques. 4.1.21 Identifying ATT&CK Tactics in Android Malware Control Flow Graph Through Graph Representation Learning and Interpretability, 2021, [59]. . This research proposes an approach to automate identifying and locating TTPs in a Control Flow Graph (CFG) by using Graph Machine Learning techniques on Android Malware. The authors believe that identifying sub-graphs in the malware CFG provides insights about malware behavior and corresponding mitigation strategies. For this purpose, from a CFG, the sub-graph representing malware executable execution flow is selected (using attribution techniques) and associated with corresponding TTPs. They use Graph Neural Networks and SIR-GN node representation learning technique to analyze CFGs and generate a model that classifies associated TTPs. Based on their experiments, they believe that the proposed methodology outperforms graph isomorphic networks and graph attention networks. Wrap up on Behavioural analytic. This class of use cases focuses on providing the most accurate model of the adversary in terms of sequence of malicious actions that can be done against a target. The ATT&CK matrix can be very helpful in mainly two ways: (i) as a source of information and (ii) as a support to behavioural modelling. The former considers the ATT&CK matrix as a database of techniques-as indeed it is-while considering hidden relations and extracting correlations to perform a better adversarial modelling to improve the identification of the APT behind the attack. The latter considers the ATT&CK matrix as a support tool for different purposes, e.g., matching the adversarial behaviour extracted from real measurements, abstracting from a pattern of actions in a specific scenario to a more general behaviour, generalization of results, or finally, driving the analysis of real data. Finally, we found one only paper performing a comparison between the ATT&CK framework and STRIDE, and we decided to report it as standalone. Although the proposed categorization for the behavioral analytic might be blurry for 16 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri Fig. 6. Behavioral analytic with the ATT&CK matrix: We identified three main relations with the ATT&CK matrix, i.e., Input, Support, and Comparison. The ATT&CK matrix can be used as (i) a data input-being a database of techniques, (ii) a support tool for driving the description of the adversarial behaviour, or finally, (iii) as a comparison criteria-being itself a tool for adversarial behaviour categorization. ATT&CK Input Behavioral Support Analytics Comparison some of the papers, we try to extract the main relation in order to provide a more clear analysis when reporting the paper as it follows: -Input: [9], [45], [53], [5], [15], [54], [58], and [59]. -Support: [19], [39], [42], [10], [30], [36], [37], [47], [50], and [64]. -Comparison: [20].",
  "4.2 Red teaming": "Red teaming represents the set of practices of challenging a target system in order to test its security and privacy robustness. In this section, we consider the red teaming use case and we study how the current state of the art leverages the ATT&CK framework to enhance such activity. 4.2.1 Threat Modeling Based on the MITRE Enterprise ATT&CK Matrix, 2022, [11]. Authors uses the MITRE Enterprise ATT&CK matrix to propose a threat modeling language, called enterpriseLang , for enterprise security. The proposed threat modeling language which is a Domain Specific Language (DSL), is designed based on the Meta Attack Language (MAL) framework [67] and concentrates on representing system assets, asset associations, attack phases, and defense strategies. The attack phases in enterpriseLang represent MITRE ATT&CK matrix adversary techniques. For modeling enterprise IT systems, an entity-relationship model is embedded in the language enabling attack simulations on the system model instances. From design perspective, enterpriseLang has six steps: (i) problem definition & Motivation, (ii) Defining general and specific Objectives, (iii) Design & Development, (iv) Demonstration, (v) Evaluation, (vi) Communication. For evaluation, the proposed language is tested based on a group of unit and integration tests. More specifically, enterpriseLang is used to model two known real-world attack scenarios: the Ukraine cyber attack and the Cayman National Bank cyber heist. 4.2.2 SoK: A Survey of Open-Source Threat Emulators, 2022, [25]. Authors provides a survey reviewing and comparing 11 open-source threat emulators in order to verify whether MITRE ATT&CK tactics and techniques can be performed and tested by these emulators. In this survey, the authors propose a methodology to quantitatively and qualitatively compare threat emulators with respect to a list of criteria and present a taxonomy that illustrates threat emulators MITRE ATT&CK: State of the Art and Way Forward 17 quality. The main objective of this work is providing guidelines for security teams to choose the most appropriate cyberthreat emulator depending on the target context and application. The investigated threat emulators are: PowerSploit, APTSimulator, Uber's Metta, CALDERA, Infection Monkey, DumpsterFire, Atomic Red Team, Metasploit, Red Team Automation, BT3 and Invoke-Adversary. Their obtained results demonstrate that these four open-source threat emulators are outperforming others: RTA, Atomic Red Team, Metasploit and CALDERA. 4.2.3 Probabilistic Attack Sequence Generation and Execution Based on MITRE ATT&CK for ICS Datasets, 2021, [28]. Authors propose an automatic attack sequence generation approach consistent with MITRE ATT&CK tactics and techniques in order to define and deploy an attack dataset. In this research, the authors consider three aspects for a qualified attack sequence generation: (i) reproducibility, (ii) diversity, (iii) reality. Accordingly, they propose an attack sequence generation approach that uses Hidden Markov Models (HMM) as its core component. The main characteristics of this approach are: (i) representable attack sequence, (ii) probabilistic attack sequence, and finally, (iii) practical attack sequence. The authors have evaluated their proposed approach based on 3 different case studies covering general and specific ICS infrastructures. 4.2.4 powerLang: a probabilistic attack simulation language for the power domain, 2020, [21]. Authors propose powerLang as a Meta Attack Language (MAL) based Domain-Sepcific-Language (DSL) that can model both power domain information technology (IT) and operational technology (OT) infrastructures. powerLang enables power domain practitioners to model their IT/OT architectures and accordingly simulate the activities of malicious entities. This helps them to detect possible security breaches and improve their infrastructure's security. Authors reuse two exiting MAL-based DSL: (i) coreLang [68], for modeling common information technology infrastructures, and (ii) sclLang 5 , for modeling the internal schema of substations. Next, in order to cover the inconsistencies between the information technology infrastructures and other technical infrastructures, they introduce icsLang that serves as a tool for modeling OT environments. In their experiment, they evaluate the proposed language against a known cybersecurity attack, simulating the Ukrainian electric power grid attack scenario. 4.2.5 Attack Specification Language: Domain Specific Language for Dynamic Training in Cyber Range, 2021, [40]. This research leverages the MITRE ATT&CK framework to propose an Attack Specific Language (ASL) that provides a unified representation for all the cyber-threat scenarios. ASL provides information and knowledge about attack techniques in a brief format that streamlines and automates the malicious activities of threat and challenge execution. It facilitates designing superior and dynamic threat scenarios by providing comprehensive specification methods. Its main features are of easy implementation, seamless integration and process improvement. Authors use the game-theory modeling to provide a formal proof for an improved ASL dynamic training and customization. 4.2.6 Analysis Of Automated Adversary Emulation Techniques, 2017, [13]. This research propose a test-bed for simulating attackers behavior and activities in Windows-based enterprise networks. After conducting a series of experiments, authors prove that an automated attacker outperforms non-automated ones. Their main objective is expanding the automation to the tactical level despite the existing difficulties and challenges. The major components of the proposed simulation environment are: objects or entities, entity-relationships, and control settings. Each simulation can be considered as a game having 3 distinct players: an agent simulating user activities, an attacker and a defender. Overall, sixteen 5 https://github.com/mal-lang/SCL-Lang 18 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri scenarios were created including variations of agent actions, vulnerabilities, connections and detection frequencies. They achieved promising initial results in their experiments automating the entire emulation process. 4.2.7 A review of threat modelling approaches for APT-style attacks, 2021, [17]. This work proposes a literature review investigating existing threat modeling approaches (49 current studies) and building a threat modeling knowledge-base. The main objectives of this research is to define and discover threat modeling challenges, strengths, potential gaps and corresponding enhancements aiming to improve threat modeling efficiency when modeling more complicated attacks, such as the ones coming from Advanced Persistent Threats (APTs). The reviewed research works and approaches are related to different levels of an organization but mainly related to system and data-centric software design, development and operations. Authors claim that there is no particular threat modeling solution covering various assets, threats, vulnerabilities, systems and data. There are a number of features helping to determine which approach to be taken: (i) identify agents, their motivations and capabilities, (ii) correlate threat intelligence information from multiple sources, (iii) identify critical assets and controls, (iv) include stakeholders from different levels, (v) determine system-wide environmental boundaries, (vi) define authentication and authorisation policies, and finally, (vii) select a comprehensive approach that satisfies pre-defined requirements and consists with the underlying audience and environment. 4.2.8 Towards Dynamic Threat Modelling in 5G Core Networks Based on MITRE ATT&CK 2021, [55]. Authors propose an approach to extend MITRE ATT&CK framework by adding a list of 5G related cyber-threat techniques. This research investigates the knowledge sharing between early 5G networks threat analysis and adversarial TTPs of MITRE ATT&CK framework, and it proposes solutions to bridge these gaps. It analyzes the knowledge and theoretical shortcomings of current 5G technology enablers (e.g., Software-defined networking (SDN) and network functions virtualization (NFV)). The main objectives are: (i) identifying 5G Core Networks (5GCN) threat modeling and risk assessment, (ii) adding 5GCN related adversarial techniques into the MITRE ATT&CK framework. Identifying 5GCN adversarial techniques and mapping them to the MITRE ATT&CK framework tactical stages can empower this framework to serve future 5GCN cyber-threat and cyber risk analysis tasks. 4.2.9 From TTP to IoC: Advanced Persistent Graphs for Threat Hunting, 2021, [29]. A formal method modeling cybersecurity concepts from both attacker and defender point of view is proposed in [29]. For this purpose, two persistent graphs are generated: (i) the execution of attacker's procedures mapped to the MITRE ATT&CK framework, (ii) the exposed resources during the execution of attacker's procedures. The graphs help to reduce false positive alarm rates for defenders. Additionally, the proposed approach enhances the defender's knowledge-base by adding new IoCs enabling proactive threat detection. The authors believe that the mutual inference for both attacker and defender in order to improve their knowledge is necessary to reach their goals (in particular for the defender). The proposed approach has been evaluated using an attack campaign mimicking APT29 scenario. Wrap up on Red teaming. The red teaming use case comprises all the papers that leverage the ATT&CK framework to develop, deploy or implement red teaming activities, i.e., malicious activities aiming at testing the security and privacy robustness of a target infrastructure. We identified 3 sub-categories, i.e., real attacks , emulated attacks , and finally, threat (scenario) modelling . Real attacks ([28]) involve papers dealing with real attack patterns while considering the ATT&CK matrix to design the attack itself. Emulated attacks ([25] [21], [13]) involve the study, design and development of tools for the delivery of emulated attacks while the ATT&CK framework is generally considered as the source for the MITRE ATT&CK: State of the Art and Way Forward 19 Fig. 7. Red teaming with the ATT&CK matrix: We identified three main sub-categories where the ATT&CK matrix is used for supporting red teaming activities. Indeed, the tactics and techniques can be leveraged to generate real attacks or environments with emulated ones. Threat modelling can also be supported by the ATT&CK matrix for the definition of new languages and framework that better describe threats. ATT&CK Real Attacks Red Emulated Attacks Teaming Threat Modeling best-known tactics and techniques for performing the attack. Finally, threat modelling ([11], [40], [17], [55]) involves the development of languages or frameworks for the in-depth description and analysis of the threats.",
  "4.3 CTI Enrichment": "The ATT&CK matrix is a database of techniques previously adopted by APTs to launch attacks. When such techniques become linked together to create an attack chain and they can be correlated with other ones to identify and characterize APTs, they become a core component of the Cyber Threat Intelligence (CTI)-the ATT&CK framework can be considered as a ground-truth for sharing information among organizations, thus enriching the internal intelligence about the current threat landscape. 4.3.1 Assessing MITRE ATT&CK Risk Using a Cyber-Security Culture Framework, 2021, [16]. Authors propose to correlate a well-defined set of features including both organizational and individual features with the MITRE ATT&CK framework TTPs and vulnerability databases. In this work, a multidisciplinary security culture framework covering attack patterns of the MITRE ATT&CK matrix, designed for critical infrastructures is being evaluated. This framework can be applied to a wide range of applications, such as organizing security protocols and improving security evaluation results, etc. The main objective of the authors is to link a holistic set of cyber-security culture factors with the tactics and threats listed in MITRE ATT&CK. The proposed cyber-security culture framework evaluates organizations security culture from different perspectives including human and business related parameters. For evaluation, they analyze the framework based on two application scenarios (simple and complex) to demonstrate its adaptability with various type of organizations having different sizes and structures. 4.3.2 Cyber Threat Dictionary Using MITRE ATT&CK Matrix and NIST Cybersecurity Framework Mappting, 2020, [18]. Authors propose an attack-defense mapped framework, called Cyber Threat Dictionary (CTD), linking MITRE ATT&CK matrix to NIST framework. Authors believe that CTD can be used re-actively or proactively within critical infrastructures in order to: (i) identify security gaps to link them to ATT&CK techniques, (ii) develop suitable mitigation and detection techniques, (iii) correlate critical cyber-attack techniques and the Facility Cybersecurity Framework (FCF) 6 controls, (iv) vulnerability prioritization based on the FCF and the correlation matrix, (v) develop appropriate prevention solutions. 6 https://facilitycyber.labworks.org/ 20 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri The two major components of CTD are its search engine which provides details and solution to deal with an attack, and it solution suggestion component which issues appropriate solutions. 4.3.3 Automated Retrieval of ATT&CK Tactics and Techniques for Cyber Threat Reports, 2020, [23]. This research proposes an automated cyber threat report analysis tool, called rcATT to extract valuable security information from Cyber Threat Reports (CTRs). In this research work, in order to automate information extraction from CTRs, the authors investigate mutli-label text classification techniques and map them to the MITRE ATT&CK tactics and techniques. Accordingly, they present rcATT, a solution for predicting ATT&CK tactics and techniques from input CTRs and providing the results in STIX format. rcATT provides the possibility for users to interactively adjust or correct the classification results and improve its performance over time. For evaluation, they test and compare rcATT's features with available open-source solutions and explain its acceptable performance and efficiency. 4.3.4 Learning APT Chains from Cyber Threat Intelligence, 2019, [24]. Authors propose a Natural Language Processing (NLP) based approach to characterise an APT attack actions temporal relationship , and map them to MITRE ATT&CK and STIX-2 frameworks. This research work presents its preliminary results of capturing temporal relationship between threat Indicators of Compromises (IoCs) provided by cyber threat intelligence. For this purpose, first, they design a set of Regular Expressions (regex) to extract IoCs from text data. Next, they develop an NLP typed dependency rule-set to list the temporal relationship between the IoCs in cyber-threat reports and map them to the five stages of kill chain (Deliver, Exploit, Command&Control, Stage, Exfiltrate) associated with the threat IoCs. In the experimentation phase, they process 5000 threat reports from Symantec and Fireeye CTI blogs 7 and analyze them to generate STIX machine-readable constructs. These constructs can be processed by firewalls and Intrusion Detection Systems (IDS). According to the results, they belive that the IoCs extracted from their dataset represent high temporal order correlation helping security solutions to detect attackers activities based on a sequence of temporal events and corresponding IoCs. This helps to improve detection accuracy by reducing the false positive alarm rate generated by IDSs. 4.3.5 Linking CVE's to MITRE ATT&CK Techniques, 2021, [32]. This research proposes a neural-network based model to automate maping CVE's to ATT&CK techniques. The authors to address the lack of labeled data, propose an unsupervised labeling approach that extracts and analyzes phrases from security reports and ATT&CK technique descriptions. Accordingly, they were able to map 17 techniques and create a knowledge-base including 150 attack scenarios and 50 mitigation procedures. The knowledge-base includes both adversary and defender views for any input CVE. Next, using the proposed Multi Label Text Classifier (MLTC), they correlate CVE's with ATT&CK techniques. For evaluation, they use a dataset covering past 10 years CVEs and compare the proposed approach performance with models, such as Term Frequency-Inverse Document Frequency (TFIDF) based SVM multi-label classifier, Bi-direction Long Short-Term Memory (BI-LSTM) and Attention-based BI-LSTM. 4.3.6 Expansion of ICS Testbed for Security Validation based on MITRE ATT&CK Techniques, 2020, [33]. Authors propose an extended testbed to collect and monitor events during a ICS attack, and map them to the MITRE ATT&CK matrix. In this research, the authors main objective is to collect and monitor information during an ICS attack and map them to MITRE ATT&CK framework. Moreover, they propose a framework to simulate various sophisticated cybersecurity attack scenarios. For this purpose, they extend an existing testbed called Hardware-In-the-Loop (HIL) based Augmented ICS (HAI). The authors mainly emphasize on data diversity, data ingestion, attack scenario and time synchronization. 7 https://www.mandiant.com/cyber-threat-intelligence-visualization MITRE ATT&CK: State of the Art and Way Forward 21 4.3.7 Linking Common Vulnerabilities and Exposures to the MITRE ATT&CK Framework: A Self-Distillation Approach, 2021, [38]. Authors propose a self-distillation model called CVE Transformer (CVET) aiming to label CVEs based on information coming from the MITRE ATT&CKframework. CVET includes a fine-tuned distillation model that is the result of using a pre-trained language model called RoBERTa. The proposed methodology has 3 main components: (i) data collection & pre-processing, (ii) the CVE Transformer (CVET) Architecutre, and (iii) benchmark experiments. The proposed model has been evaluated based on a gold-standard dataset and its performance has been compared with classical machine learning (e.g., Random Forest and SVM), deep learning (e.g., RNN and Transformer) and pretrained NLP models, such as BERT and RoBERTa. As future direction, the authors intend to connect and correlate their framework with the CAPEC list and the NIST framework. 4.3.8 Cyber Threat Intelligence Model: An Evaluation of Taxonomies, Sharing Standards, and Ontologies within Cyber Threat Intelligence, 2017, [6]. This work proposes a CTI model enabling security analysts to analyze cyber-threats. In this research, first the authors discuss about a significant need for an ontology for CTI, and list existing difficulties toward proposing such an ontology, such as lack of standard data representation, comprehensive terminology list and their layered hierarchical relationships. Next, they analyze and evaluates existing taxonomies, standards and ontologies. Finally, they propose a CTI model which tries to improve expressiveness of existing taxonomies and ontologies. For evaluation, they use three criteria: (i) covered data and concepts, (ii) correlation with other taxonomies and ontologies, (iii) how easily can be analyzed and investigated. Their results show that proposed ontologies must follow Ontology Web Language (OWL) constraints and restrictions that guarantee high reasoning abilities. 4.3.9 TTPDrill: Automatic and Accurate Extraction of Threat Actions from Unstructured Text of CTI Sources, 2017, [7]. Authors propose an automated and context-aware CTI analytic approach to extract adversarial patterns (TTPs) from accessible CTI repositories and issue appropriate responses. Authors utilizes CAPEC and ATT&CK knowledge-bases to propose a comprehensive attack-response ontology to be used for analyzing cyber-threats and corresponding responses. In addition, they develop a novel Natural Language Processing (NLP) based approach to search and capture structures TTPs. Finally, they connect these components to build a complete threat actions analysis tool, called TTPDrill, mapping each action to an appropriate TTP. TTPDrill is able to analyze structured and unstructured CTI reports and extract malicious activities and corresponding TTPs in an standard format, such as STIX 2.1. For evaluation, they use a dataset of 17000 cyber-threat reports provided by Symantec. The evaluation results demonstrate that TTPDrill's detection precision and recall goes over 82%. 4.3.10 Integrating Cyber-D&D into Adversary Modeling for Active Cyber Defense, 2016, [12]. This research introduces cyber Denial and Deception (cyber-D&D) that uses an experimental and engineering paradigm to combines security research and experiments into cyber-D&D actions. In other words, it discusses how to integrate cyber-D&D tools and TTPs into threat modeling knowledge-bases, such as MITRE ATT&CK aiming to provide active cyber defense (ACD) recommendations for critical environments and infrastructures. For this purpose, they describe the key elements required for this integration: (i) cyber threat intelligence, (ii) systems and network sensors, (iii) intrusion detection and analysis, (iv) defender mitigation, (v) Red-Blue experimentation. They believe that a defensive cyber-D&D integrates standards, threat repositories, operational resources and active defense systems. 4.3.11 Towards a Definition of Cyberspace Tactics, Techniques and Procedures, 2017, [26]. This paper proposes a set of models for offensive cyberspace operations (OCO) allowing autonomous detection of cyber-attacks. Authors provide the definitions for cyberspace operations supported by mathematical modeling to improve their efficiency and usefulness 22 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri for advanced data analytics applications. Finally, these definitions are proved to be consistent to model a sequence of real-world cyberspace activities conducted by APT28 8 . 4.3.12 On the use of Cyber Threat Intelligence (CTI) in Support of Developing the Commander's Understanding of the Adversary, 2019, [27]. This research describes the NATO Allied Command Transformation (ACT) and the NATO Communication and Information Agency (NCI Agency) experiments that concentrate on using deception techniques, such as honeypots to capture and analyze attackers activities data. In particular, the MITRE ATT&CK framework has been utilized during the experiments to identify known adversary patterns and to be correlated with the collected traffic in order to provide required information for responsible Commanders. The overall goal was achieved by conducting three test cases: (i) validating the importance of honey pots data, (ii) validating the relevancy of captured data with MITRE ATT&CK framework, and finally, (iii) validating the operational context based on the results of previous steps. 4.3.13 Attack Hypothesis Generation, 2019, [31]. Authors propose an Attack Hypothesis Generator (AHG) to generate hypothesis regarding cyber-attacks existing in the underlying context. AHG leverages threat intelligence knowledgebases (e.g., MITRE ATT&CK) to issue useful complementary information about the equipment and strategies used by attackers during a cyber-attack. For this purpose, it complements threat intelligence graph by adding information coming from recommendation provision techniques to identify ongoing attacks features and attributes resulting in actionable investigative items. More specifically, authors use machine learning techniques (both supervised and unsupervised) for prediction and collaboration tasks. In summary, AHG's contributions are: (i) utilizing CTIs to enhance attack hypotheses, (ii) enhancing hypotheses accuracy, (iii) suggesting actionable items. One of the major outcomes and benefits of AHG is improving automated forensic analysis tasks and procedures. For AHG performance evaluation, the authors prepared a hypothesis simulation environment to analyze and compare experts' hypothesis with AHG ones. The results demonstrate significant accuracy increase on the experts' hypothesis that can lead toward high-end and sophisticated investigations and inspections. 4.3.14 Automatically Attributing Mobile Threat Actors by Vectorized ATT&CK Matrix and Paired Indicator, 2021, [34]. Authors propose an automated methodology to classify mobile malware using MITRE ATT&CK framework. For this purpose, a mathematical modeling of the ATT&CK matrix is proposed to analyze and compare Indicators of Compromise (IoC) and provide complementary insights. The main objective is to automate the task of classifying mobile threat related TTPs while decreasing the false positive rate. This can lead to process a significantly high volume of Mobile incidents TTPs that is very useful for the field. In their experiments, they use the proposed approach to evaluate 12 threat actors and 12 malware. Based on their results, the authors believe that this approach can appropriately handle large-volume cyber-threat analysis tasks that represents its potentials to be used in various threat intelligence organizations. 4.3.15 Data-Driven Decision Support for Optimizing Cyber Forensic Investigations, 2021, [22]. This paper introduces DISCLOSE: a decision support platform for performing advanced forensic analysis tasks. It uses popular knowledge-base, such as MITRE ATT&CK TTPs, as threat intelligence information to characterise threats and their behaviors/activities. Consequently, DISCLOSE empowers the security analysts to conduct efficient investigation of probabilistic relations among attacks actions. For evaluation, the authors verify DISCLOSE performance based on a case study that includes 9 cyber-threat scenarios (3 incidents and corresponding triggering actions) mapped to 31 TTPs. 8 https://attack.mitre.org/groups/G0007/ MITRE ATT&CK: State of the Art and Way Forward 23 4.3.16 Price TAG: Towards Semi-Automatically Discovery Tactics, Techniques and Procedures of E-Commerce Cyber Threat Intelligence, 2021, [48]. The main objective of this research is semi-automatically extracting TTPs from e-commerce threat intelligence corpora and mapping them with MITRE ATT&CK framework. One main challenge is how to efficiently analyze and investigate a significantly high volume of e-commerce data to extract hidden CTIs. For this purpose, authors leverage NLP techniques (e.g., topic modeling and named entity recognition) to propose an approach called TTP Semi-Automatic Generator (TAG) performing e-commerce TTP extraction. In their experiments for TAG evaluation, they evaluate TAG using a dataset of 229,729 e-commerce security incidents. Their results show that TAG was able to extract 6,042 TTPs with 80% precision proving that TAG has the capability to analyze highly complex and evolving threats. Moreover, they found a number of emerging 0-day attack patterns and corresponding CTIs showing exploited tools and strategies by attackers. They reported these findings to the Alibaba Group. As future work, they intend to address a limitation which is attackers can evade TAG by adjusting the operational model, such as using utility-preserving adversarial text. 4.3.17 TIM: threat context-enhanced TTP intelligence mining on unstructured threat data, 2022, [49]. This research defines TTP intelligence representing all the TTP related information extracted from the under-analysis dataset. Hence, TTP classification can be represented as a phrase classification task. For TTP intelligence mining, first, they label a dataset of 10,761 cyber-threat reports that includes 6 TTP classes and 6,061 TTPs. Next, they propose a TTP Intelligence Mining (TIM) framework to extract TTP intelligence insights from a large-volume unstructured security dataset. TIM framework employs Threat Context Enhanced Networks (TCENet) to extract and classify TTP intelligence, and based on the authors claim, it is the first work performing the sentence level TTP classification. its results are generated in STIX 2.1 standard format to be shared and used with other tools. Their evaluation results show 0.941 accuracy which outperforms previous TTP classification approaches. Authors claim that adding TTP element features can even improve this classification accuracy. 4.3.18 Threat intelligence ATT&CK extraction based on the attention transformer hierarchical recurrent neural network, 2022, [57]. This work introduces Attention-based Transformer Hierarchical Recurrent Neural Network (ATHRNN) being an NLP attention-based model to automate extracting ana analyzing TTPs from unstructured CTI reports. ATHRNN uses MITRE ATT&CK framework as its knowledge-base to extract TTPs. Authors present a Transformer Embedding Architecture (TEA) to retrieve semantic representations of CTIs and corresponding ATT&CK metadata. Next, they present an Attention Recurrent Structure (ARS) to represent the tactical and technical labels dependencies in MITRE ATT&CK framework. Lastly, they use a joint Hierarchical Classification (HC) model to extract their target tactical and technical categories from cyber-threat datasets. To validate their proposed approach, authors build a benchmark dataset from threat reports generated from multiple sources. Their experiments results based on the gathered dataset, represent that they achieved 6.5% and 8.2% accuracy increase for Macro-F score and Micro-F score. 4.3.19 Enhancing the STIX Representation of MITRE ATT&CK for Group Filtering and Technique Prioritization, 2022, [61]. This research enhances the MITRE ATT&CK STIX representation to make it queryable based on various contextual information, such as activity groups motivations, the origin country, the target segments and locations, etc. For this purpose, authors discuss about the structure of ATT&CK groups and details of the structures (e.g., MITRE's STIX 2.1 representation). Next, they integrate the proposed enhancements to STIX 2.1 format of the MITRE ATT&CK ˙ The enhancements mainly concentrate on the contextual information to enable constructing sophisticated queries and utilize the knowledge-base in a more detailed fashion. Hence, they employ STIX 2.1 objects to extract and represent the 24 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri contextual information in a highly structured format. Finally, they demonstrate how to use the enhanced representation using programming (JSON compatible) and querying languages (e.g., MS SQL). 4.3.20 Visualizing Interesting Patterns in Cyber Threat Intelligence Using Machine Learning Techniques, 2022, [62]. This research proposes a machine learning based CTI reports visualization mechanism to illustrate hidden insights of threats and help analysts issue appropriate mitigation actions and recommendations. The main goal of the authors is to facilitate understanding the current cyber threat landscape and applying suitable mitigation. For this purpose, they conduct experimental data verification tasks using a set of open source datasets (e.g., Hail-a-Taxii 9 ). They train machine learning models using ATT&CK TTPs and use them to identify and detect malware behind cyber incidents from multiple perspectives (e.g., domain addresses, IP addresses, prevalent TTPs, file types, etc.). Based on the achieved results, the authors believe that the trained models are able to predict threat actors and malicious activities with 86% accuracy. 4.3.21 Automatic mapping of vulnerability information to adversary techniques, 2022, [43]. This research proposes a solution to automate correlating software vulnerabilities to the MITRE ATT&CK framework using multi-label machine learning classification techniques. For this purpose, they use the vector representation of the vulnerability description (e.g., CVE) as an input to a group of multi-label classification methods. The authors believe that using multi-label classification can improve the process of inferring adversarial techniques because a particular vulnerability can be linked to multiple cyber-threat strategies. For training and evaluation of the classifiers, they use 8,077 examples from a dataset provided by The European Union Agency for Cybersecurity (ENISA). Their results show that the LabelPowerset and Multilayer Perceptron methods performs better than others. Wrap up on CTI enrichment. Cyber Threat Intelligence enrichment is a complex process involving several bestpractices, methodologies and models to enrich the current state of the CTI. The general idea is rooted on combining information from different sources to generate a more detailed picture of the threat landscape. The literature review has identified several sources that combined with the ATT&CK framework can enrich the corporate CTI. Figure 8 shows the identified sources, i.e., Human factors ([16]), NIST ([18]), Reports ([23], [24], [48], [62]), CVE ([32], [38]), Logs ([33], [27]), Text ([7], [49], [57]), and finally, Tools ([12]). A set of papers [31], [34], [22], [61] just considers the ATT&CK matrix as unique source, while [6] and [26] propose new modelling frameworks to support the CTI enrichment.",
  "4.4 Defensive Gap Assessment": "Defensive Gap Assessment is a critical component of the security risk assessment process. Investigating the gaps of the defensive strategies deployed in a corporate ICT infrastructure is of paramount importance-this including the analysis of the tools, procedures and policies to detect and mitigate cyber attacks. The ATT&CK framework can support the defensive gap assessment given the huge amount of techniques and procedures it contains: assuming a specific business, we can identify the APTs targeting it, and finally, all the possible tactics, techniques and procedures creating a consistent threat landscape thus enabling the assessment of the current defensive status of the organization. 4.4.1 Security Assessment Rating Framework for Enterprises using MITRE ATT&CK Matrix, 2021, [44]. This work introduces a MITRE ATT&CK based cyber security analytical rating framework enabling organizations to validate their organizational security aspects. The main idea of this research is to create a risk assessment framework that: (i) collects various MITRE ATT&CK techniques, (ii) assign them severity scores based on their impact on the underlying 9 http://hailataxii.com/ MITRE ATT&CK: State of the Art and Way Forward 25 Fig. 8. CTI Enrichment with the ATT&CK matrix: We identified different sources from the literature, which are combined with the ATT&CK matrix to enrich the corporate CTI. Human factors NIST Reports ATT&CK CVE Logs 5 Text Tools Modelling context and the complexity posed to an attacker, (iii) provide their success/failure states from the collected reports and tests. The outcome will be an organization's overall risk assessment rating and the respective coverage of the MITRE ATT&CK matrix per assessment. They believe that this framework helps to reduce the gap between the security operations team and the organization's strategic development team. The proposed framework has been tested with an example enterprise pen-testing assessment. 4.4.2 Cyberattack Models for Ship Equipment Based on the MITRE ATT&CK Framework, 2022, [51]. This work introduces a MITRE ATT&CK based cybersecurity analysis approach specifically for ship equipment. Authors investigate and analyze potential cybersecurity threats on ships using MITRE ATT&CK framework, and present a cyberattack analysis model. For this purpose, they analyze recent ship cybersecurity research projects and provide essential defense recommendations. Using the proposed model, they list ship navigation, communication and control characteristics; outline main threats and vulnerabilities; and provide mitigation strategies. They evaluated the proposed cyberattack analysis model using 4 case studies: case (i) a ship sinking, case (ii) and (iii) wrong routes, case (iv) an attack on the ship control system. They believe that the obtained results can lead them to conduct their next future work. 4.4.3 MITRE ATT&CK Based Evaluation on In-Network Deception Technology for Modernized Electrical Substation Systems, 2022, [52]. Authors introduce a design, implementation and deployment of an in-network deception technology for IEC 61850 standard compliant smart substation systems in smart grid called DecIED. Authors main objective is analyzing various deployment strategies of DecIED in order to integrate it into a production environment. Moreover, they verify DecIED's performance and efficiency against recently emerged high-profile attacks targeting smart grids. Accordingly, they investigate the procedure of using DecIED for mitigating ICS related attacks. Their evaluation is accomplished based on the MITRE ATT&CK Matrix for industrial control systems which provides corresponding tactics and techniques. They evaluate DecIED's effectiveness against well-known real-world cyberattacks, such as Stuxnet 10 and Ukraine incidents [69], and show its performance and efficiency in such contexts. 10 https://www.trellix.com/en-sg/security-awareness/ransomware/what-is-stuxnet.html 26 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri 4.4.4 Services for Zero Trust Architectures - A Research Roadmap, 2021, [41]. Authors use information about existing cyber risks as a knowledge-base to propose a Zero Trust Architecture (ZTA) design methodology. Zero Trust Architecture (ZTA) introduces an interesting paradigm for enhancing cybersecurity by supporting well-designed, comprehensive and continues security functions in all organizational levels. ZTA's initial assumption is that no organizational entity is trusted. This paper discusses the key pillars of a ZT model and determines deployment challenges both in research and practice. The authors describe the following pillars for ZT model: (i) collecting and analyzing external and internal threats information, (ii) fundamental security patterns, (iii) ZT security patterns, (iv) identifying and choosing services, technology and process improvements, (v) security service implementation, (vi) security control testing, (vii) performance metrics to measure the effectiveness of the implemented solution. Next, they have elaborated on those pillars and challenges and provided potential solutions. Accordingly, They employ MITRE ATT&CK framework to design security patterns. 4.4.5 Application of Advanced Persistent Threat Actors' Techniques for Evaluating Defensive Countermeasures, 2020, [35]. This research describes the results of integrating the MITRE ATT&CK knowledge-base TTPs into the process of defining cybersecurity requirements for information security systems. For this purpose, they follow 3 major phases: (i) preparation stage that defines systems structural and functional features, (ii) threat modeling stage that is the process of identifying potential origins of information security cyber-threats and determining tactics and techniques of the attacker's behavior regarding the structural and functional features, (iii) security controls selection that is the process of selecting protective security metrics. 4.4.6 A Model and Method of Information System Security Risk Assessment based on MITRE ATT&CK 2021, [60]. This research presents Advantageous Tactics, Technologies, and Common Knowledge - Optimized Analytic Hierarchy Process - Bayesian Network (ATT&CK-OAHP-BN) that is a risk assessment approach based on MITRE ATT&CK framework. In other words, authors use the MITRE ATT&CK framework to design and develop a hierarchical risk assessment indicators system. Next, using OAHP algorithm, a weight is assigned to each indicator and its initial risk value is calculated. Finally, they use the Bayesian network inference model to calculate each risk indicator probability to happen and discover the most important risks. Based on their experiments on the use case data of the industrial control CPS, they believe that the proposed model can effectively assign appropriate risk values to security threats, and identify the most important risks to be carefully monitored when security threats happen. Wrap up on Defensive Gap Assessment. Just a minor amount of papers focuses on this use case although the importance of the ATT&CK matrix is well recognized in the assessing of the defensive gaps for the ICT infrastructure. Out of the 5 identified papers, we highlight that 3 of them ([51],[41],[60]) propose new models for gap assessment, one studies the deployment of a rating framework for the security assessment [44], while the last one takes into account an in-network deception infrastructure and the related assessment for its deployment [52].",
  "5 SUMMARY AND KEY FINDINGS": "This section discusses the major findings of our analysis from different perspectives, such as the application scenario, data sources, adopted techniques, and finally, datasets. MITRE ATT&CK: State of the Art and Way Forward 27 Table 4. Application scenarios.",
  "5.1 Application scenario": "We now focus on the analysis of the application scenarios as depicted in Table 4. Firstly, out of the considered 56 papers, 16 papers have targeted a particular context/environment/infrastructure to apply their proposed approaches. We identify 5 main categories: (i) Operational Technology, (ii) Defense, (iii) Commercial, (iv) Telecom, (v) Cybersecurity. Each category has its own sub-categories as listed in Table 4. Our analysis shows that industrial/utilities applications, such as ICS, power grids, IoT, etc., have attracted most of the research works. We believe that the main reason behind this is rooted in the recent advancements of industrial control systems and the integration with complex ICT infrastructures; indeed, attackers can now perform malicious activities to manipulate the controls of power grids, energy providers, and other critical infrastructure. These activities result in real-world catastrophic physical damage, such as major service outage and various service disruptions. To identify vulnerabilities in industrial systems, security-relevant parts must be understood, potential attacks need to be identified, and all weaknesses that can be exploited should be detected. MITRE ATT&CK framework is the major knowledge-base for these tasks and accomplishments. Correlating this knowledge-base with other information sources that we will mention in the next sections, is a valuable asset. Lastly, we observe that many of the proposed solutions target emerging technologies, e.g., 5G, new generation smartphones, etc., as their application scenarios highlighting the importance of MITRE ATT&CK framework for future applications. For example, the recent advances in 5G Core Networks (5GCN) lead to a service-rich technology ecosystem attracting attackers' attention. Hence, numerous 5G network security assessments have been conducted by academics, security groups, and industry suppliers. As another example, social networks attacks, e.g., phishing, is one of the prevalent entry-point toward the compromization of smartphones. Consequently, using continuously updated versions of cybersecurity knowledge-bases like MITRE ATT&CK framework is critical to resist against emerging attacks.",
  "5.2 Data sources": "In this section, we provide a categorization of the (input) data taken into account by the papers considered in this work. The considered data is adopted for different purposes such as designing, developping and validating the adopted methodologies. Table 5 summarizes the input data used in the considered papers. While the MITRE ATT&CK framework constitutes a common knowledge for all the considered papers to design, develop, extend, enhance or validate their proposed solutions, other data sources are: (i) MITRE CVE, (ii) MITRE CAPEC, (iii) NIST, (iv) event logs/audits, (v) security reports. 28 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri Table 5. Data sources. MITRE CVE, MITRE CAPEC and NIST are mainly used as datasets to be correlated with the MITRE ATT&CK framework. As previously discussed, MITRE CVE reports the vulnerabilities discovered in a wide range of software and hardware, thus linking it with the MITRE ATT&CK framework generates an improved ground knowledge of tactics, techniques and associated vulnerabilities. MITRE CAPEC focuses on the application security and enumerates exploits against vulnerable systems. It is mainly used for application threat modeling and developer training and education. Hence, it can extend MITRE ATT&CK knowledge-base with these information. NIST provides a wide range of defense mechanisms in different domains: identification, protection, detection and recovering. Adding it to the MITRE ATT&CK framework results a more enhanced knowledge-base. Event logs and audit data, e.g., Linux auditd and Windows ETW data , along with security reports have been used as major sources to automatically discover APTs. The goal is mapping activities found in logs and alerts found in security monitoring systems to the APT kill chain. This provides deep visibility into the attacker TTPs and facilitate threat investigation. However, there are still challenges questioning their usefulness in practice, e.g., validation and investigation, long-term log storage, automated information extraction and analysis, etc. Machine learning and NLP techniques have been widely used to address these challenges and improve the usage of these information sources in real environments and applications.",
  "5.3 Adopted Techniques": "Each considered paper employs or integrates different techniques in order to build and design their methodologies while having MITRE ATT&CK as their main building block. Table 6 lists the adopted techniques and tools for the considered papers. Techniques, such as information correlation, ontology engineering, Natural Language Processing (NLP), machine learning, Domain Specific Language (DSL) design and simulating test-beds, have been considered. In addition, some papers integrate security tools (e.g., Intrusion Detection Systems (IDS), Security Information and Security Information and Event Management (SIEM)) to their proposed methodologies. The main objective of using information correlation and ontology engineering is to enhance/improve/extend the existing knowledge-base, MITRE ATT&CK in particular. Table 5 shows the list of inputs to these techniques in our list of papers. NLP and Machine learning techniques help to automate the knowledge extraction process and split data into well-defined and more accurate classes/clusters for more detailed analysis (e.g., identifying TTPs based on low-level threat artifacts observed in the underlying environment). Among all the adopted techniques, machine learning is the most diversified domain including a large list of models/sub-techniques, such as hierarchical clustering, decision trees, Support Vector Machines (SVM), neural networks, Hidden Markov Models (HMM), etc. Some papers use more than one model to compare their accuracy (experimental analysis) or for complementary purposes. However, machine learning based analysis should be performed through an optimal workflow to ensure well prepared training/testing datasets and fine-tuned models MITRE ATT&CK: State of the Art and Way Forward 29 Table 6. Adopted techniques. (predictor, classifier, etc.) for subsequent analysis. This help to address the high volume of false positives and filtering out irrelevant results.",
  "5.4 Datasets": "Table 7 shows the list of publicly available datasets referenced by the considered paper in this work. These datasets can be useful to extend/enhance existing approaches toward their future objectives. We classify these datasets into 4 major groups: -CTI repositories -Malware databases - TTPs -Event logs Some of these datasets have been prepared specifically for Industrial Control Systems cyber-threat evaluation (e.g., SWaT dataset). Some others provide raw texts as threat and vulnerability reports to be analyzed by NLP techniques. Overall, we believe that this list can be significantly useful for future work in the area as summarized in the next section.",
  "6 OPEN ISSUES AND RESEARCH DIRECTIONS": "In this section, we describe current research challenges and possible future directions. Our analysis is based on the previously introduced categorization in Section 4.",
  "6.1 Challenges and future directions in behavioural analytic": "-Data source analysis: data source is a critical factor biasing the behavioral analytic. Current challenges on data source analysis are: (i) current approaches considers each endpoint independently and cross-machine provenance has not been fully analyzed yet, (ii) most of the existing implementations and experiments are offline, while real-time analysis has still challenges, such as integrating new data structures and threat scoring algorithms, (iii) adaptive attacks employ tactics in an unpredictable way to bypass detection algorithms. Advanced scoring algorithms are required to address this challenge, (iv) real APT behaviors instead of simulated ones are required 30 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri Table 7. List of considered datasets. to conduct comprehensive analysis and experiments, (v) some attacks do not trigger alerts, which in turn shoul be generated by underlying EDR systems. -Learning techniques associations: reliable construction of technique associations provides insights and knowledge to predict 0-day attack techniques. Future research directions in this field are: (i) preparing a ground truth attack dataset in order to enhance the associations quality and comprehensiveness, (ii) investigating more machine learning approaches (e.g., hierarchical clustering) to investigate probabilistic technique associations to reveal pre-conditions and post-conditions relationships. -Similarity analysis: this technique can be used to capture similarity degrees of adversary behaviors based on various semantic links among APT groups. The results can be used as threat intelligence information for advanced threat analysis. Future directions can be: (i) analyzing the similarity of attackers activities and behavior to learn attackers habits and enrich the ground-truth of attack patterns, (ii) attacks have time-lines, and the time dimension can be added to analyze the attackers' mindset. -Characterizing attackers behaviors: analyzing various datasets, in particular those collected from penetration testing competitions, can provide valuable insights in order to discover and exploit software systems weaknesses on a typical way. The results can improve security experts knowledge toward the goal of designing and developing secure software systems. -Modeling attacks and defenses: multiple propositions for security attacks and defense modeling have been proposed, e.g., BACCER [20] in Section 4. Continued refinement of these modeling systems and using them within various use case-targeted demonstrations can be a suitable future direction. Moreover, evaluating the modeling systems based on multiple real scenarios and analyzing the results in order to apply to broader cybersecurity applications can be another future direction. MITRE ATT&CK: State of the Art and Way Forward 31 -Case Study - Industrial Control Systems: ICS threat hunting frameworks have been extensively studied and investigated. The fist phase of the threat hunting process is the hypothesis proposition that is defining a list of potential threats to be verified and investigated using CTI information. Automating hypothesis verification (quality and reliability) and threat intelligence generation tasks can improve response issuing time. Consequently, the future directions can be: (i) improving initial hypothesis reliability, (ii) automating hypothesis verification and threat intelligence generation using machine learning techniques. -Real-time multi-step cyberattack detection: APT attacks are often categorized as multistage attacks. During such attacks, attackers drop malware on the victim systems and try to distribute and transfer it to the whole organization. Future directions might involve (i) developing more advanced and intelligent techniques for detecting multistage attacks, (ii) early multistage attacks detection that needs gaining knowledge about the most recent adopted techniques by adversaries and the end-to-end procedure of such attacks. -Risk assessment : MITRE ATT&CK based risk assessment has been studied by researchers in the recent years as it reveals information and knowledge about attackers' interests, motivations, abilities, etc. Integrating organization-specific information is another missing contribution in the current research, e.g., collecting information from/about honeypots and indicators of compromises (IoCs), etc. -Case Study - Internet of Things (IoT): researchers have studied the advancement of techniques and strategies utlized by IoT malware by leveraging MITRE ATT&CK matrix in order to analyze and characterize (e.g., the preand post- exploitation aspects of an attack) current IoT related cyber attacks. Developing an efficient automated IoT malware investigation along with expanding the research to cover emerging threats can be important research directions.",
  "6.2 CTI enrichment challenges and future directions": "-Cyber threat intelligence ontology: representing and sharing cybersecurity analytical data and information in an optimized fashion require a unified format and a set of standard protocols between researchers other entities. A solution proposed by researchers is the use of ontologies. Although various ontologies have been proposed in the literature, a well-designed multi-layered CTI ontology is still an important need to be considered as a research direction. -Automatic and accurate extraction of CTI data from unstructured texts: automated extraction and analysis of CTI information from various unstructured and free-style reports and texts have attracted researchers to propose appropriate solutions. These research directions are still valid: (i) using popular NLP solutions (e.g., Google NLP and Azure Language Studio) to extract and analyze CTIs from cybersecurity reports and comparing the results accuracy and efficiency, (ii) extending CTI reports repositories to cover various cyberthreat threat source and languages, (iii) constructing a TTP graph for enhanced extraction, investigation and prediction of emerging TTPs. -Learning APT chains from cyber threat intelligence: using machine learning techniques to learn temporal relations between malicious artifacts in order to provide insights for threat analysts of the malicious activities happening on the underlying environment. -Attack hypothesis generator: leveraging the advantages of CTI knowledge and insights in order to generate a set of hypotheses for the underlying environment facilitates forensic analysts analytical tasks. Future research directions might consider including features matching with domain expert knowledge, such as target operating system, kill chain steps and information sources, can improve attack hypothesis generator's accuracy. 32 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri -Expanding MITRE ATT&CK framework: MITRE ATT&CK framework can be extended to include more information sources, such as CVE, CWE, CAPEC, NIST, etc. In addition, future research direction can be: (i) conducting experiments to compare the expanded framework performance on bench-marking datasets in other fields, (ii) examining the security strength of the extended framework under adversarial settings and threat models, (iii) investigating more refined textual data representation techniques (e.g., novel word embedding strategies, synonym/homonym generation, POS tagging) to improve the features of input texts.",
  "6.3 Adversary emulation / Red teaming": "-Threat modeling: this concept is used to identify the list of existing assets and resources within an environment and corresponding potential threats. Threat modeling is used to validate security status of an existing system or to develop a new system with the security-by-design strategy. An important future direction is to calculate and assign probability scores to cyberattack steps/stages to make the modeling and simulation results more and more realistic. -Adversary emulation: adversary emulation provides a solid method to verify a system resilience against various advances cyberattacks. However, automating this task still has several technical challenges, such as techniques encoding, and the coordination of their deployment. -Advanced persistent graphs for threat hunting: such graphs represent the attack patterns of the adversary through the network during the persistent attack campaign. As future directions, we refer to all the techniques involving graph similarity computation in order to generate metrics to reliably estimate the effectiveness of the attack and the defense. -Case study - dynamic threat modeling in 5G Core Networks (5GCN): as the APTs continue to expand and cover emerging technologies, a potential target for threat actors is 5GCN. Hence, several security researchers, analysts and industry suppliers have proposed different 5GCN security assessment approaches and solutions. Future research directions can be: (i) generating datasets that include identified 5GCN attack scenarios and conducting advanced security analysis and assessments. (ii) analytical study to prepare a comprehensive list of requirements for 5GCN adversarial techniques detection and mitigation, (iii) proposing an appropriate risk assessment approach to cover emerging 5GCN TTPs and provide complementary 5GCN risk evaluation recommendations, (iv) proposing an analytical framework based on game-theory to model adversary and defender's activities within 5GCN infrastructures.",
  "6.4 Defensive Gap Assessment": "-Zero Trust Architectures (ZTA): the main objective of a ZTA model is protecting organizations assets, such as data, systems and services, against attackers. Hence, there are a list of challenges to address as future research directions: (i) updating current digital infrastructure to be compatible with ZTA is costly and introduces various technical and knowledge-wide difficulties, (ii) compatibility and integration of ZTA with cloud-based platforms has still unsolved challenges, (iii) integrating ZTA to emerging technologies (e.g., 5G/6G networks) will oppose novel challenges. -Case study - cyberattack models for ship equipment: upgrading ship technology and integrating high-end IT and communication technologies to this industry introduces novel security challenges. Future research directions might include: (i) design and develop risk management approaches compatible with the ship industry, (ii) developing a honeypot system to identify malicious activities, potential attack and help to improve threat MITRE ATT&CK: State of the Art and Way Forward 33 detection accuracy by reducing false alarm rate, (iii) leveraging AI benefits and integrating them to ship cyberthreat detection and response technology, (iv) using maritime CTI information for analyzing, classification and verification of maritime cyber-threat analysis, (v) integrating the digital forensic technology to maritime for analyzing cyber incidents of onboard systems.",
  "7 CONCLUSION": "This paper introduces a detailed analysis of the MITRE ATT&CK framework while considering the state of the art contributions in the field. We have provided a description of the MITRE ATT&CK framework while comparing it with other threat intelligence frameworks such as STRIDE and the Cyber kill chain. We classified all the works considered in our analysis by use cases, i.e., behavioural analytic, red teaming, CTI enrichment, and finally, defensive gap assessment. Moreover, we categorized the considered works as per application scenarios, data sources, adopted techniques, and datasets. Finally, we discussed open issues and potential research directions, while drawing some final remarks.",
  "ACKNOWLEDGEMENTS": "This publication was made possible by the awards NPRP12S-0125-190013 and GRSA7-1-0516-20061 from Qatar National Research Fund (a member of Qatar Foundation). The contents herein are solely the responsibility of the author[s].",
  "REFERENCES": "[1] MITRE, 'ATT&CK update,' https://attack.mitre.org/resources/updates/, [Online; accessed 16-October-2022]. [2] L. Kohnfelder and P. Garg, 'The threats to our products,' https://shostack.org/files/microsoft/The-Threats-To-Our-Products.docx, [Online; accessed 16-October-2022]. [3] P. Pols and J. van den Berg, 'The unified kill chain,' CSA Thesis, Hague , pp. 1-104, 2017. [4] S. Caltagirone, A. Pendergast, and C. Betz, 'The diamond model of intrusion analysis,' Center For Cyber Intelligence Analysis and Threat Research Hanover Md, Tech. Rep., 2013. [5] S. M. Milajerdi, R. Gjomemo, B. Eshete, R. Sekar, and V. Venkatakrishnan, 'Holmes: real-time apt detection through correlation of suspicious information flows,' in 2019 IEEE Symposium on Security and Privacy (SP) . IEEE, 2019, pp. 1137-1152. [6] V. Mavroeidis and S. Bromander, 'Cyber threat intelligence model: an evaluation of taxonomies, sharing standards, and ontologies within cyber threat intelligence,' in 2017 European Intelligence and Security Informatics Conference (EISIC) . IEEE, 2017, pp. 91-98. [7] G. Husari, E. Al-Shaer, M. Ahmed, B. Chu, and X. Niu, 'Ttpdrill: Automatic and accurate extraction of threat actions from unstructured text of cti sources,' in Proceedings of the 33rd annual computer security applications conference , 2017, pp. 103-115. [8] W. U. Hassan, A. Bates, and D. Marino, 'Tactical provenance analysis for endpoint detection and response systems,' in 2020 IEEE Symposium on Security and Privacy (SP) . IEEE, 2020, pp. 1172-1189. [9] R. Al-Shaer, J. M. Spring, and E. Christou, 'Learning the associations of MITRE att&ck adversarial techniques,' CoRR , vol. abs/2005.01654, 2020. [Online]. Available: https://arxiv.org/abs/2005.01654 [10] U. Noor, Z. Anwar, A. W. Malik, S. Khan, and S. Saleem, 'A machine learning framework for investigating data breaches based on semantic analysis of adversary's attack patterns in threat intelligence repositories,' Future Generation Computer Systems , vol. 95, pp. 467-487, 2019. [11] W. Xiong, E. Legrand, O. Åberg, and R. Lagerström, 'Cyber security threat modeling based on the mitre enterprise att&ck matrix,' Software and Systems Modeling , vol. 21, no. 1, pp. 157-177, 2022. [12] F. J. Stech, K. E. Heckman, and B. E. Strom, 'Integrating cyber-d&d into adversary modeling for active cyber defense,' in Cyber deception . Springer, 2016, pp. 1-22. [13] A. Applebaum, D. Miller, B. Strom, H. Foster, and C. Thomas, 'Analysis of automated adversary emulation techniques,' in Proceedings of the Summer Simulation Multi-Conference , 2017, pp. 1-12. [14] K. Oosthoek and C. Doerr, 'Sok: Att&ck techniques and trends in windows malware,' in International Conference on Security and Privacy in Communication Systems . Springer, 2019, pp. 406-425. [15] H. M. Farooq and N. M. Otaibi, 'Optimal machine learning algorithms for cyber threat detection,' in 2018 UKSim-AMSS 20th International Conference on Computer Modelling and Simulation (UKSim) . IEEE, 2018, pp. 32-37. [16] A. Georgiadou, S. Mouzakitis, and D. Askounis, 'Assessing mitre att&ck risk using a cyber-security culture framework,' Sensors , vol. 21, no. 9, p. 3267, 2021. 34 Bader Al-Sada, Alireza Sadighian, and Gabriele Oligeri [17] M. Tatam, B. Shanmugam, S. Azam, and K. Kannoorpatti, 'A review of threat modelling approaches for apt-style attacks,' Heliyon , vol. 7, no. 1, p. e05969, 2021. [18] R. Kwon, T. Ashley, J. Castleberry, P. Mckenzie, and S. N. G. Gourisetti, 'Cyber threat dictionary using mitre att&ck matrix and nist cybersecurity framework mapping,' in 2020 Resilience Week (RWS) . IEEE, 2020, pp. 106-112. [19] N. Munaiah, A. Rahman, J. Pelletier, L. Williams, and A. Meneely, 'Characterizing attacker behavior in a cybersecurity penetration testing competition,' in 2019 ACM/IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM) . IEEE, 2019, pp. 1-6. [20] J. Straub, 'Modeling attack, defense and threat trees and the cyber kill chain, att&ck and stride frameworks as blackboard architecture networks,' in 2020 IEEE International Conference on Smart Cloud (SmartCloud) . IEEE, 2020, pp. 148-153. [21] S. Hacks, S. Katsikeas, E. Ling, R. Lagerström, and M. Ekstedt, 'powerlang: a probabilistic attack simulation language for the power domain,' Energy Informatics , vol. 3, no. 1, pp. 1-17, 2020. [22] A. Nisioti, G. Loukas, A. Laszka, and E. Panaousis, 'Data-driven decision support for optimizing cyber forensic investigations,' IEEE Transactions on Information Forensics and Security , vol. 16, pp. 2397-2412, 2021. [23] V. Legoy, M. Caselli, C. Seifert, and A. Peter, 'Automated retrieval of att&ck tactics and techniques for cyber threat reports,' arXiv preprint arXiv:2004.14322 , 2020. [24] G. Husari, E. Al-Shaer, B. Chu, and R. F. Rahman, 'Learning apt chains from cyber threat intelligence,' in Proceedings of the 6th Annual Symposium on Hot Topics in the Science of Security , 2019, pp. 1-2. [25] P. Zilberman, R. Puzis, S. Bruskin, S. Shwarz, and Y. Elovici, 'Sok: A survey of open-source threat emulators,' arXiv preprint arXiv:2003.01518 , 2020. [26] F. Maymí, R. Bixler, R. Jones, and S. Lathrop, 'Towards a definition of cyberspace tactics, techniques and procedures,' in 2017 IEEE International Conference on Big Data (Big Data) . IEEE, 2017, pp. 4674-4679. [27] M. Parmar and A. Domingo, 'On the use of cyber threat intelligence (cti) in support of developing the commander's understanding of the adversary,' in MILCOM 2019-2019 IEEE Military Communications Conference (MILCOM) . IEEE, 2019, pp. 1-6. [28] S. Choi, J.-H. Yun, and B.-G. Min, 'Probabilistic attack sequence generation and execution based on mitre att&ck for ics datasets,' in Cyber Security Experimentation and Test Workshop , 2021, pp. 41-48. [29] A. Berady, M. Jaume, V. V. T. Tong, and G. Guette, 'From ttp to ioc: Advanced persistent graphs for threat hunting,' IEEE Transactions on Network and Service Management , vol. 18, no. 2, pp. 1321-1333, 2021. [30] K. Hasan, S. Shetty, and S. Ullah, 'Artificial intelligence empowered cyber threat detection and protection for power utilities,' in 2019 IEEE 5th International Conference on Collaboration and Internet Computing (CIC) . IEEE, 2019, pp. 354-359. [31] A. Elitzur, R. Puzis, and P. Zilberman, 'Attack hypothesis generation,' in 2019 European Intelligence and Security Informatics Conference (EISIC) . IEEE, 2019, pp. 40-47. [32] A. Kuppa, L. Aouad, and N.-A. Le-Khac, 'Linking cve's to mitre att&ck techniques,' in The 16th International Conference on Availability, Reliability and Security , 2021, pp. 1-12. [33] S. Choi, J. Choi, J.-H. Yun, B.-G. Min, and H. Kim, 'Expansion of { ICS } testbed for security validation based on { MITRE }{ ATT&CK } techniques,' in 13th USENIX Workshop on Cyber Security Experimentation and Test (CSET 20) , 2020. [34] K. Kim, Y. Shin, J. Lee, and K. Lee, 'Automatically attributing mobile threat actors by vectorized att&ck matrix and paired indicator,' Sensors , vol. 21, no. 19, p. 6522, 2021. [35] A. P. Golushko and V. G. Zhukov, 'Application of advanced persistent threat actorstechniques aor evaluating defensive countermeasures,' in 2020 IEEE Conference of Russian Young Researchers in Electrical and Electronic Engineering (EIConRus) . IEEE, 2020, pp. 312-317. [36] P. Karuna, E. Hemberg, U.-M. O'Reilly, and N. Rutar, 'Automating cyber threat hunting using nlp, automated query generation, and genetic perturbation,' arXiv preprint arXiv:2104.11576 , 2021. [37] Y. Wu, C. Huang, X. Zhang, and H. Zhou, 'Grouptracer: automatic attacker ttp profile extraction and group cluster in internet of things,' security and communication networks , vol. 2020, 2020. [38] B. Ampel, S. Samtani, S. Ullman, and H. Chen, 'Linking common vulnerabilities and exposures to the mitre att&ck framework: A self-distillation approach,' arXiv preprint arXiv:2108.01696 , 2021. [39] Z. Jadidi and Y. Lu, 'A threat hunting framework for industrial control systems,' IEEE Access , vol. 9, pp. 164 118-164 130, 2021. [40] S. Arshad, M. Alam, S. Al-Kuwari, and M. H. A. Khan, 'Attack specification language: Domain specific language for dynamic training in cyber range,' in 2021 IEEE Global Engineering Education Conference (EDUCON) . IEEE, 2021, pp. 873-879. [41] E. Bertino and K. Brancik, 'Services for zero trust architectures-a research roadmap,' in 2021 IEEE International Conference on Web Services (ICWS) . IEEE, 2021, pp. 14-20. [42] F. S. Toker, K. O. Akpinar, and I. Özçelik, 'Mitre ics attack simulation and detection on ethercat based drinking water system,' in 2021 9th International Symposium on Digital Forensics and Security (ISDFS) . IEEE, 2021, pp. 1-6. [43] O. Mendsaikhan, H. Hasegawa, Y. Yamaguchi, and H. Shimada, 'Automatic mapping of vulnerability information to adversary techniques,' in The Fourteenth International Conference on Emerging Security Information, Systems and Technologies SECUREWARE2020 , 2020. [44] H. Manocha, A. Srivastava, C. Verma, R. Gupta, and B. Bansal, 'Security assessment rating framework for enterprises using mitre att&ck matrix,' arXiv preprint arXiv:2108.06559 , 2021. [45] W. Wang, B. Tang, C. Zhu, B. Liu, A. Li, and Z. Ding, 'Clustering using a similarity measure approach based on semantic analysis of adversary behaviors,' in 2020 IEEE Fifth International Conference on Data Science in Cyberspace (DSC) . IEEE, 2020, pp. 1-7. MITRE ATT&CK: State of the Art and Way Forward 35 [46] Y. S. Takey, S. G. Tatikayala, S. S. Samavedam, P. L. Eswari, and M. U. Patil, 'Real time early multi stage attack detection,' in 2021 7th International Conference on Advanced Computing and Communication Systems (ICACCS) , vol. 1. IEEE, 2021, pp. 283-290. [47] P. S. Charan, P. M. Anand, and S. K. Shukla, 'Dmapt: Study of data mining and machine learning techniques in advanced persistent threat attribution and detection,' in Data Mining-Concepts and Applications . IntechOpen, 2021. [48] Y. Wu, Q. Liu, X. Liao, S. Ji, P. Wang, X. Wang, C. Wu, and Z. Li, 'Price tag: Towards semi-automatically discovery tactics, techniques and procedures of e-commerce cyber threat intelligence,' IEEE Transactions on Dependable and Secure Computing , 2021. [49] Y. You, J. Jiang, Z. Jiang, P. Yang, B. Liu, H. Feng, X. Wang, and N. Li, 'Tim: threat context-enhanced ttp intelligence mining on unstructured threat data,' Cybersecurity , vol. 5, no. 1, pp. 1-17, 2022. [50] Y.-T. Huang, C. Y. Lin, Y.-R. Guo, K.-C. Lo, Y. S. Sun, and M. C. Chen, 'Open source intelligence for malicious behavior discovery and interpretation,' IEEE Transactions on Dependable and Secure Computing , vol. 19, no. 2, pp. 776-789, 2021. [51] Y. Jo, O. Choi, J. You, Y. Cha, and D. H. Lee, 'Cyberattack models for ship equipment based on the mitre att&ck framework,' Sensors , vol. 22, no. 5, p. 1860, 2022. [52] D. Mashima, 'Mitre att&ck based evaluation on in-network deception technology for modernized electrical substation systems,' Sustainability , vol. 14, no. 3, p. 1256, 2022. [53] M. Ahmed, S. Panda, C. Xenakis, and E. Panaousis, 'Mitre att&ck-driven cyber risk assessment,' in Proceedings of the 17th International Conference on Availability, Reliability and Security , 2022, pp. 1-10. [54] A. Nisioti, G. Loukas, S. Rass, and E. Panaousis, 'Game-theoretic decision support for cyber forensic investigations,' Sensors , vol. 21, no. 16, p. 5300, 2021. [55] R. Pell, S. Moschoyiannis, E. Panaousis, and R. Heartfield, 'Towards dynamic threat modelling in 5g core networks based on mitre att&ck,' arXiv preprint arXiv:2108.11206 , 2021. [56] A. A. Al-Kadhimi, M. M. Singh, and T. Jabar, 'Fingerprint for mobile-sensor apt detection framework (formap) based on tactics techniques and procedures (ttp) and mitre,' in Proceedings of the 8th International Conference on Computational Science and Technology . Springer, 2022, pp. 515-533. [57] C. Liu, J. Wang, and X. Chen, 'Threat intelligence att&ck extraction based on the attention transformer hierarchical recurrent neural network,' Applied Soft Computing , vol. 122, p. 108826, 2022. [58] V. Chierzi and F. Mercês, 'Evolution of iot linux malware: A mitre att&ck ttp based approach,' in 2021 APWG Symposium on Electronic Crime Research (eCrime) . IEEE, 2021, pp. 1-11. [59] J. Fairbanks, A. Orbe, C. Patterson, J. Layne, E. Serra, and M. Scheepers, 'Identifying att&ck tactics in android malware control flow graph through graph representation learning and interpretability,' in 2021 IEEE International Conference on Big Data (Big Data) . IEEE, 2021, pp. 5602-5608. [60] T. He and Z. Li, 'A model and method of information system security risk assessment based on mitre att&ck,' in 2021 2nd International Conference on Electronics, Communications and Information Technology (CECIT) . IEEE, 2021, pp. 81-86. [61] M. Zych and V. Mavroeidis, 'Enhancing the stix representation of mitre att&ck for group filtering and technique prioritization,' arXiv preprint arXiv:2204.11368 , 2022. [62] S. Ejaz, U. Noor, and Z. Rashid, 'Visualizing interesting patterns in cyber threat intelligence using machine learning techniques,' Cybernetics and Information Technologies , vol. 22, no. 2, pp. 96-113, 2022. [63] B. E. Strom, A. Applebaum, D. P. Miller, K. C. Nickels, A. G. Pennington, and C. B. Thomas, 'Mitre att&ck: Design and philosophy,' in Technical report . The MITRE Corporation, 2018. [64] R. Al-Shaer, J. M. Spring, and E. Christou, 'Learning the associations of mitre att & ck adversarial techniques,' in 2020 IEEE Conference on Communications and Network Security (CNS) . IEEE, 2020, pp. 1-9. [65] B. Hayes-Roth, 'A blackboard architecture for control,' Artificial intelligence , vol. 26, no. 3, pp. 251-321, 1985. [66] B. W. Kernighan and S. Lin, 'An efficient heuristic procedure for partitioning graphs,' The Bell system technical journal , vol. 49, no. 2, pp. 291-307, 1970. [67] P. Johnson, R. Lagerström, and M. Ekstedt, 'A meta language for threat modeling and attack simulations,' in Proceedings of the 13th International Conference on Availability, Reliability and Security , 2018, pp. 1-8. [68] S. Katsikeas, S. Hacks, P. Johnson, M. Ekstedt, R. Lagerström, J. Jacobsson, M. Wällstedt, and P. Eliasson, 'An attack simulation language for the it domain,' in International Workshop on Graphical Models for Security . Springer, 2020, pp. 67-86. [69] K. Zetter et al. , 'Inside the cunning, unprecedented hack of ukraine's power grid,' Wired , vol. 9, pp. 1-5, 2016. [70] E. Hemberg, J. Kelly, M. Shlapentokh-Rothman, B. Reinstadler, K. Xu, N. Rutar, and U.-M. O'Reilly, 'Bron-linking attack tactics, techniques, and patterns with defensive weaknesses, vulnerabilities and affected platform configurations,' arXiv preprint arXiv:2010.00533 , 2020. [71] H.-K. Shin, W. Lee, J.-H. Yun, and H. Kim, 'Implementation of programmable { CPS } testbed for anomaly detection,' in 12th USENIX Workshop on Cyber Security Experimentation and Test (CSET 19) , 2019. [72] D. Plohmann, M. Clauss, S. Enders, and E. Padilla, 'Malpedia: a collaborative effort to inventorize the malware landscape,' Proceedings of the Botconf , 2017. Received 20 February 2007; revised 12 March 2009; accepted 5 June 2009",
  "keywords_parsed": [
    "MITRE ATT&CK Framework",
    "Cyber-Threat Intelligence",
    "Security Risk Analysis"
  ],
  "references_parsed": [
    {
      "ref_id": "b1",
      "title": "ATT&CK update"
    },
    {
      "ref_id": "b2",
      "title": "The threats to our products"
    },
    {
      "ref_id": "b3",
      "title": "The unified kill chain"
    },
    {
      "ref_id": "b4",
      "title": "The diamond model of intrusion analysis"
    },
    {
      "ref_id": "b5",
      "title": "Holmes: real-time apt detection through correlation of suspicious information flows"
    },
    {
      "ref_id": "b6",
      "title": "Cyber threat intelligence model: an evaluation of taxonomies, sharing standards, and ontologies within cyber threat intelligence"
    },
    {
      "ref_id": "b7",
      "title": "Ttpdrill: Automatic and accurate extraction of threat actions from unstructured text of cti sources"
    },
    {
      "ref_id": "b8",
      "title": "Tactical provenance analysis for endpoint detection and response systems"
    },
    {
      "ref_id": "b9",
      "title": "Learning the associations of MITRE att&ck adversarial techniques"
    },
    {
      "ref_id": "b10",
      "title": "A machine learning framework for investigating data breaches based on semantic analysis of adversary's attack patterns in threat intelligence repositories"
    },
    {
      "ref_id": "b11",
      "title": "Cyber security threat modeling based on the mitre enterprise att&ck matrix"
    },
    {
      "ref_id": "b12",
      "title": "Integrating cyber-d&d into adversary modeling for active cyber defense"
    },
    {
      "ref_id": "b13",
      "title": "Analysis of automated adversary emulation techniques"
    },
    {
      "ref_id": "b14",
      "title": "Sok: Att&ck techniques and trends in windows malware"
    },
    {
      "ref_id": "b15",
      "title": "Optimal machine learning algorithms for cyber threat detection"
    },
    {
      "ref_id": "b16",
      "title": "Assessing mitre att&ck risk using a cyber-security culture framework"
    },
    {
      "ref_id": "b17",
      "title": "A review of threat modelling approaches for apt-style attacks"
    },
    {
      "ref_id": "b18",
      "title": "Cyber threat dictionary using mitre att&ck matrix and nist cybersecurity framework mapping"
    },
    {
      "ref_id": "b19",
      "title": "Characterizing attacker behavior in a cybersecurity penetration testing competition"
    },
    {
      "ref_id": "b20",
      "title": "Modeling attack, defense and threat trees and the cyber kill chain, att&ck and stride frameworks as blackboard architecture networks"
    },
    {
      "ref_id": "b21",
      "title": "powerlang: a probabilistic attack simulation language for the power domain"
    },
    {
      "ref_id": "b22",
      "title": "Data-driven decision support for optimizing cyber forensic investigations"
    },
    {
      "ref_id": "b23",
      "title": "Automated retrieval of att&ck tactics and techniques for cyber threat reports"
    },
    {
      "ref_id": "b24",
      "title": "Learning apt chains from cyber threat intelligence"
    },
    {
      "ref_id": "b25",
      "title": "Sok: A survey of open-source threat emulators"
    },
    {
      "ref_id": "b26",
      "title": "Towards a definition of cyberspace tactics, techniques and procedures"
    },
    {
      "ref_id": "b27",
      "title": "On the use of cyber threat intelligence (cti) in support of developing the commander's understanding of the adversary"
    },
    {
      "ref_id": "b28",
      "title": "Probabilistic attack sequence generation and execution based on mitre att&ck for ics datasets"
    },
    {
      "ref_id": "b29",
      "title": "From ttp to ioc: Advanced persistent graphs for threat hunting"
    },
    {
      "ref_id": "b30",
      "title": "Artificial intelligence empowered cyber threat detection and protection for power utilities"
    },
    {
      "ref_id": "b31",
      "title": "Attack hypothesis generation"
    },
    {
      "ref_id": "b32",
      "title": "Linking cve's to mitre att&ck techniques"
    },
    {
      "ref_id": "b33",
      "title": "Expansion of { ICS } testbed for security validation based on { MITRE }{ ATT&CK } techniques"
    },
    {
      "ref_id": "b34",
      "title": "Automatically attributing mobile threat actors by vectorized att&ck matrix and paired indicator"
    },
    {
      "ref_id": "b35",
      "title": "Application of advanced persistent threat actorstechniques aor evaluating defensive countermeasures"
    },
    {
      "ref_id": "b36",
      "title": "Automating cyber threat hunting using nlp, automated query generation, and genetic perturbation"
    },
    {
      "ref_id": "b37",
      "title": "Grouptracer: automatic attacker ttp profile extraction and group cluster in internet of things"
    },
    {
      "ref_id": "b38",
      "title": "Linking common vulnerabilities and exposures to the mitre att&ck framework: A self-distillation approach"
    },
    {
      "ref_id": "b39",
      "title": "A threat hunting framework for industrial control systems"
    },
    {
      "ref_id": "b40",
      "title": "Attack specification language: Domain specific language for dynamic training in cyber range"
    },
    {
      "ref_id": "b41",
      "title": "Services for zero trust architectures-a research roadmap"
    },
    {
      "ref_id": "b42",
      "title": "Mitre ics attack simulation and detection on ethercat based drinking water system"
    },
    {
      "ref_id": "b43",
      "title": "Automatic mapping of vulnerability information to adversary techniques"
    },
    {
      "ref_id": "b44",
      "title": "Security assessment rating framework for enterprises using mitre att&ck matrix"
    },
    {
      "ref_id": "b45",
      "title": "Clustering using a similarity measure approach based on semantic analysis of adversary behaviors"
    },
    {
      "ref_id": "b46",
      "title": "Real time early multi stage attack detection"
    },
    {
      "ref_id": "b47",
      "title": "Dmapt: Study of data mining and machine learning techniques in advanced persistent threat attribution and detection"
    },
    {
      "ref_id": "b48",
      "title": "Price tag: Towards semi-automatically discovering tactics, techniques and procedures of e-commerce cyber threat intelligence"
    },
    {
      "ref_id": "b49",
      "title": "Tim: threat context-enhanced ttp intelligence mining on unstructured threat data"
    },
    {
      "ref_id": "b50",
      "title": "Open source intelligence for malicious behavior discovery and interpretation"
    },
    {
      "ref_id": "b51",
      "title": "Cyberattack models for ship equipment based on the mitre att&ck framework"
    },
    {
      "ref_id": "b52",
      "title": "Mitre att&ck based evaluation on in-network deception technology for modernized electrical substation systems"
    },
    {
      "ref_id": "b53",
      "title": "Mitre att&ck-driven cyber risk assessment"
    },
    {
      "ref_id": "b54",
      "title": "Game-theoretic decision support for cyber forensic investigations"
    },
    {
      "ref_id": "b55",
      "title": "Towards dynamic threat modelling in 5g core networks based on mitre att&ck"
    },
    {
      "ref_id": "b56",
      "title": "Fingerprint for mobile-sensor apt detection framework (formap) based on tactics techniques and procedures (ttp) and mitre"
    },
    {
      "ref_id": "b57",
      "title": "Threat intelligence att&ck extraction based on the attention transformer hierarchical recurrent neural network"
    },
    {
      "ref_id": "b58",
      "title": "Evolution of iot linux malware: A mitre att&ck ttp based approach"
    },
    {
      "ref_id": "b59",
      "title": "Identifying att&ck tactics in android malware control flow graph through graph representation learning and interpretability"
    },
    {
      "ref_id": "b60",
      "title": "A model and method of information system security risk assessment based on mitre att&ck"
    },
    {
      "ref_id": "b61",
      "title": "Enhancing the stix representation of mitre att&ck for group filtering and technique prioritization"
    },
    {
      "ref_id": "b62",
      "title": "Visualizing interesting patterns in cyber threat intelligence using machine learning techniques"
    },
    {
      "ref_id": "b63",
      "title": "Mitre att&ck: Design and philosophy"
    },
    {
      "ref_id": "b64",
      "title": "Learning the associations of mitre att & ck adversarial techniques"
    },
    {
      "ref_id": "b65",
      "title": "A blackboard architecture for control"
    },
    {
      "ref_id": "b66",
      "title": "An efficient heuristic procedure for partitioning graphs"
    },
    {
      "ref_id": "b67",
      "title": "A meta language for threat modeling and attack simulations"
    },
    {
      "ref_id": "b68",
      "title": "An attack simulation language for the it domain"
    },
    {
      "ref_id": "b69",
      "title": "Inside the cunning, unprecedented hack of ukraine's power grid"
    },
    {
      "ref_id": "b70",
      "title": "Bron-linking attack tactics, techniques, and patterns with defensive weaknesses, vulnerabilities and affected platform configurations"
    },
    {
      "ref_id": "b71",
      "title": "Implementation of programmable { CPS } testbed for anomaly detection"
    },
    {
      "ref_id": "b72",
      "title": "Malpedia: a collaborative effort to inventorize the malware landscape"
    }
  ]
}