{"Multi-channel Integrated Recommendation with Exposure Constraints": "Yue Xu yuexu.xy@foxmail.com Alibaba Group. Qijie Shen qijie.sqj@alibabainc.com Alibaba Group. Jianwen Yin yjw264077@alibabainc.com Alibaba Group. Zengde Deng dengzengde@gmail.com Cainiao Network. Dimin Wang dimin.wdm@alibabainc.com Alibaba Group. Hao Chen chenhao@gmail.com The Hong Kong Polytechnic University. Lixiang Lai lixiang.llx@alibabainc.com Alibaba Group. Tao Zhuang zhuangtao.zt@alibabainc.com Alibaba Group.", "ABSTRACT": "Integrated recommendation, which aims at jointly recommending heterogeneous items from different channels in a main feed, has been widely applied to various online platforms. Though attractive, integrated recommendation requires the ranking methods to migrate from conventional user-item models to the new user-channelitem paradigm in order to better capture users' preferences on both item and channel levels. Moreover, practical feed recommendation systems usually impose exposure constraints on different channels to ensure user experience. This leads to greater difficulty in the joint ranking of heterogeneous items. In this paper, we investigate the integrated recommendation task with exposure constraints in practical recommender systems. Our contribution is forth-fold. First, we formulate this task as a binary online linear programming problem and propose a two-layer framework named Multi-channel Integrated Recommendation with Exposure Constraints (MIREC) to obtain the optimal solution. Second, we propose an efficient online allocation algorithm to determine the optimal exposure assignment of different channels from a global view of all user requests over the entire time horizon. We prove that this algorithm reaches the optimal point under a regret bound of O( √ 𝑇 ) with linear complexity. Third, we propose a series of collaborative models to determine the optimal layout of heterogeneous items at each user request. The joint modeling of user interests, cross-channel correlation, and page context in our models aligns more with the browsing nature of feed products than existing models. Finally, we conduct extensive experiments on both offline datasets and online A/B tests to verify the effectiveness of MIREC. The proposed framework has now been implemented on the homepage of Taobao to serve the main traffic, providing service to hundreds of millions of users towards billions of items every day. Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. KDD 2023, August 6, 2023, Long Beach, California, United States ACM ISBN 978-x-xxxx-xxxx-x/YY/MM...$15.00 https://doi.org/10.1145/nnnnnnn.nnnnnnn Junfeng Ge beili.gjf@alibabainc.com Alibaba Group. Live Streams Ads Pictures Videos Slide For More Page of Item Detail Click Ja 39,9", "KEYWORDS": "Integrated Recommendation, Feed Recommendation, Multi-channel, Exposure constraint, Context-Aware", "1 INTRODUCTION": "Nowadays, the ever-expanding new breeds of content, e.g., pictures, live streams, and short videos, drive the recommender system to drift from the traditional homogeneous form into an integrated form. Integrated recommender systems (IRSs) aim to simultaneously recommend heterogeneous items from multiple sources/channels in a row. This integrated form greatly expands users' choices on different types of content thereby satisfying users' diversified preferences on both item-level and channel-level. Therefore, IRS has nowadays been widely deployed in various online platforms such as the homepage feeds in Kuaishou [23], XiaohongShu [17], Taobao [29], and AliExpress [13]. In these products, users continuously slide down to browse and interact with heterogeneous items in a sequential manner, as shown in Figure 1. Though attractive, integrated feed recommendation faces more challenges than conventional recommendation with homogeneous items. First, real-world applications usually impose upper or lower exposure guarantees on different channels, such as lower constraints for sponsored/new content (e.g., ads and cold-start items) or upper constraints for individual channels to ensure diversity. These constraints lead to greater difficulty in the joint ranking of heterogeneous items. Second, heterogeneous items from multiple channels usually have different features and ranking strategies. Hence, it is difficult to directly compare items from different channels for joint ranking. Third, users' interests on different channels have a great impact on their behaviors, such that traditional user-item prediction models need to evolve into user-channel-item prediction models by considering both intra-channel and inter-channel information and their correlation with user interests. Finally, in feed products, users tend to review a large number of items in a row such that the previously viewed items have a great impact on the users' behavior towards the next item [17, 23, 29]. Therefore, it is of vital importance to consider the influence from page context when determining the item order in the return list. Although integrated feed recommendation has been widely deployed in practice, there are still few works focusing on the above challenges systematically. In this paper, we propose a general framework named Multi-channel Integrated Recommendation with Exposure Constraints (MIREC) to deal with the multi-channel integrated recommendation task under resource constraints in feed products. MIREC consists of two layers: an allocation-layer which optimizes the exposure of different channels from a global view over all user requests, and a ranking-layer which determines the optimal item layout of a given user request from a local view. These two layers operate in an iterative manner to make online decisions along with the arrival of user requests. The main contributions are as follows. · This work formulates the integrated recommendation task with exposure constraints as a binary online linear programming problem and proposes a two-layer framework named MIREC to obtain the optimal solution. We also describe a practical system architecture for its implementation in industrial platforms. · This work proposes an efficient multi-channel allocation algorithm to obtain the optimal exposure assignment of different channels over a fixed time horizon. The proposed algorithm is able to reach an optimal solution with linear complexity w.r.t. the number of constraints. We also prove that this algorithm admits a regret bound of O( √ 𝑇 ) towards the global optimal point under certain assumptions. · This work proposes a series of collaborative models to determine the optimal layout of heterogeneous items on a page, with joint modeling of user interests, cross-channel correlation, and page context. This aligns more with the browsing nature of feed products than existing models. · This work conducts extensive experiments on both offline datasets and online A/B tests to verify the superiority of our proposed method. MIREC has been implemented on the homepage of Taobao to serve the main traffic. It brings 3% lift on user clicks, 1 . 56% lift on purchase, and 1 . 42% lift on stay time. It now serves hundreds of millions of users towards billions of items every day.", "2 RELATED WORK": "Re-ranking Methods. The main objective of re-ranking methods is to consider the mutual influence among a list of items in order to refine the prediction results produced by point-wise ranking models. Three prevalent models are commonly adopted in the existing literature: RNN-based methods, attention-based methods, and evaluator-generator-based methods. The first two methods feed an initial ranking list produced by point-wise models (e.g., Wide&Deep [10], DIN [39] and SIM [28]) into RNN-based (e.g., MiDNN [41], Seq2Slate [4] and DLCM [1]) or attention-based structure (e.g., PRM [27], PFRN [16], PEAR [20], and Raiss [22]) sequentially and output the encoded vector at each subsequent layer to model the mutual influences among items. The evaluator-generatorbased methods (e.g., SEG [32] and GRN [11]), use a generator to generate feasible permutations and use an evaluator to evaluate their list-wise utility to determine the optimal permutation. However, most re-ranking methods mainly focus on capturing the mutual influence among homogeneous items provided by one channel, instead of heterogeneous items provided by multiple channels. Moreover, they only optimize the item order at a single time slot, instead of considering a cumulative utility over a broad time horizon under resource constraints. Online Allocation Methods. The online allocation problem with resource constraints has been mostly studied in online convex optimization [15]. The primal-dual methods [3, 9, 25, 34, 35] avoid taking expensive projection iterations by penalizing the violation of constraints through duality. The BwK methods [2, 18] determines an optimal action from a finite set of possible actions and then optimize the policy of decision-making according to the observed rewards and costs over a fixed period of time. Several recent works studied the practical performance of online allocation in advertising recommendations. For example, PDOA [40] adopts the primal-dual framework by optimizing the dual prices with online gradient descent to eliminate the online max-min problem's regret. However, it assumes that the utility and cost values can be optimally estimated and only verify the performance through offline simulations. MSBCB [14] and HCA2E [6] proposed a two-level optimization framework based on BwK methods, where the high-level determines whether to present ads on the given request while the low-level searches the optimal position to insert ads. Most related works on online convex optimization focus on theoretical analysis (e.g., regret bound) instead of real-world applications. Other related works on advertising mainly consider binary content, i.e., ads or non-ads, instead of heterogeneous content. Directly extending them to deal with multi-channel recommendations in IRSs may lead to sub-optimal results. Integrated Recommendation. The integrated recommendation is a newly emerged but rapidly developing domain driven by practical problems [24]. Integrated recommendation methods need to consider both intra-channel and inter-channel features within the heterogeneous content and provide recommendation results continuously along with user arrivals. Recently, DHANR [13] proposed a hierarchical self-attention structure to consider the cross-channel interactions. HRL-Rec [33] decomposed the integrated re-ranking problem into two subtasks: source selection and item ranking, and use hierarchical reinforcement learning to solve the problem. DEAR [37] proposed to interpolate ads and organic items by deep Q-networks. Cross-DQN [21] also adopt a reinforcement learning solution with a cross-channel attention unit. However, many integrated methods only focus on ranking at a single time slot instead of over a continuous time horizon. The joint consideration of both integrated ranking and online allocation of limited resources still remains to be explored.", "3 PROBLEM FORMULATION": "This section formulates the integrated recommendation task with exposure constraints as a binary online linear programming problem. Specifically, we consider a generic IRS setting where user requests arrive sequentially during a finite time horizon. For each request, the IRS needs to rank a list of heterogeneous items provided by multiple channels. The aim is to maximize the overall utilities (e.g., the sum of clicks and pays) of all channels over the entire time horizon , subject to multiple resource constraints. Formally, the request of user 𝑢 triggered at time 𝑡 is described as 𝑒 𝑡 = ( 𝑢, 𝑓 , 𝑔, X 𝑡 ) , where 𝑓 ∈ R + is a non-negative utility function , 𝑔 ∈ R + is a non-negative resource consumption function , and X 𝑡 ⊂ R 𝑑 + is a compact set denoting all possible item layouts for decisionmaking. For each request 𝑒 𝑡 , the IRS needs to choose a number of 𝑁 heterogeneous items from a candidate set 𝐼 𝑡 and place them into 𝑁 slots to form a complete page and return it to the user. This action 𝒙 𝑡 ∈ X 𝑡 can be represented as a decision matrix 𝒙 𝑡 ∈ [ 0 , 1 ] 𝑁 ×| 𝐼 𝑡 | , where each entry 𝑥 𝑡,𝑛,𝑖 is indexed by a slot 𝑛 and a card index 𝑖 . Once the user finished viewing the current page, a new user request will be triggered to ask the platform to return to the next page. Therefore, this decision-making process will be performed repeatedly. Moreover, in real-world applications, the item layouts need to satisfy the following constraints: where the upper constraint restricts that each slot must be assigned to one item and the lower constraint restricts that each item can be assigned to at most one slot. After executing an action 𝒙 𝑡 at request 𝑒 𝑡 , the IRS consumes a resource cost 𝑔 ( 𝒙 𝑡 ) and obtains an utility 𝑓 ( 𝒙 𝑡 ) . In IRS, the utility function 𝑓 ( 𝒙 𝑡 ) is defined according to the concerned metrics. For example, it can be defined as a combination of stay time, adds to cart, and favorites to encourage user engagement, or defined as a combination of clicks and purchases to encourage user conversion. Onthe other hand, the consumption function 𝑔 ( 𝒙 𝑡 ) is defined based on the concerned resource constraints. For example, the platform may need to allocate a certain amount of exposure to new channels in order to support the growth of new content [12]. Meanwhile, a too large proportion of exposures on one specific channel will damage the recommendation diversity thereby harming user experience [6, 26]. In this case, the IRS needs to guarantee both a lower exposure limit and an upper exposure limit for the heterogeneous items from different channels. In this paper, we focus on the exposure constraints in practical systems which lead to the following optimization problem where 𝑁 (S) denotes the total available exposures to allocate over the entire time horizon, 𝐺 max 𝑚,𝑡ℎ and 𝐺 min 𝑚,𝑡ℎ denote the proportion of upper exposure limits and lower exposure limits for each channel 𝑚 ∈ M , respectively, and 𝑔 𝑚 ( 𝒙 𝑡 ) denotes the consumed exposures of cards from channel 𝑚 after executing 𝒙 𝑡 at request 𝑒 𝑡 . Although this paper mainly focuses on the exposure guarantee, the above formulation is generally applicable to other problems with different resource constraints, e.g., the number of coupons to allocate.", "4 METHODOLOGY": "", "4.1 Framework Overview": "Directly solving problem P 0 is challenging. On one hand, the estimation accuracy of utility 𝑓 ( 𝒙 𝑡 ) and consumption 𝑔 ( 𝒙 𝑡 ) suffer influence from multi-factors, including the user's personal interest, the page context, and the cross-correlation between different channels. On the other hand, the determination of each 𝒙 𝑡 needs to consider the cumulative exposures over the entire time horizon due to the exposure guarantees. Therefore, the optimization of exposure allocation must be performed from a global view over the entire timeline instead of a single time slot. To this end, we propose the MIREC framework which solves P 0 through online primal-dual iterations. Specifically, MIREC consists of two layers, i.e., the allocation-layer and the ranking-layer, which correspond to the dual and primal problem of P 0 , respectively. The allocation-layer optimizes dual variables to control the cumulative exposure of different channels on all user requests from a global view to guarantee the exposure limits. Meanwhile, the rankinglayer optimizes the item layout under fixed dual variables given by the allocation-layer, with the aim to maximize the instant utility on a single user request from a local view. These two layers operate in an iterative manner along with the arrival of online user requests to determine the optimal item layout at user requests continuously. The general workflow of MIREC is shown in Figure. 2. For the allocation-layer, we propose a simple but efficient Mirrordescent based Multi-channel Exposure Allocation (ME2A) algorithm to adaptively balance the utility gain and the exposure cost of presenting heterogeneous items from different channels. The proposed M2EA algorithm has a closed form solution that can be computed in linear time and admits a regret bound of O( √ 𝑇 ) towards the global optimal point under certain assumptions. For the ranking-layer, we propose a personalized cross-channel ranking (PCR) model and a context-aware reranking (CAR) model to jointly determine the optimal item layout on a given user request, with fixed dual parameters given by the allocation-layer. In particular, PCR gives point-wise estimation of the quality of candidate items by joint modeling the influence from user interests, intra-channel information, and inter-channel correlations. Afterward, CAR refines the point-wise estimation generated by PCR into context-aware estimation by making use of both the context information and the high-level knowledge extracted from PCR.", "4.2 Global: Online Exposure Allocation": "In this section, we introduce the primal-dual formulation of P 0 and propose the ME2A algorithm to obtain the optimal solution for online systems. The complete algorithm is presented in Algorithm 1. Streaming Data Center MHSA MHSA MHSA Linear Linear V K Linear Linear V K Linear Linear V K Linear Linear V K MLP & Softmax Concate & Flatten MLP & Sigmoid MHSA Target Item Channel-2 Candidate Seq ... Channel-N Candidate Seq User Behavior Seq User Profile Channel-1 Candidate Seq Concate & MLP Target Item Prev Context Cand Context PCR Embs PCR Scores (c) CAR Model Update Constraints Update Duals (b) PCR CAR CH-1 ... CH-N Upstream RSs Report Request Real-time Exposures Multi-Channel Candidate Items Final Item List Real-time Duals Point-wise Scores Context-aware Scores ... Channel Info Embedding Layer Concate&Linear Weighted Sum Inter-channel Encoding Layer Interest-Aware Evolution Layer Intra-channel Encoding Layer (b) PCR Model (a) MIREC Framework } ) | ( ) ( argmax{ t t t t t I x g x f x   Optimal Item Selection Scaled Dot-product MHSA Multi-head Self-attention Embedding Vector Weights Embedding Crossing Dot Product Concate Q Q Allocation-layer Ranking-layer User Device PCR Embs 4.2.1 Primal-dual Formulation. The Lagrangian dual function of problem P 0 can be written as This is the focus of the ranking-layer to be discussed layer. After the optimal item layout 𝒙 𝑡 at user request 𝑒 𝑡 is properly determined, the next step is to update the dual variable 𝝁 𝑡 to adjust the exposure of different channels in future user requests. Specifically, the remained exposure resource of different channels after the presentation of 𝒙 𝑡 at 𝑒 𝑡 is updated by Here 𝝁 ≥ 0 and 𝝀 ≥ 0 are the introduced dual parameters, 𝐺 max 𝑚 and 𝐺 min 𝑚 are short for 𝐺 max 𝑚,𝑡ℎ 𝑁 (S) and 𝐺 min 𝑚,𝑡ℎ 𝑁 (S) , respectively. Note that the parameters 𝝁 and 𝝀 are related to the violation of exposure consumption over the upper bound limit and the lower bound limit, respectively, which are mutually exclusive. In particular, if one of them is positive, the other one must be zero; otherwise, both of them are zero. Hence, it is viable to only introduce one real number dual variable 𝝁 ∈ R 1 × 𝑀 to replace 𝝁 and 𝝀 in the dual problem, which simplifies (5) into where [ 𝜇 𝑚 ] + = max { 𝜇 𝑚 , 0 } . 4.2.2 Dual Optimization for Exposure Constraints. The dual problem in (6) can be solved optimally via primal-dual updates. Specifically, given a user request 𝑒 𝑡 = ( 𝑢, 𝑓 , 𝑏, X 𝑡 ) , we assume that the utility 𝑓 ( 𝒙 𝑡 ) and cost 𝝁 𝑇 𝑡 𝑔 ( 𝒙 𝑡 ) under different item layout 𝒙 𝑡 can be properly estimated by the models at the ranking layer. As such, the optimal item layout 𝒙 𝑡 under a fixed dual variable 𝝁 𝑡 can be obtained by solving the following primal problem: The sub-gradient of the dual function in (6) can be obtained via Danskin's theorem [5] by ∇ 𝜇 𝑚,𝑡 = -𝑔 𝑚 ( 𝒙 𝑡 ) + 𝐺 max 𝑚,𝑡 + 1 · ✶ ( 𝜇 𝑚,𝑡 ≥ 0 ) + 𝐺 min 𝑚 · ✶ ( 𝜇 𝑚,𝑡 ≤ 0 ) , (9) where ✶ ( 𝑥 ∈ 𝐴 ) is an indicator function which equals to one if 𝑥 ∈ 𝐴 otherwise zero. As such, the dual variable 𝝁 𝑡 can be updated based on the mirror-descent method as where 𝑉 ℎ ( 𝑥,𝑦 ) = ℎ ( 𝑥 ) ℎ ( 𝑦 )∇ ℎ ( 𝑦 ) 𝑇 ( 𝑥 -𝑦 ) is the Bregman divergence based on reference function ℎ (·) and 𝜂 ∈ R is a fixed step-size. Note that this mirror descent step can be computed in linear time since (10) admits a closed-form solution. For example, if we use ℎ ( 𝝁 ) = 1 2 ∥ 𝝁 ∥ 2 as the reference function, the dual update in (10) becomes which recovers the online projected gradient descent method. Moreover, in order to guarantee the upper exposure constraints, one needs to examine the violation of upper limits of each channel before the determination of 𝒙 𝑡 at each user request. If the sum of exposures of a specific channel exceeds its upper bound, one needs to remove all candidate items from this channel to forbid allocate more exposures when determining 𝒙 𝑡 . We present the optimality of this proposed ME2A algorithm and its feasibility to guarantee exposure constraints of different channels as follows. Detailed proofs are deferred to the appendix. Algorithm 1 The proposed ME2A algorithm of MIREC 1: Initialization: 2: Initial dual solution 𝜇 1 , total time periods 𝑇 , reference function ℎ (·) and step-size 𝜂 . 3: Iteration: 4: for 𝑡 = 1 , 2 , · · · , 𝑇 do 5: Receive request 𝑒 𝑡 = ( 𝑢, 𝑓 , 𝑏, X 𝑡 ) . 6: Update the candidate set 𝐼 𝑡 provided by multi-channels. 7: Determine the optimal item list 𝒙 𝑡 by solving the primal problem in (7) at the ranking-layer. 8: Update the remained exposure resource via (8). 9: Obtain the sub-gradient of the dual variable via (9). 10: Update the dual variable based on mirror descent via (11). 11: end for 4.2.3 Optimality. It is viable to prove that Algorithm 1 is asymptotically optimal and admits a regret bound scales as O( √ 𝑇 ) when the user requests arrive from an i.i.d unknown distribution. This assumption is reasonable when the number of requests is numerous [3, 25, 40]. Specifically, we denote Algorithm 1 as 𝜋 and the overall utility over all user requests in set S under the running of 𝜋 as 𝑅 ( 𝜋 |S) = ˝ 𝑇 𝑡 = 1 𝑓 ( 𝒙 𝑡 ) . The regret of model 𝜋 is defined as the worst-case difference over S between the expected performance of the global optimal solution and the model 𝜋 : where OPT (S) denotes the optimal utilities one can obtain under the request set S . The regret bound can be given as follows. Theorem 1. Suppose that the requests come from an i.i.d model with unknown distribution. Then, Regret ( 𝜋 |S) ≤ 𝐶 1 + 𝐶 2 𝜂𝑇 + 𝐶 3 𝜂 with 𝜂 > 0 holds for any 𝑇 ≥ 1 . Here 𝐶 1 , 𝐶 2 and 𝐶 3 are constant values depending on the numerical bounds of the utility 𝑓 , the consumption 𝑔 , and terms from the dual iterates in Eq. (10). From Theorem 1, we obtain Regret ( 𝜋 |S) ≤ 𝑂 ( √ 𝑇 ) when using a step-size 𝜂 ∝ 𝑐 / √ 𝑇 with any constant 𝑐 > 0. We defer the proof and detailed definitions of 𝐶 1 , 𝐶 2 , and 𝐶 3 into the appendix. 4.2.4 Exposure Feasibility. In Algorithm 1, if the upper exposure limit of a specific channel is violated, we will forbid the exposure of any item from this channel when determining the item list 𝒙 𝑡 . Therefore, the exposure can never be overspent. On the other hand, the lower exposure limits are soft-restricted by adaptively adjusting the dual variable 𝝁 . This may cause exposure underspent. However, it is viable to prove that the violation of the lower exposure limit of any channel also admits a convergence rate of 𝑂 ( √ 𝑇 ) . In other words, even if the violations on lower exposure limits may occur, their growth is considerably smaller than 𝑇 . Proposition 1. Suppose the requests come from an i.i.d model with unknown distribution. Then, it holds for any 𝑇 ≥ 1 and any channel 𝑚 ∈ M that 𝐺 min 𝑚 -E h ˝ 𝑇 𝑡 = 1 𝑔 𝑚 ( 𝒙 𝑡 ) i ≤ 𝐶 4 + 𝐶 5 𝜂 , where 𝐶 4 and 𝐶 5 are constant values depends on the numerical bounds of utility 𝑓 , consumption 𝑔 , and terms from the dual iterates (10) . Proposition 1 states that when using 𝜂 ∝ 𝑐 / √ 𝑇 with 𝑐 > 0, the exposure underspend of any channel is bounded by 𝑂 ( √ 𝑇 ) . We defer the proof and definitions of 𝐶 4 and 𝐶 5 into the appendix.", "4.3 Local: Context-Aware Integrated Ranking": "Different from the allocation-layer which optimizes an objective with accumulative utilities over the entire time horizon as defined in (6), the ranking-layer focus on maximizing the utilities on a single time slot. This corresponds to the primal problem given in (7): In other words, the allocation layer adjusts the exposure of items from different channels by optimizing the dual parameter 𝝁 𝑡 from a global view of all user requests. While the ranking-layer determines the optimal item list 𝒙 𝑡 under a fixed dual variable 𝝁 𝑡 from a local view of a given user request 𝑒 𝑡 . There are two common characteristics that are strongly related to the estimation of 𝑓 ( 𝒙 𝑡 ) and 𝑔 ( 𝒙 𝑡 ) in the integrated recommendation. First, users' preference on different channels has a great impact on the utility (e.g., prefer to click or not) and exposure (e.g., prefer to view or not) estimations. Therefore, it is of vital importance to consider both intra-channel and inter-channel correlations with reference to user interests during the estimation. Second, in feed products, users tend to review a large number of items in a row such that the previously viewed items have a great impact on users' behavior towards the next item. Therefore, it is necessary to consider page context when determining the item order. Therefore, we propose two models to deal with the above two challenges, respectively. First, we propose PCR model to deal with the joint modeling of user interests and inter/intra-channel correlation. It gives a point-wise estimation of the utility/exposure value of presenting each candidate item. Second, we propose CAR model to refine the point-wise estimation from PCR into contextaware estimation by considering both context information and the high-level knowledge obtained from PCR. It is also responsible for selecting optimal items from a set of candidate items to generate the final return list. In real-world systems, for each user request, we only need to run PCR once to get the point-wise scores, and then run CAR multiple times to generate the return list. Next, we mainly focus on the estimation of 𝑓 ( 𝑥 ) , the estimation of 𝑔 ( 𝑥 ) can be performed in a similar way by changing the learning goals. 4.3.1 Personalized Cross-Channel Ranking Model. PCR takes four types of features as input, i.e., the user profile feature 𝑋 𝑢 , the user behavior sequences 𝑋 𝑏 , the candidate items provided by each channel 𝑋 𝑙 , and the item-level features of target item 𝑋 𝑖 . As shown in Figure 2, We use an embedding layer to transform these features into dense embedding vectors, denoted as 𝐸 𝑢 , 𝐸 𝑏 , 𝐸 𝑙 and 𝐸 𝑖 , respectively. These embedding vectors are then fed into three components, i.e., the intra-channel encoding layer, interest-aware evolution layer, and inter-channel encoding layer in order, which are described below. Intra-Channel Encoding layer. This layer aims at extracting the mutual influence of item pairs and other extra information within the channel. We adopt the well-known multi-head attention [31] as the basic learning unit for intra-channel encoding. This is due to that the self-attention mechanism is able to directly capture the mutual influences between any two items, and is robust to far distance within the sequence. Formally, the formulation of this attention-based encoding can be written as where 𝑊 𝑂 ∈ R 𝑑 ℎ × 𝑑 ℎ denotes the learnable parameters for each head with 𝑑 ℎ being the length of projected embedding vector after attention, 𝑊 𝑄 , 𝑊 𝐾 , 𝑊 𝑉 ∈ R 𝑑 × 𝑑 ℎ / ℎ are the vectors of query, key and value with 𝑑 being the length of original embedding vector and ℎ being the number of heads, 𝑉 𝑚 𝑙 represents the encoded candidate items of each channel 𝑚 ∈ M . Interest-Aware Evolution Layer. Existing works such as PRM [27] and DHANR [13] directly apply the self-attention mechanism to model the inter-dependencies among items and channels without considering user's recent behavior. However, the interests hidden in user's behavior items usually have a great impact on the prediction accuracy in recommendation tasks [7, 28, 38, 39]. The recently proposed PEAR [20] firstly models the dependency between the candidate item list and the user's historical behaviors based on a transformer-like structure, which, however, suffers from two limitations. First, directly mixing the raw item-level features from user behavior items may introduce redundant or noisy information to degrade the learning performance. Second, each user may exhibit multiple interest points, such that it is beneficial to reinforce the interest related to the target item before feature-crossing to avoid drifting. Therefore, we first reinforce the interest vector according to the correlation between behavior items and the target item as where 𝐵 is the length of behavior sequence, 𝑏 𝑖 is the behavior item, 𝑉 𝑈 denotes the user representation feature with respect to 𝐸 𝑖 , and 𝐴 (·) is a feed-forward network whose output is the activation weight 𝑤 𝑖 . Then, we make use of this reinforced interest vector to extract useful information from the candidate items of different channels. Formally, for each channel 𝑚 , given 𝑉 𝑚 𝑙 and 𝑉 𝑈 as inputs, we use scaled dot-product attention formulated as follows: where 𝑊 𝑘 1 , 𝑊 𝑣 1 ∈ R 𝑑 × 𝑑 ℎ and 𝑊 𝑘 2 , 𝑊 𝑞 , 𝑊 𝑣 2 ∈ R 𝑑 ℎ × 𝑑 ℎ are all learnable parameters, [·] denotes the concatenation operation. After the above operations, we successfully merged the information from the candidate item lists and the user's historical behaviors into a series of evolved embedding vectors for further processing. Inter-Channel Encoding Layer. Previous layers mainly extract intra-channel correlations. We now focus on the modeling of interchannel correlation. First, we feed the embedding vector of each channel and the target item embedding into the MLP layer with softmax function to obtain the importance weights on each channel that is related to the target item: where 𝑊 𝐶𝐻 ∈ R 1 × 𝑚 is the importance weights, and 𝐻 𝑠 𝑚 denotes the concatenation of all channels' output from the Interest-Aware Evolution Layer. Second, we perform multi-head self-attention on the evolved embedding vector 𝐻 𝑠 𝑚 of each channel 𝑚 ∈ M to obtain the mixed embedding ˜ 𝐻 𝑠 𝑚 which contains rich inter-channel information. Then, we perform the weighted sum on the mixed embedding of all channels based on 𝑊 𝐶𝐻 to get the final representation of multi-channel modeling: where [ ˜ 𝐻 𝑠 𝑚 ] represents the concatenation of the mixed embeddings of all channels. Finally, we concatenate all vectors as input and feed it into the MLP layers with a sigmoid function to predict the utility of presenting a given target item to a given target user as 4.3.2 Context-Aware Refinement Model. In this section, we propose the CAR model to refine the point-wise utility scores estimated by PCR into context-aware utility scores. Given a candidate item set 𝐼 𝑐𝑎𝑛𝑑 with size 𝑁 , the aim of CAR is to optimally choose 𝐾 items from 𝐼 𝑐𝑎𝑛𝑑 and allocate them to the 𝐾 slots in a page based on the learning results from PCR. We maintain two types of context information in CAR, i.e., the context of previous items and the context of remaining candidate items. Specifically, when selecting the 𝑘 -th item in a page, we represent the context of previously presented 𝑘 -1 items ℎ 𝑝𝑟𝑒 by mean-pooling over their embeddings. Meanwhile, we represent the context of all candidate items ℎ 𝑐𝑎𝑛 by mean-pooling over the embeddings of all remained candidates. These two context vectors are updated and repeated along with the item selection process. Furthermore, we perform a series of embedding crossing operations between the target item embedding 𝑒 𝑖 and the context embeddings to model the influence from page context. In specific, the operations in the context of previous items can be formulated as follows: where ⊕ , ⊗ , and ⊖ denote the addition, subtraction, and dot product between embedding vectors, respectively. The same goes for 𝐻 𝑐𝑡 by replacing ℎ 𝑝𝑟𝑒 in (19) with the context of candidate items ℎ 𝑐𝑎𝑛 . Additionally, we also perform embedding-crossing between the context embeddings and the high-level knowledge 𝑉 𝐿 from PCR to obtain another two vectors, i.e., 𝐻 𝑣 𝑐𝑡 and 𝐻 𝑣 𝑝𝑟𝑒 . Finally, for each candidate item 𝑖 ∈ 𝐼 𝑐𝑎𝑛𝑑 , we predict the contextaware utility score by feeding these embedding vectors along with the point-wise utility score 𝑌 𝑃𝐶𝑅 from PCR and user profile features 𝐸 𝑢 into one MLP layer as where 𝜎 represents the sigmoid activation function. After scoring all candidate items, we choose the item with the highest score as the optimal item for slot 𝑘 , and update the context vectors and the remained candidate items accordingly. This process will be repeated 𝐾 times to generate a return item list of length 𝐾 . Note that the above operations in CAR only involve linear computations, such that this item selection process is cost-efficient in online systems. CAR PCR Data Links User Logs )} ( ) ( argmax{ t t t x g x f  (a) Integrated Ranking Controller Final Item List Request Candidate Items Channel-2 Channel-N Channel-1 Upstream RS ... Record User Device Context-Aware Estimation Feature Center (b) Exposure Controller MCA Real-time Exposures Real-time Features Data Stream Center Duals Both PCR and CAR can be trained with the commonly used crossentropy loss as in other ranking models, the learning objective can be given as where D denotes the training dataset, 𝑦 𝑒 𝑡 𝑢,𝑖 is the real user-item recommendation label (equals 1 or 0) between user 𝑢 and item 𝑖 at request 𝑒 𝑡 , and ˆ 𝑦 𝑒 𝑡 𝑢,𝑖 is the predicted label given by 𝑌 𝑃𝐶𝑅 or 𝑌 𝐶𝐴𝑅 . In our experiments, when predicting the utility function 𝑓 with user clicks, 𝑦 𝑒 𝑡 𝑢,𝑖 refers to the click label; when predicting the cost function 𝑔 with exposure constraints, 𝑦 𝑒 𝑡 𝑢,𝑖 refers to the exposure label between user 𝑢 and item 𝑖 at request 𝑒 𝑡 , i.e., whether user 𝑢 has seen item 𝑖 at request 𝑒 𝑡 . One can readily change the learning objective according to actual demands.", "4.4 Online Implementation": "In this section, we introduce the online implementation of our proposed MIREC model in the homepage feed of Taobao. The presented system architecture is able to handle 120 , 000 QPS at traffic peak and respond within 20 milliseconds in general. It now serves the main traffic of Taobao to provide services to hundreds of millions of users towards billions of items in Taobao every day. Figure. 3 gives a general architecture to implement our proposed MIREC model in real-world IRS. Each time a user request is triggered from the device, the upstream RS of each channel will run its own recommendation models to determine the top items to return. The Integrated Recommendation Controller uses the top items from all channels as the candidates. It retrieves user/item features from a feature center in real-time and ranks candidate items by solving based on our proposed LCPR and PCR model. Meanwhile, the dual variable 𝜇 is estimated by an Exposure Controller. This module monitors the completeness of exposure guarantees based on the real-time exposures collected from user logs and updates the dual variable to adjust the exposures on different channels periodically.", "5 EXPERIMENTAL RESULTS": "This section conducts extensive experiments on both offline datasets and real-world applications with the goal of answering the following research questions: Q1: Does our proposed PCR and CAR outperform other baseline models in integrated ranking tasks? Q2: Does our proposed MIREC framework outperform other methods in integrated recommendation tasks with exposure constraints? Q3: How does MIREC perform in real-world applications?", "5.1 Experimental Setup": "5.1.1 Datasets. Weuse one public dataset named MicroVideo-1.7M and one industrial dataset named Taobao for experiments. The public available MicroVideo-1.7M dataset 1 released by [8] contains 12 , 737 , 619 interactions that 10 , 986 users have made on 1 , 704 , 880 micro-videos. This dataset provides rich user behavior data and timestamps to evaluate the performance on both interest modeling and context-aware reranking. The Taobao dataset is an industrial private dataset that contains users' behaviors and feedback logs from multiple channels in the homepage feed of Taobao Mobile App. It is one of the largest feed scenarios for online merchandise in China. The feed provides items in form of the streams, videos, pictures, etc, from various channels. Users can slide to view more items in a row. This dataset contains about ten billion interactions that one hundred million of users have made on sixty million items. Wealso conduct online A/B tests on the platform Taobao to examine the performance of MIREC in real-world applications. 5.1.2 Comparing Methods. We compare MIREC with two mainstreams of baselines. The first steam of baselines are the methods for ranking tasks with different goals on user interest modeling (i.e., DIN and DIEN), re-ranking (i.e., DLCM, PRM, and PEAR), or multichannel recommendation (i.e., STAR and DHANR). Specifically, DIN [39] is a widely used benchmark for sequential user data modeling in point-wise CTR predictions, which models short behavior sequences with target attention. DIEN [39] combines GRUs and attention to capture temporal interests from users' historical behaviors with respect to the target item. DLCM [1] uses gated recurrent units (GRU) to sequentially encode the top-ranked items with their feature vectors. PRM [27]: directly optimizes the whole recommendation list by employing a Transformer structure to efficiently encode the information of all items in the list. PEAR [20] not only captures feature-level and item-level interactions but also models item contexts from both the candidate list and the historical clicked item list. STAR [30] trains a unified model to serve all channels simultaneously, which consists of shared centered parameters and channel-specific parameters. DHANR [13] proposes a hierarchical self-attention structure to consider cross-channel interactions. The second stream of baselines is the online allocation methods which have been successfully applied in industrial applications for online resource allocation. Fixed is the fixed-positions strategy, where the positions of recommended items and ads are manually pre-determined for every request. 𝛽 -WPO : is based on the WholePage Optimization (WPO) [36]. WPO ranks recommended and ad candidates jointly according to the predefined ranking scores. Similar to [6], we introduce an adjustable variable 𝛽 to control the proportion of different channels on each request to satisfy the resource constraint. In general, 𝛽 -WPO can be regarded as a heuristic list merging algorithm. Each list from one channel is assigned a priority weight. The algorithm merges the top items of each list based on both their ranking scores and the priority weights into a final return list. HCA2E [6]: proposed a two-level optimization framework based on BwK methods. The high-level determines whether to present ads on the page while the low-level searches the optimal position to insert ads heuristically. 5.1.3 Metrics. For offline experiments, we use user clicks to measure the utility function 𝑓 . For online experiments, we consider a joint measurement of user click, purchase, and stay-time for utility function 𝑓 . For all experiments, we use the exposure of items to measure cost function 𝑔 . In this case, we compare the performance of integrated ranking in offline evaluation using the widely used Area Under ROC (AUC) and normalized discounted cumulative gain (nDCG) [19]. Remark that nDCG@K refers to the performance of top-k recommended items in the return list. The online performance is evaluated by CLICK, Click-Through-Rate (CTR), Gross Merchandise Volume (GMV), and Stay Time. Here, CLICK refers to the total number of clicked items. CTR is defined as CLICK/PV with PV denoting the total number of impressed items. CTR measures users' willingness to click and is therefore a widely used metric in practical applications. GMV is a term used in online retailing to indicate a total sales monetary-value for merchandise sold over a certain period of time. Stay Time denotes the time period of users' average stay time in the product, averaged on all users. 5.1.4 Reproducibility. Our source codes have been made public to ensure reproducibility 2 . In all experiments, we use the validation set to tune the hyper-parameters to generate the best performance for different methods. The learning rate is searched from 10 -4 to 10 -2 . The L2 regularization term is searched from 10 -4 to 1. All models use Adam as the optimizer.", "5.2 Offline Evaluation": "5.2.1 Q1: Performance on Integrated Ranking. We first compare the performance with the first stream of baselines on item ranking. The results are shown in Table 1, which leads to the following findings. First, the re-ranking methods perform generally better than the point-wise user interest methods, indicating that modeling mutual influence among the input ranking list is of vital importance for the ranking. Therefore, it is essential to consider the influence from page context in feed recommendations. Second, the multi-channel methods perform better than the reranking methods, which verifies that exploiting the distinction and mutual influence among different channels has a great impact on integrated recommendations. Besides, we also notice that DHANR performs better than STAR, which may be due to that DHANR considers both the correlation among different channels and the influence from the candidate list. Finally, our proposed MIREC model achieves superior performance than other competitors on all datasets, verifying the effectiveness of joint modeling the cross-channel information, user interest, context information, and candidate list. 5.2.2 Ablation Study. Theresults in Table. 2 investigates the impact of each component of MIREC on item quality estimation. Specifically, PCR ∗ replaces the attention mechanism for user behaviors in the Merged-Sequence Evolution layer with a self-attention mechanism which is in accordance with PEAR [20]. PCR outperforms PCR ∗ indicates that the tailored attention mechanism in PCR can filter out noisy or redundant information from historical behaviors to benefit the subsequent modeling of bi-sequence interaction. PCR † removes the scaled dot-product attention mechanism (i.e. there is no explicit interaction between initial lists and user behaviors) and achieved a worse performance. This demonstrates the necessity of this direct modeling between sequences, directly guiding the reordering of the initial lists. PCR w/o IntraCE removes the IntraChannel Encoding module, i.e., directly feeding the embeddings of the initial item lists into subsequent layers for learning. The result shows that PCR achieves superior performance than PCR w/o IntraCE, verifying that it is of vital importance to model the mutual information inside each channel for final prediction. PCR w/o InterCE removes the Inter-Channel Encoding, which also leads to worse performance. It verifies that without considering the relationship and distinction between different channels will degrade the model performance considerably. Moreover, the joint learning of PCR and CAR performs better than only using PCR. This verifies that the modeling of page-wise context information can improve prediction accuracy effectively. 5.2.3 Q2: Performance with Exposure Constraints. To the best of our knowledge, there does not exist publicly available datasets which has rich user logs and multi-channel features to examine the joint performance of integrated recommendation and exposure allocation. Therefore, we only perform experiments on Taobao dataset, using the complete platform logs. In this experiment, we assume that the IRS needs to allocate exposures to satisfy the exposure guarantees of four distinct channels. The aim is to maximize the overall user-click utility of all channels. The compared fixed, WPO, and HCA2E methods all use point-wise scores to be consistent with their original proposals. For HCA2E, we use their proposed heuristic search method to determine the final order of the item list. The results are shown in Table 3, which are averaged on multiple runs to give a fair comparison. The simulated time horizon is one complete day with more than one billion user requests from real productive environment. We evaluate the performance using two different sets of lower bounds: 1) Channel 1=55%, Channel 2 = 20%, Channel 3 = 15%, Channel 4 = 10%; 2) Channel 1=70%, Channel 2 = 15%, Channel 3 = 10%, Channel 4 = 5%. The parameters of all comparing methods are carefully tuned to satisfy the exposure constraints. The completeness in Table 3 shows that all methods can control the violation of constraints to a low-level. HCA2E and our proposed MIREC perform slightly better than the fixed method and the WPO method. Noticeably, our proposed method outperforms other comparing methods considerably in terms of CTR enhancement, which verifies that the joint use of the allocation and estimation algorithm can bring a remarkable improvement in practical environments.", "5.3 Online Evaluation": "MIREC has been fully deployed in the homepage feed of Taobao named Guess-you-like to serve the main traffic. Guess-you-like is one of the largest merchandise feed recommendation platform in China, which serves more than hundreds of millions of users toward billions of items every day. We deploy MIREC at the integrated recommendation stage in Guess-you-like platform, which takes hundreds of candidate items provided by multiple channels as input and outputs the final item list to return to the user. The online performance is compared against our previous baseline which is similar as a combination of 𝛽 -WPO and HCA2E. In particular, the baseline uses a point-wise model for item quality estimation and uses a PID-based feedback control to automatically adjust parameter 𝛽 to guarantee the exposures for different channels. For each user \u0000 \u0000 \u0000 \u0000 \u0000 \u0000 \u0000 \u0000 \u0000 \u0000\u0000 \u0000\u0000 \u0000\u0000 \u0000\u0000 \u0000\u0000 \u0000\u0000\u0000 \u0000\u0000 \u0000 \u0000 \u0000 \u0000\u0000 \u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000 \u0000\u0000\u0000\u0000 \u0000\u0000\u0000\u0000 \u0000\u0000 \u0000\u0000 \u0000\u0000 \u0000\u0000\u0000 \u0000\u0000\u0000 \u0000\u0000\u0000 \u0000\u0000\u0000 \u0000\u0000\u0000 \u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000 \u0000\u0000\u0000\u0000 \u0000\u0000\u0000\u0000 \u0000\u0000\u0000\u0000 \u0000\u0000\u0000\u0000 \u0000\u0000\u0000\u0000 \u0000\u0000\u0000 \u0000\u0000\u0000\u0000 \u0000\u0000\u0000\u0000 \u0000\u0000 (b) Exposure distribution. \u0000\u0000 \u0000\u0000 \u0000\u0000 \u0000\u0000\u0000 \u0000\u0000\u0000 \u0000\u0000\u0000 \u0000\u0000\u0000 \u0000\u0000\u0000 \u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000 \u0000 \u0000 \u0000 \u0000 \u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000 \u0000\u0000\u0000\u0000 \u0000\u0000\u0000\u0000 (c) CTR on different positions. request, the baseline also runs an MDP-based search method to determine the optimal card layout based on the estimated scores, which is similar as the heuristic search method in HCA2E. The overall performance in Table 4 is averaged over two consecutive weeks. The results show that compared with the baseline method, MIREC brings an improvement of 3 . 00% for CLICK, 1 . 75% for CTR, 1 . 56% for GMV, and 1 . 42% for stay time. Compared with the fixed method, MIREC brings an improvement of 3 . 00% for CLICK, 1 . 75% for CTR, 1 . 56% for GMV, and 1 . 42% for stay time. These improvements indicate that our framework is able to increase user's willingness to stay and interact with the recommended items in practical applications. It is noteworthy that 1% improvement on CLICK in Guess-you-like brings millions of clicks every day. Figure. 4 shows a detailed comparison of the exposure allocation results of a specific channel, where the items from this channel have a generally lower CTR than others. Each line in Figure. 4(a) represents the robustness of long-term exposure guarantee of this channel within two consecutive weeks. It is clear that compared with the baseline, our proposed MIREC is more robust to alleviate daily exposure fluctuations. The distribution of exposures on different positions in the feed is given in Figure. 4(b). The result shows that our proposed framework tends to put lower-quality items backward to increase the overall utilities of all channels. Consequently, as shown in Figure. 4(c), the averaged CTR of all channels on each position can be improved remarkably. This verifies that MIREC is superior in optimizing the item layout from a global perspective.", "6 CONCLUSION": "In this paper, we consider the integrated recommendation task with exposure constraints. In particular, we propose a two-layer framework named MIREC, where the allocation-layer optimizes the exposure of different channels, while the ranking-layer determines the optimal item layout on each page. Extensive experiments verified the effectiveness of our proposed framework. MIREC has been implemented on the homepage feed in Taobao to serve hundreds of millions of users towards billions of items every day.", "REFERENCES": "[1] Qingyao Ai, Keping Bi, Jiafeng Guo, and W Bruce Croft. Learning a deep listwise context model for ranking refinement. In The 41st international ACM SIGIR conference on research & development in information retrieval , pages 135-144, 2018. [2] Ashwinkumar Badanidiyuru, Robert Kleinberg, and Aleksandrs Slivkins. Bandits with knapsacks. Journal of the ACM (JACM) , 65(3):1-55, 2018. [3] Santiago R Balseiro, Haihao Lu, and Vahab Mirrokni. The best of many worlds: Dual mirror descent for online allocation problems. Operations Research , 2022. [4] Irwan Bello, Sayali Kulkarni, Sagar Jain, Craig Boutilier, Ed Chi, Elad Eban, Xiyang Luo, Alan Mackey, and Ofer Meshi. Seq2slate: Re-ranking and slate optimization with rnns. arXiv preprint arXiv:1810.02019 , 2018. [5] Dimitri P Bertsekas. Nonlinear programming. Journal of the Operational Research Society , 48(3):334-334, 1997. [6] Dagui Chen, Qi Yan, Chunjie Chen, Zhenzhe Zheng, Yangsu Liu, Zhenjia Ma, Chuan Yu, Jian Xu, and Bo Zheng. Hierarchically constrained adaptive ad exposure in feeds. arXiv preprint arXiv:2205.15759 , 2022. [7] Qiwei Chen, Yue Xu, Changhua Pei, Shanshan Lv, Tao Zhuang, and Junfeng Ge. Efficient long sequential user data modeling for click-through rate prediction. arXiv preprint arXiv:2209.12212 , 2022. [8] Xusong Chen, Dong Liu, Zheng-Jun Zha, Wengang Zhou, Zhiwei Xiong, and Yan Li. Temporal hierarchical attention at category- and item-level for micro-video click-through prediction. In MM , pages 1146-1153, 2018. [9] Yuwei Chen, Zengde Deng, Yinzhi Zhou, Zaiyi Chen, Yujie Chen, and Haoyuan Hu. An online algorithm for chance constrained resource allocation. In IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP) , pages 1-5. IEEE, 2023. [10] Heng-Tze Cheng, Levent Koc, Jeremiah Harmsen, Tal Shaked, Tushar Chandra, Hrishi Aradhye, Glen Anderson, Greg Corrado, Wei Chai, Mustafa Ispir, et al. Wide&deeplearning for recommender systems. In Proceedings of the 1st workshop on deep learning for recommender systems , pages 7-10, 2016. [11] Yufei Feng, Binbin Hu, Yu Gong, Fei Sun, Qingwen Liu, and Wenwu Ou. GRN: Generative rerank network for context-wise recommendation. arXiv preprint arXiv:2104.00860 , 2021. [12] Jyotirmoy Gope and Sanjay Kumar Jain. A survey on solving cold start problem in recommender systems. In 2017 International Conference on Computing, Communication and Automation (ICCCA) , pages 133-138. IEEE, 2017. [13] Qi Hao, Tianze Luo, and Guangda Huzhang. Re-ranking with constraints on diversified exposures for homepage recommender system. arXiv preprint arXiv:2112.07621 , 2021. [14] Xiaotian Hao, Zhaoqing Peng, Yi Ma, Guan Wang, Junqi Jin, Jianye Hao, Shan Chen, Rongquan Bai, Mingzhou Xie, Miao Xu, et al. Dynamic knapsack optimization towards efficient multi-channel sequential advertising. In International Conference on Machine Learning , pages 4060-4070, 2020. [15] Elad Hazan et al. Introduction to online convex optimization. Foundations and Trends® in Optimization , 2(3-4):157-325, 2016. [16] Jinhong Huang, Yang Li, Shan Sun, Bufeng Zhang, and Jin Huang. Personalized flight itinerary ranking at fliggy. In Proceedings of the 29th ACM International Conference on Information & Knowledge Management , pages 2541-2548, 2020. [17] Yanhua Huang, Weikun Wang, Lei Zhang, and Ruiwen Xu. Sliding spectrum decomposition for diversified recommendation. In Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery & Data Mining , pages 3041-3049, 2021. [18] Nicole Immorlica, Karthik Abinav Sankararaman, Robert Schapire, and Aleksandrs Slivkins. Adversarial bandits with knapsacks. In 2019 IEEE 60th Annual Symposium on Foundations of Computer Science (FOCS) , pages 202-219, 2019. [19] Kalervo Järvelin and Jaana Kekäläinen. IR evaluation methods for retrieving highly relevant documents. In ACM SIGIR Forum , pages 243-250, 2017. [20] Yi Li, Jieming Zhu, Weiwen Liu, Liangcai Su, Guohao Cai, Qi Zhang, Ruiming Tang, Xi Xiao, and Xiuqiang He. Pear: Personalized re-ranking with contextualized transformer for recommendation. In Proceedings of the ACM Web Conference 2022 , pages 62-69, 2022. [21] Guogang Liao, Ze Wang, Xiaoxu Wu, Xiaowen Shi, Chuheng Zhang, Yongkang Wang, Xingxing Wang, and Dong Wang. Cross DQN: Cross deep Q network for ads allocation in feed. In Proceedings of the ACM Web Conference 2022 , pages 401-409, 2022. [22] Zhuoyi Lin, Sheng Zang, Rundong Wang, Zhu Sun, Chi Xu, and Chee-Keong Kwoh. Attention over self-attention: Intention-aware re-ranking with dynamic transformer encoders for recommendation. arXiv preprint arXiv:2201.05333 , 2022. [23] Zihan Lin, Hui Wang, Jingshu Mao, Wayne Xin Zhao, Cheng Wang, Peng Jiang, and Ji-Rong Wen. Feature-aware diversified re-ranking with disentangled representations for relevant recommendation. In Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining , pages 3327-3335, 2022. [24] Weiwen Liu, Yunjia Xi, Jiarui Qin, Fei Sun, Bo Chen, Weinan Zhang, Rui Zhang, and Ruiming Tang. Neural re-ranking in multi-stage recommender systems: A review. In IJCAI , pages 5512-5520, 2020. [41] Tao Zhuang, Wenwu Ou, and Zhirong Wang. Globally optimized mutual influence aware ranking in e-commerce search. In IJCAI , pages 3725-3731, 2018.", "A PROOF OF REGRET BOUND": "Our proof shares the same spirit as that of Theorem 1 in [3, 25]. The difference is that [3] does not consider a lower resource limit while [25] develops proof with an additional learnable parameter within 𝑓 ( 𝒙 𝑡 ) and 𝑔 ( 𝒙 𝑡 ) . Therefore, we here develop a separate proof that is consistent with our formulation. We directly refer to a few propositions in [3, 25] as preliminaries for simplicity. It is noteworthy that developing new proof of the online revenue maximization problem is not the main focus of this paper. Recall that the integrated recommendation problem is Since 𝑁 (S) denotes the sum exposures over the entire time horizon from 𝑡 = 1 to 𝑇 , we can replace the the upper exposure limit 𝐺 max 𝑚,𝑡ℎ 𝑁 (S) and lower exposure limit 𝐺 min 𝑚,𝑡ℎ 𝑁 (S) with 𝑇𝐺 𝑚 and 𝛼𝑇𝐺 𝑚 for simplicity, respectively, where 𝐺 𝑚 , 𝛼 ∈ [ 0 , 1 ] are constants. As such, problem P 0 can be reformulated as Before our analysis, we define constants ¯ 𝑓 , ¯ 𝑔 > 0, 𝐺 > 0 and ¯ 𝐺 > 0 such that sup 𝒙 ∈X 𝑓 ( 𝒙 ) ≤ ¯ 𝑓 , sup 𝒙 ∈X 𝑔 ( 𝒙 ) ≤ ¯ 𝑔 , 𝐺 : = min 𝑚 ∈M 𝐺 𝑚 and ¯ 𝐺 : = max 𝑚 ∈M 𝐺 𝑚 . Also, 𝜃 refers to the strongly-convexity parameter of the reference function ℎ (·) . First, we bound the dual iterates as follows. Assumption A.1. There exists a constant 𝐶 ℎ > 0 such that the dual iterates 𝜇 𝑡 satisfy E [||∇ ℎ ( 𝜇 𝑡 )|| ∞ ] ≤ 𝐶 ℎ , ∀ 𝑡 ∈ [ 𝑇 ] . Remark1. Note that, when choosing the reference function ℎ ( 𝜆 ) : = 1 2 ∥ 𝜆 ∥ 2 , Assumption A.1 can be omited according to Proposition 3 in [25]. Denote the online Algorithm 1 as 𝜋 which makes a real-time decision 𝒙 𝑡 at time 𝑡 . Define the stopping time 𝜏 𝜋 ≤ 𝑇 as the minimum between 𝑇 and the smallest time 𝑡 such that there exists 𝑚 ∈ M with ˝ 𝜏 𝜋 𝑡 = 1 𝑔 𝑚 ( 𝒙 𝑡 ) + ¯ 𝑔 > 𝑇𝐺 𝑘 . In other words, 𝜏 𝜋 refers to the first time the violation of one resource constraint happens. We bound the averaged gap between 𝑇 and 𝜏 𝜋 as follows. Proposition 2. Suppose that Assumption A.1 holds, using a constant step-size 𝜂 > 0 in Algorithm 1 yields Proof. According to Step. 9 in Algorithm 1 we have Assume that the stopping time 𝜏 𝜋 is activated due to the violation of constraint on 𝑘 -th channel, we have which leads to According to Proposition 6 in [25], the gradients of mirror descent satisfy ∇ ℎ 𝑘 ( 𝜇 𝑡 + 1 𝑘 ) ≥ ∇ ℎ 𝑘 ( 𝜇 𝑡 𝑘 ) -𝜂 ∇ 𝜇 𝑡 𝑘,𝑡 , ∀ 𝑡 ≤ 𝜏 𝜋 , such that -˝ 𝜏 𝜋 𝑡 = 1 ∇ 𝜇 𝑘,𝑡 ≤ 1 𝜂 GLYPH<16> ∇ ℎ 𝑘 ( 𝜇 𝜏 𝜋 + 1 𝑘 ) - ∇ ℎ 𝑘 ( 𝜇 1 𝑘 ) GLYPH<17> . Combing with the inequality in (30), we obtain as required. ■ Let us denote the random variable 𝛾 𝑡 to be the type of the request at period 𝑡 , which can determine the sample of the request. Proposition 3. Using a constant step-size rule 𝜂 > 0 for 𝑡 > 1 in Algorithm 1, it holds Proof. According to the definition of ∇ 𝝁 𝑡 and the subgradient inequality, we have (∇ 𝝁 𝑡 ) 𝑇 ( 𝝁 𝑡 - 𝝁 ) ≥ 𝐷 ( 𝝁 𝑡 ) - 𝐷 ( 𝝁 ) « ‹ where 𝜑 ( 𝝁 ) = 𝑓 ∗ ( 𝝁 ) -𝝁 𝑇 𝑔 ( 𝒙 𝑡 ) . Considering that 𝒙 𝑡 is an optimal solution of 𝜑 ( 𝝁 𝑡 ) not of 𝜑 ( 𝝁 ) , we have 𝑓 ( 𝒙 𝑡 ) -𝝁 𝑇 𝑔 ( 𝒙 𝑡 ) ≤ 𝜑 ( 𝝁 ) . Then, by taking 𝝁 = [ 0 , 0 , . . . , 0 ] , and summing from one to 𝜏 𝜋 , we obtain where ¯ 𝝁 𝜏 𝜋 = ˝ 𝜏𝜋 𝑡 = 1 𝝁 𝑡 𝜏 𝜋 and the inequality is based on the fact that the dual function is convex. In this paper, we adopt 𝜃 -strongly convex function as the relation function ℎ (·) in mirror descents. According to Step. 2 of Proposition 8 in [25], we have Combining (36) with (35), we get According to Step. 3 of Proposition 8 in [25], we have Combining (37) and (38), we complete the proof of Proposition 3. ■ Before providing more details on the proof of regret bound, we introduce a new benchmark of problem P 0 as in [25] due to that problem P 0 may be infeasible due the presence of both lower and upper exposure constraints. Specifically, we define where 𝜆 ∈ [ 0 , 1 ] is the interpolation parameter. We define where S 𝑇 : = S × · · · × S is a product distribution of length 𝑇 . Now we give the definition of the new benchmark as This benchmark is an interpolate value between the expected optimal value of problem P 0 and a deterministic problem which replaces the varying utility values 𝑓 ( 𝒙 𝑡 ) and cost values 𝑔 ( 𝒙 𝑡 ) with their expected values. For this benchmark, we have where the inequality uses the fact that OPT (S) ≤ 𝐷 ( 𝝁 |S) according to Proposition 1 in [25]and that OPT (S) ≤ 𝑇 ¯ 𝑓 . Combining all findings together, we have where the first inequality is from (40) and the second inequality is from Proposition 2 and Proposition 3. Therefore, the constants in Theorem 1 are 𝐶 1 = ¯ 𝑔 𝐺 , 𝐶 2 = 2 ( ¯ 𝐶 2 + ¯ 𝑏 2 ) 𝜃 𝜂 , and 𝐶 3 = 𝑉 ℎ ( 𝝁 , 𝝁 1 ) + ¯ 𝑔 𝐺 + 𝐶 ℎ +∥∇ ℎ ( 𝜆 1 ) ∥∞ 𝐺 , respectively. Moreover, recall Remark 1, we choose ℎ ( 𝜆 ) : = 1 2 ∥ 𝜆 ∥ 2 and dual iterates are bounded. Hence, we complete the proof of Theorem 1. ■", "B PROOF OF COST FEASIBILITY": "Proposition 1 shows that a solution obtained using Algorithm 1 can not overspend, but may underspend. Based on the definition of subgradient ∇ 𝜇 𝑡 𝑘 , we have Now, given that ✶ ( 𝜇 ≥ 0 ) + 𝛼 𝑘 ✶ ( 𝜇 < 0 ) ≥ 𝛼 𝑘 for any 𝜇 ∈ R and that 𝜏 𝜋 ≤ 𝑇 by definition, we have where the second inequality comes from Proposition 2."}
