{
  "Personalized News Recommendation: Methods and Challenges": "CHUHAN WU, Department of Electronic Engineering & BNRist, Tsinghua University, China FANGZHAO WU ∗ , Microsoft Research Asia, China YONGFENG HUANG, Department of Electronic Engineering & BNRist, Tsinghua University, China XING XIE, Microsoft Research Asia, China Personalized news recommendation is important for users to find interested news information and alleviate information overload. Although it has been extensively studied over decades and has achieved notable success in improving user experience, there are still many problems and challenges that need to be further studied. To help researchers master the advances in personalized news recommendation, in this paper we present a comprehensive overview of personalized news recommendation. Instead of following the conventional taxonomy of news recommendation methods, in this paper we propose a novel perspective to understand personalized news recommendation based on its core problems and the associated techniques and challenges. We first review the techniques for tackling each core problem in a personalized news recommender system and the challenges they face. Next, we introduce the public datasets and evaluation methods for personalized news recommendation. We then discuss the key points on improving the responsibility of personalized news recommender systems. Finally, we raise several research directions that are worth investigating in the future. This paper can provide up-to-date and comprehensive views on personalized news recommendation. We hope this paper can facilitate research on personalized news recommendation as well as related fields in natural language processing and data mining. CCSConcepts: · Informationsystems → Recommendersystems ; Personalization ; · Computingmethodologies → Natural language processing . Additional Key Words and Phrases: news recommendation, personalization, survey, user modeling, natural language processing",
  "ACMReference Format:": "Chuhan Wu, Fangzhao Wu, Yongfeng Huang, and Xing Xie. 2021. Personalized News Recommendation: Methods and Challenges. 1, 1 (February 2021), 49 pages. https://doi.org/10.1145/nnnnnnn.nnnnnnn",
  "1 INTRODUCTION": "In the era of the Internet, online news distributing platforms such as Microsoft News 1 have attracted hundreds of millions of users [223]. Due to the convenience and timeliness of online news services, many users have shifted their news reading habits from conventional newspapers to digital news ∗ Corresponding Author 1 https://microsoftnews.msn.com Authors' addresses: Chuhan Wu, Department of Electronic Engineering & BNRist, Tsinghua University, Beijing, 100084, China, wuchuhan15@gmail.com; Fangzhao Wu, Microsoft Research Asia, Beijing, China, 100080, wufangzhao@gmail.com; Yongfeng Huang, Department of Electronic Engineering & BNRist, Tsinghua University, Beijing, 100084, China, yfhuang@ tsinghua.edu.cn; Xing Xie, Microsoft Research Asia, Beijing, China, 100080, xingx@microsoft.com. Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. © 2021 Association for Computing Machinery. XXXX-XXXX/2021/2-ART $15.00 https://doi.org/10.1145/nnnnnnn.nnnnnnn , Vol. 1, No. 1, Article . Publication date: February 2021. 2 Wu et al. Fig. 1. An example workflow of personalized news recommender systems. … User Behaviors Personalized News Recommender … ③ Ranking ④ Display User ① Visit ② Recall News Platform ⑤ Update Candidate News News Pool User Profile Top K News NEWS content [144]. However, a large number of news articles are created and published every day, and it is impossible for users to browse through all available news to seek their interested news information [204]. Thus, personalized news recommendation techniques, which aim to select news according to users' personal interest, are critical for news platforms to help users alleviate their information overload of users and improve news reading experience [113]. Researches on personalized news recommendation have also attracted increasing attention from both academia and industry in recent years [144, 203]. An example workflow of personalized news recommender system is shown in Fig. 1. When a user visits the news platform, the news platform will recall a small set of candidate news from a large-scale news pool, and the personalized news recommender will rank these candidate news articles according to the user interests inferred from user profiles. Then, the top K ranked news will be displayed to the user, and the user behaviors on these news will be recorded by the platform to update the maintained user profile for providing future services. Although many prior works have extensively studied these problems in different aspects, personalized news recommendation remains challenging. For example, news articles on news websites usually have short life cycles. Many new articles emerge every day, and old ones will expire after a short period of time. Thus, news recommendation faces a severe cold-start problem. In addition, news articles usually contain rich textual information such as title and body. Thus, it is very important to understand news content from their texts with advanced natural language processing techniques. Moreover, there is usually no explicit user feedback such as reviews and ratings on news platforms. Thus, we need to infer the personal interests of users from their implicit feedback like clicks. However, user interests are usually diverse and dynamic, which poses great challenges to user modeling algorithms. The complexity of personalized news recommendation makes it a fascinating research topic with various challenges to be tackled [42]. A comprehensive overview of existing personalized news recommendation approaches can provide useful guidance for future research in this field. Over the past years, there are many survey papers that review the techniques of news recommendation [8, 10, 38-40, 42, 64, 87, 110, , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 3 Table 1. The taxonomy and literature coverage of recent survey papers. Traditional taxonomy means the collaborative, content-based, and hybrid categories. DL stands for deep learning. 113, 146, 162, 181]. For example, Li et al. [113] reviewed the personalized news recommendation methods based on handcrafted features to build news and user representations. They covered many traditional feature-based methods, including collaborative filtering (CF) based ones that use the IDs of users and news, content-based ones that use features extracted from the content of news and the user behaviors on news, and hybrid ones that rely on content-based collaborative filtering. They also studied the datasets used by these methods and their techniques for user and news representation construction, data processing and user privacy protection. Feng et al. [42] reviewed news recommendation approaches in many different scenarios including personalized and non-personalized ones. For personalized news recommendation methods, they also classify them into three categories, i.e., CF-based, content-based, and hybrid. They mainly studied the techniques adopted by different methods, the challenges they tackled, and the datasets and metrics for evaluation. We summarize the taxonomy of news recommendation methods and the literature coverage of several recent survey articles in Table 1. We find that most surveys mainly focus on traditional feature-based methods and only a small part of deep learning-based methods are covered by a few recent surveys, which is not beneficial for researchers to track recent advances in the personalized news recommendation field. In addition, most surveys follow the canonical taxonomy that categorizes news recommendation methods based on whether they rely on collaborative or content-based filtering techniques. However, it is difficult for this taxonomy to distinguish between traditional methods and recent deep learning-based approaches. In addition, the hybrid category contains methods based on quite diverse techniques, e.g., traditional CF-enhanced content matching and graph neural network, which is not beneficial for researchers to be aware of the evolution of news recommendation technologies. Moreover, several key techniques in news recommender system design, such as ranking and model training, are rarely discussed in this paradigm. Thus, the conventional taxonomy used by most existing surveys cannot meet the development of this field, and a more systematic taxonomy of existing news recommendation methods is needed to help understand their characteristics and inspire further research. In this paper, we present a comprehensive review of the personalized news recommendation field. Instead of reviewing existing personalized news recommendation methods based on the conventional taxonomy, in this survey we propose a novel perspective to review them based on the core problems involved in personalized news recommendation and the associated techniques and challenges. We first introduce the framework of developing a personalized news recommender system in Section 2. Next, we systematically review the core problems, techniques and challenges in personalized news recommendation, including: news modeling, user modeling, personalized ranking, model training, datasets, benchmarks and evaluation, which are introduced in Sections 3-7, , Vol. 1, No. 1, Article . Publication date: February 2021. 4 Wu et al. Fig. 2. A framework of the key components in developing personalized news recommendation model. User Profile … User News User Model News Model User Representation News Representation Ranking Objective Training Ranking Results Evaluation Model Data Accuracy Responsibility NEWS NEWS NFL andemicVirus Covia Pet ootball ection NFWS NEWS NEWS NFWS NEWS NEWS respectively. Through our proposed framework, the characteristics of existing approaches can be more accurately described than using conventional taxonomy, and it is easier for researchers to track the technology evolution in different aspects. We then present some discussions on developing responsible news recommender systems in Section 9, which is an emerging research field in recent years. Finally, we raise several potential future directions and conclude this paper in Section 10.",
  "2 FRAMEWORK OF PERSONALIZED NEWS RECOMMENDATION": "Personalized news recommendation techniques have been widely used in many online news websites [144, 223]. Different from non-personalized news recommendation methods that suggest news articles solely based on non-personalized factors [100] such as news popularity [27, 127, 130, 227], editors' demonstration [199] and geographic information [21, 178], personalized news recommendation can consider the personal interest of each individual user to provide personalized news services and better satisfy users' need. Existing surveys on personalized news recommendation usually classify methods into three categories, i.e., collaborative filtering-based, content-based and hybrid [113]. However, this taxonomy cannot adapt to the recent advances in news recommendation because many methods with diverse characteristics fall in the same category without distinguishment. For example, the category of content-based methods includes traditional semantic-based methods, contextual bandit-based methods and recent deep learning-based methods, which is difficult to characterize the paradigm , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 5 and technical evolution of personalized news recommendation. Thus, a more systematic overview of existing techniques is required to help understand the development of this field. Instead of following the conventional taxonomy, in this survey we propose a novel perspective to review existing personalized news recommendation techniques based on the core problems involved in the development of a personalized news recommender system. A common framework of personalized news recommendation model development is shown in Fig. 2. We can see that there are several key problems in this framework. First, news modeling is the backbone of news recommendation and a core problem is how to understand the content and characteristics of news. In addition, user modeling is required to understand the personal interest of users in news, and it is critical to accurately infer user interest from user profiles like behaviors. Based on the news and user representations built by the news and user models, the next step is ranking candidate news according to certain policies such as the relevance between news and user interest. Then, it is important to train the recommendation model with proper objectives to make high-quality news recommendations, and evaluating the ranking results given by the recommendation model is also a core problem in the development of personalized recommender systems. Besides, the datasets and benchmarks for news recommendation are also necessities in designing personalized news recommendation models. Moreover, beyond developing accurate models, improving the responsibility of intelligent systems has been a spotlight problem in recent years. How to develop responsible news recommender systems is a less studied but extremely important problem in personalized news recommendation. Next, we briefly discuss the key problems mentioned above in the following sections.",
  "2.1 News Modeling": "News modeling aims to understand the characteristics and content of news, which is the backbone of news recommendation. There are mainly two kinds of techniques for news modeling, i.e., featurebased news modeling and deep learning-based news modeling. Feature-based news modeling methods usually rely on handcrafted features to represent news articles. For instance, in many methods based on collaborative filtering (CF), news articles are represented by their IDs [29, 168]. However, on most news websites novel news articles are published continuously and old ones soon vanish. Thus, representing news articles with their IDs will suffer from severe cold-start problems, and the performance is usually suboptimal. Considering the drawbacks of ID-based news modeling methods, most approaches incorporate content features to represent news. Among them, many methods use features extracted from news texts for news modeling. For instance, Capelle et al. [16] proposed to represent news with Synset Frequency-Inverse Document Frequency (SF-IDF), which uses WordNet synonym set to replace the term frequencies in TF-IDF. Besides the news texts, many methods also explore to incorporate various factors that may have influence on users' news browsing decisions into news modeling, such as news popularity and recency [109]. However, in these methods, the features to represent news are usually manually designed, which usually requires much effort and domain knowledge. In addition, handcrafted features are usually not optimal in representing the semantic information encoded in news texts. With the development of natural language processing techniques in recent years, many methods employ neural NLP models to learn deep representations of news. For example, Okura et al. [144] proposed to use autoencoders to learn news representations from news content. Wang et al. [197] proposed to use a knowledge-aware convolutional neural network (CNN) to learn news representations from news titles and their entities. Wu et al. [207] proposed to learn news representations from news titles via a combination of multi-head self-attention and additive attention networks. Wu et al. [214] studied to use pre-trained language models to encode news texts. These deep , Vol. 1, No. 1, Article . Publication date: February 2021. 6 Wu et al. learning-based news modeling methods can automatically learn informative news representations without heavy effort on manual feature engineering, and they can usually better understand news content than traditional feature-based methods.",
  "2.2 User Modeling": "User modeling techniques in news recommendation aim to understand users' personal interest in news. Similar to news modeling, user modeling methods can also be roughly classified into two categories, i.e., feature-based and deep learning-based. Some feature-based methods like CF represent users with their IDs [29, 168]. However, they usually suffer from the sparsity of user data and cannot model user interest accurately. Thus, most feature-based methods consider other user information such as click behaviors on news. For example, Garcin et al. [52] proposed to use Latent Dirichlet Allocation (LDA) to extract topics from the concatenation of news title, summary and body. The topic vectors of all clicked news are further aggregated into a user vector by averaging. There are also several works that explore to incorporate other user features into user modeling, such as demographics [104], location [43] and access patterns [109]. However, feature-based user modeling methods also require an enormous amount of domain knowledge to design informative user features in specific scenarios, and they are usually suboptimal in representing user interests. There are several methods that use neural networks to learn user representations from users' click behaviors. For example, Okura et al. [144] proposed to use a GRU network to learn user representations from clicked news. Wu et al. [204] proposed a personalized attention network to learn user representations from clicked news in a personalized manner. Qi et al. [160] proposed a hierarchical user interest representation method to model the hierarchical structure of user interest. These methods can automatically learn deep interest representations of users for personalized news recommendation, which are usually more accurate than handcrafted user interest features.",
  "2.3 Personalized Ranking": "On the basis of news and user interest modeling, the next step is ranking candidate news in a personalized way according to user interest. Most methods rank news based on their relevance to user interest, and how to accurately measure the relevance between user interest and candidate news is their core problem. Some methods measure the user-news relevance based on their representations. For example, Goossen et al. [58] proposed to compute the cosine similarity between the Concept Frequency-Inverse Document Frequency (CF-IDF) features extracted from candidate news and clicked news, which was further used for personalized candidate news ranking. Okura et al. [144] used the inner product between news and user embeddings to compute the click scores, and ranked candidate news based on these scores. Gershman et al. [55] proposed to use an SVM model for each individual user to classify whether this user will click a candidate news based on news and user interest features. In several recent methods, the relevance between candidate news and user interest is modeled in a fine-grained way by matching candidate news with clicked news. For example, Wang et al. [196] proposed to match candidate news and clicked news with a 3-D convolutional neural network to mine the fine-grained relatedness between their content. However, ranking candidate news and user interest merely based on their relevance may recommend news that are similar to those previously clicked by users [160], which may cause the 'filter bubble' problem. Afew methods use reinforcement learning for personalized ranking. Li et al. [106] first explore to model the personalized news recommendation task as a contextual bandit problem. They proposed a LinUCB approach that computes the upper confidence bound (UCB) of each arm efficiently in closed form based on a linear payoff model, which can match news with users' personal interest and meanwhile explore making diverse recommendations. DRN [244] uses a deep reinforcement learning approach to find the interest matching policy that optimizes the long-term reward. In , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 7 addition, it uses a Dueling Bandit Gradient Descent (DBGD) method for exploration. These methods usually optimize the long-term reward rather than the current click probability, which has the potential to alleviate the filter bubble problem by exploring more diverse user interest.",
  "2.4 Model Training": "Many personalized news recommendation methods employ machine learning models for news modeling, user modeling and interest matching. How to train these models to make accurate recommendations is a critical problem. A few methods train their models by predicting the ratings on news given by users. For example, the Grouplens [168] system is trained by predicting the unknown ratings in the user-news matrix. However, explicit feedback such as ratings is usually sparse on news platforms. Thus, most existing methods use implicit feedback like clicks to construct prediction targets for model training. For example, Wang et al. [197] formulated the news click prediction problem as a binary classification task, and use crossentropy as the loss function for model training. Wu et al. [204] proposed to employ negative sampling techniques that combine each positive sample with several negative samples to construct labeled samples for model training. However, click feedback usually contains heavy noise and may not indicate user interest, which poses great challenges to learning accurate recommendation models. There are only a few methods that consider user feedback beyond click signals [213, 215]. For example, Wu et al. [213] proposed to model click preference with click feedback and model reading satisfaction based on the personalized reading speed of users, and train the recommendation model to predict both clicks and user satisfaction. By optimizing objectives beyond news clicks, these methods are aware of user engagement information and thereby can better understand user interest. In addition, these methods have the potential to recommend news articles that are not only clicked by users, but also indeed satisfy their information needs. Thus, designing engagementaware training objectives is useful for news recommender systems to provide high-quality news suggestions.",
  "2.5 Evaluation": "Properly evaluating the performance of personalized news recommendation algorithms is important for developing real-world news recommender systems. Most existing methods use click-related metrics to measure the accuracy of recommendation results. Some of them regard the recommendation task as a classification problem [70, 116, 197], where the performance is evaluated by classification metrics such as Area Under Curve (AUC) and F1-score. Many other methods use ranking metrics such as Mean Reciprocal Rank (MRR) and normalized Discounted Cummulative Gain (nDCG). However, click-based metrics may not indicate user experience. Thus, a few works explore to use user engagement-based metrics to evaluate the recommendation performance [215], such as dwell time and dislike, which can evaluate the performance of recommendation models more comprehensively. In most works, the performance of recommendation models is offline evaluated. However, the data used for offline evaluation is usually influenced by the recommendation results generated by the predecessor recommendation algorithms, and the real user feedback on recommendation results cannot be obtained. Only a few works reported online evaluation results [214], which may better indicate the real performance of the recommender systems. To fill the gaps between offline and online experiments, one prior study [107] proposed an unbiased evaluation method of contextual bandit-based news recommendation methods. However, there still lacks a general method that can offline evaluate the potentials of various news recommender algorithms in online environments. , Vol. 1, No. 1, Article . Publication date: February 2021. 8 Wu et al.",
  "2.6 Dataset and Benchmark": "Publicly available datasets are important for facilitating researches in the corresponding fields as well as benchmarking their results and findings. However, in the personalized news recommendation field most researches are conducted on proprietary datasets collected from different news platforms, such as Google News, Microsoft News, Yahoo News, Bing News, etc. There are only a few datasets that are publicly available for news recommendation research. Several representative datasets such as plista [91], Adressa [61] and MIND [223] are widely used by recent studies. The plista dataset is a German news dataset. A newer version of this dataset is published by the CLEF 2017 NewsREEL [126] task, and a competition is held based on this data to train and evaluate news recommender systems. Adressa is a Norwegian dataset that contains not only click information, but also the dwell time of users and rich context information of users and news. MIND is a large-scale English news recommendation dataset with raw textual information of news. In addition, MIND is associated with a public leaderboard and an open competition, which can fairly compare the performance of different algorithms. Thus, many recent researches are conducted on the MIND dataset [210, 214, 218].",
  "2.7 Responsible News Recommendation": "Most endeavors on personalized news recommendation focus on improving the accuracy of recommendation results. In recent years, research on the responsibility of machine intelligent systems has gained high attention to help AI techniques better serve humans and avoid their risky and even harmful behaviors that can lead to negative societal impacts and unethical consequences [36]. There are many aspects to improve the responsibility of personalized news recommender systems [5]. For example, since many news recommendation methods are learned on private user data, it is important to protect user privacy in recommendation model training and online serving [159]. Federated learning [137] is a privacy-aware machine learning paradigm, which can empower the construction of privacy-preserving news recommender systems. Besides optimizing news recommendation accuracy, it is also important to promote the diversity of news recommendation results, which can satisfy users' needs on information variety and alleviate the filter bubble problem [65, 164, 166, 212]. Moreover, fairness is a critical aspect of responsible news recommendation, since the recommendation models learned on biased user data may inherit unwanted biases, which may lead to the prejudice of algorithms and further unfair recommendation results. To mitigate the unfairness issue of news recommendation methods, fairness-aware machine learning techniques [221] can help build inclusive and fair algorithms to provide high-quality news recommendation services to different groups of users. These research fields on responsible news recommendation emerging in recent years have the potential to improve the quality of news recommender systems to serve users in a more responsible way. However, there lacks a systematic review on responsible news recommendation in existing survey papers. In this survey, we first give a comprehensive review on the frontiers of responsible news recommendation research. Given the overview above, we then present in-depth discussions on each mentioned core problem in the following sections.",
  "3 NEWS MODELING": "News modeling is a critical step in personalized news recommendation methods to capture the characteristics of news articles and understand their content. The techniques for news modeling can be roughly divided into two categories, i.e., feature-based and deep learning-based. For featurebased methods, news articles are mainly represented by handcrafted features, while deep learningbased methods mainly aim to learn hidden news representations from the raw inputs. Note that , Vol. 1, No. 1, Article . Publication date: February 2021. Fig. 3. An overview of different types of news features. Personalized News Recommendation: Methods and Challenges 9 Semantic Content Feature Property Feature Context Feature Topic Model Entity Keyword Multimodal Emotion Category Cluster Location Publisher Popularity CTR Recency Novelty Extracted from news content Intrinsic or static property Dynamic information Dwell Time Bias Publish Time CF Feature News ID User ID Collaborative filtering signal User/News Graph although a few methods may employ some deep learning methods like multi-layer perceptrons to model interactions between sophisticated handcrafted features, we still categorize them into feature-based ones because their news representations are not learned from scratch. In addition, some deep learning-based methods may involve some efforts in feature engineering. Since their news representation methods mainly focus on incorporating additional features to enhance deep representations learned from scratch, we still put them into the deep learning-based category. The details of the two types of news modeling methods are as introduced follows.",
  "3.1 Feature-based News Modeling": "Designing informative features to represent news articles is the key problem in feature-based news modeling methods. As summarized in Fig. 2, there are mainly four types of features used in news modeling, which are introduced as follows. In many CF-based methods, news articles are represented by collaborative filtering signals such as news IDs [29, 62, 78, 141, 168, 172, 225]. However, on most news websites novel news are published quickly and old ones will soon vanish. These methods model news in a content-agnostic manner, which may suffer from the serious cold start problem due to the difficulty in processing newly generated news. Thus, it is not suitable to simply represent news articles with their IDs [37]. Due to the drawbacks of ID-based news modeling, many methods incorporate news content into news modeling. For instance, Gershman et al. [55] considered Term Frequency-Inverse Document Frequency (TF-IDF) features extracted from news texts. In news articles, entities/concepts are usually more important than other words in understanding news content. Thus, many methods use the entities/concepts in news texts to represent their content. For example, Goossen et al. [58] proposed to use Concept Frequency-Inverse Document Frequency (CF-IDF) to model news content, which is a variant of TF-IDF that uses the frequency of concepts extracted from WordNet rather than term frequency. Capelle et al. [16] proposed to use Synset Frequency-Inverse Document Frequency (SF-IDF) to model news, which is based on the frequency of synonym sets in WordNet. SF-IDF is extended by Moerland et al. [140] into SF-IDF+ by additionally considering the relationships of concepts. They extend the synonym sets of concepts in news by adding other concepts in WordNet that have relationships with the included concepts. Based on aforementioned approaches, the family of CF-IDF is expanded by a set of later works [11, 18, 30, 67, 68]. Besides semantic features, some works explore to extract other kinds of content features to enhance modeling [104, 109, 147]. For example, Garcin et al. [52] proposed to use Latent Dirichlet Allocation (LDA) to extract topics from the concatenation of news title, summary and main content. Parizi et al. [147] proposed to extract emotion features of sentences in news as complementary information of TF-IDF features. In their method, the emotion is represented by the Ekman model that contains 6 emotion categories. A variant of this method that uses the sentiment orientation (i.e., positive, neutral and negative) is also developed by Parizi et al. [148]. Beyond news texts, the , Vol. 1, No. 1, Article . Publication date: February 2021. 10 Wu et al. Table 2. Main features used for news representation. *XF-IDF means TF-IDF and its variants such as CF-IDF and SF-IDF. exploitation of vision-related information such as the videos of news is also studied in [131]. These features can provide complementary information to better understand news content. In addition to content features, many other genres of features are used for news modeling. They can be roughly divided into two categories, i.e., property features and context features. Property features such as categories, locations and publishers usually reflect intrinsic properties of news. The most widely used news property feature is category, since it is an important clue for modeling news content and targeting user interest. For example, Liu et al. [122] proposed to represent news using their topic categories. However, since the category labels of news often need to be manually annotated by editors, in some scenarios news may not have off-the-shelf category labels, Thus, several methods explore to cluster news into categories based on their content. For instance, in the SCENE [109] recommender system, news articles are clustered in a hierarchical manner based on their topic features extracted by LDA. By incorporating the categories or clusters of news into news modeling, the news recommender can be aware of news topics and provide more targeted recommendation services. Another representative property feature is news location, which is also widely used to provide users with the news related to the locations that they are interested in. For example, Tavakolifard et al. [187] incorporated the geographic information of news to filter news based on their locations. In addition, since news from different publishers may have differences in their content and topics, the information of news publisher is also considered by several methods to enrich the information for news modeling [75, 117]. Different from property features that are usually static after news publishing, context features of news are dynamic. Popularity and recency, which reflect the attractiveness and freshness of news, are two representative context features used by existing methods. For instance, MONERS [104] is a news recommender system that represents news articles by news categories, news importance suggested by providers and the recency of news articles. Gershman et al. [55] proposed to use four kinds of features to represent news, i.e., news popularity, news age (recency), TF-IDF features , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 11 of words and named entities. Jonnalagedda et al. [82] proposed to use the timeline on Twitter to enhance news modeling. They use the popularity and categories of news on Twitter for news representation. News recency only considers the time interval between the publishing and display of news, while time stamp of news display can provide finer-grained information, such as seasons, months, days and the time in a day. Thus, several approaches incorporate the time stamp of news impression [25, 41, 43, 75, 225]. For example, Ilievski et al. [75] proposed to incorporate the weekday and the hour of a news impression in news modeling. In addition to the context features mentioned above, several methods also explore to use weather [229], click-through rate (CTR) [25], and fact/opinion bias [150] to enrich the representations of news. Some hybrid methods consider both news IDs and additional features in news modeling [125]. For example, NewsWeeder [99] represents news articles by their IDs and bag-of-word features. Claypool et al. [26] proposed to use news IDs and keywords to model news. Liu et al. [122] proposed to represent news using their IDs and topic categories. Saranya et al. [171] proposed to represent news by their IDs, topics, click frequency and the weights of a news belonging to different categories. Using the combination of ID-based and content-based news modeling techniques can mitigate the cold-start problem of news to some extent, and have been widely explored by integrating other information like news property features [28, 202], news sessions [182], ontology [15, 48, 142, 163, 173] and knowledge graphs [236]. To draw a big picture of feature-based news modeling methods, we summarize the major features they used in Table 2.",
  "3.2 Deep learning-based News Modeling": "With the development of deep learning techniques, in recent years many methods employ neural networks to automatically learn news representations. Instead of using handcrafted features like TF-IDF to represent news content, most of them use neural NLP techniques to learn news representations from news texts. For example, Okura et al. [144] proposed an embedding-based news recommendation (EBNR) method that uses a variant of denoising autoencoders to learn news representations from news texts. RA-DSSM [96] is a neural news recommendation approach which incorporates a similar architecture as DSSM [72]. It first builds the representations of news using the doc2vec [102] tool, then uses a two-layer neural network to learn hidden news representations. This method is also adopted by [97]. 3-D-CNN [98] represents news by the word2vec [139] embeddings of their words, which is further considered by [242]. However, it is difficult for these methods to mine the semantic information in news texts with traditional neural NLP models. Many later approaches use more advanced neural NLP models for text modeling, such as CNN [196, 239] and self-attention [207]. For instance, WE3CN [90] uses 2D CNN models to learn representations of news. NPA [204] uses CNN to generate contextual representations of words in news titles, and use a personalized attention network to form news representations by selecting important words in a personalized manner. NRMS [207] learns word representations with a multi-head self-attention network, and uses an additive attention network to form news representations. Similar news modeling method is also used by many later works [212, 213, 215, 218, 221]. NRNF [209] uses self-attention to model the contexts of words in news title and body, and it uses an interactive attention network to model the relatedness between title and body. A similar co-attention mechanism is used by [136] to model the interactions between news title and abstract. FedRec [158] learns news representations from news titles via a combination of CNN and multi-head self-attention networks. These methods usually learn news representations based on shallow text models and non-contextualized word embeddings such as GloVe [151], which may be insufficient to capture the deep semantic information in news. WG4Rec [176] introduces a word-graph based news text modeling method. It constructs a word graph based on semantic similarity, co-occurrence and , Vol. 1, No. 1, Article . Publication date: February 2021. 12 Wu et al. news co-click, and learns word embeddings through a GNN model. These methods can enhance news text understanding with various neural architectures. However, these models are still rather shallow and may not be strong enough in capturing the deep semantic information in news texts. In recent years, big and powerful pre-trained language models (PLMs) such as BERT [34] have been greatly successful in NLP, and a few recent works explore to empower news modeling with PLMs [81, 165, 214, 222, 224, 231, 240, 241]. For example, PLM-NR [214] uses different PLMs to empower English and multilingual news recommendation, and the online flight results in Microsoft News showed notable performance improvement. UNBERT [241] incorporates the concatenation of news texts as the input of a BERT model. The findings in these works imply the effectiveness of large PLMs in empowering text understanding in news recommendation. Instead of merely modeling semantic information in news texts, several methods study to use entities or keywords in news texts to enhance news modeling by introducing complementary knowledge and commonsense information. A direct way is regarding entities as texts and combining them with news text modeling [79]. For instance, Gao et al. [49] proposed a knowledge-aware news recommendation approach with hierarchical attention networks. In their method, a word attention network is used to learn word-based news representations by using the embeddings of keywords as attention queries, and these representations are concatenated with both entity embeddings and the average embeddings of the entities in their contexts. An item attention network is used to aggregate these three kinds of news representations by modeling their informativeness. DAN [248] learns news representations from news titles and entities via two parallel CNN networks with max pooling operations. Saskr [24] builds news representations from news titles and bodies based on the average word embeddings of their entities. DNA [235] learns news representations from the news body, news ID and the elements (entities and keywords). More specifically, the sentences in a news body are transformed into their embeddings via doc2vec [102], and then are aggregated into a unified one via a sentence-level candidate-aware attention network. Each news element is represented by averaging the embeddings of its words, and elements representations are synthesized together via an element-level candidate-aware attention network. The embeddings of the ID, texts, and elements of each piece of news are concatenated together into a unified news representation. HieRec [160] uses text self-attention and entity self-attention to model the contexts in news titles and the relations between entities in news texts, respectively. These methods can easily unify the use of texts and knowledge entities, but they cannot effectively exploit the relatedness between entities. Another way to exploit entity information is incorporating knowledge graph embeddings [119, 175, 185, 190, 197]. For example, DKN [197] learns news representations from the titles of news and the entities within titles via a knowledge-aware CNN. The representations of entities are learned from a knowledge graph using the TransD [77] knowledge graph embedding algorithm. Liu et al. [119] proposed to construct a news-relevant knowledge graph on the basis of the Microsoft Satori knowledge graph by extracting additional knowledge entities and topic entities from news and connecting entities in the same news, entities clicked by the same user and entities appearing in the same browsing session to enrich the relations between entities in the knowledge graph. They combine the entity embeddings learned by TransE [9] with the news text embeddings learned by LDA and DSSM. CAGE [174, 175] constructs subgraphs of KG by using one-hop neighbors of entities, and uses the TransE embeddings of entities as complements to text embeddings learned by CNN. However, these knowledge graph embeddings mainly condense low-level interactions between entities. To enhance the modeling of rich entity relatedness, TEKGR [103] enriches the knowledge graph with topical relations between entities. It predicts the topic of news based on texts and concepts, and uses the predicted topic to enrich the knowledge graph and learn topic enriched knowledge representations of news with graph neural networks. KRED [121] first learns entity , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 13 embeddings from knowledge graph with graph attention networks, then incorporates additional entity features such as frequency, category and position, and finally selects entities according to the texts representations of news. KIM [156] incorporates a knowledge-aware interactive news modeling method that can model the relations between the entities and their neighbors of clicked news and candidate news through graph co-attention networks. KOPRA [188] only uses the TransE embeddings of knowledge entities to represent news, and it uses a recurrent graph convolution network to learn hidden entity representations. These methods can encode richer knowledge information of news than pure text-based methods to empower news recommendation. To better model the characteristics of news articles, several methods explore to incorporate other types of news information beyond texts into news modeling. Among them, topic categories and tags are widely considered by existing methods [63, 149, 203, 205, 237]. For example, DeepJoNN [237] learns news representations from news IDs, categories, keywords and entities via a character-level CNN. Park et al. [149] proposed a neural news recommendation method based on LSTM. They use a proprietary corpus to train a doc2vec [102] model to encode news articles into their vector representations, and use an LSTM network to generate user representations from the representations of news. In addition, they incorporate the categories of news into news representations, which are predicted by a CNN [93] model. TANR [205] learns news representation from news titles via a combination of CNN and attention network, which is also used in [206, 230]. Moreover, TANR incorporates an auxiliary news topic prediction task to learn topic-aware news representations. NAML [203] is a news recommendation method with attentive multi-view learning, which incorporates different kinds of news information as different views of news. In this method, news titles, bodies, categories and subcategories are processed by different models, and their embeddings are further aggregated together into a unified one via a view-level attention network. A similar method is also used by [210, 243] to model candidate news. LSTUR [2] uses a combination of CNN and attention network to process news titles, and incorporates categories and subcategories by applying a non-linear transformation to their embeddings. CHAMELEON [31, 46] learns news representations from news bodies by using CNN with different kernel sizes, and these textual representations are fused with news metadata features such as topics, categories and tags using a fully connected layer. It also predicts the metadata features of news via auxiliary tasks. In addition to topical information, several methods consider other types of content information of news. For example, SentiRec [212] considers the sentiment orientation of news to learn sentimentaware news representations. It uses the VADER [73] algorithm to compute real-valued sentiment scores of news. MM-Rec [217] uses a visiolinguistic model ViLBERT [128] to learn news multi-modal representations from both news texts and images. IMRec [226] models the rich visual impression information of news such as texts, image regions, the arrangement of different fields, and spatial positions of different words on the impression. These methods can usually learn more accurate news representations by characterizing their content in multiple aspects. Another major group of additional information is context features, such as popularity and positions. For example, PP-Rec [157] uses both news title, entities and news popularity information in news modeling. It uses gating mechanisms to synthesize the near-real-time CTR, recency and popularity predicted from news title into a unified news popularity score. TSHGNN [80] incorporates the active time of users on a news page into the modeling of news texts. DCAN [138] uses the time from news publishing and near-real-time CTR to model the current positions of news articles in their lifecycles. CTX [23] studies the exploitation of CTR, Popularity, and Freshness features. The results show that these context features may even have a stronger impact than personalized interest signals on click prediction. DebiasRec [230] uses CNN and attention network to learn news content representations from news titles, and learns news bias representations from the size and positions of news displayed on websites with a bias model. These methods can usually better , Vol. 1, No. 1, Article . Publication date: February 2021. 14 Wu et al. understand users' interaction patterns with news by incorporating additional context information. However, some news features (e.g., near-real-time CTR) may not be available in some real-world news recommender systems, which hinders the exploitation of these features. There are a few methods that learn news representations from graphs. For example, IGNN [161] uses KCNN [197] to learn text-based news representations from news titles, and learn graph-based news representations from the user-news graph. GERL [53] learns news title representations with a combination of multi-head self-attention and additive attention networks, and combines title representations with the embeddings of news categories. MVL [170] uses a content view to incorporate news title, body and category, and uses a graph view to enhance news representations with their neighbors on the user-news graph. In addition, it uses a graph attention network to enhance representations of news by incorporating the information of their first- and second-order neighbors on the user-news graph. GNUD [71] uses the same news encoder as DAN to learn text-based news representations, and uses a graph convolution network (GCN) with a preference disentanglement regularization to learn disentangled news representations on user-news graphs. In addition to the user-news graphs used by the above methods, a few methods incorporate heterogeneous graphs that condense richer collaborative information [70, 133, 167]. For example, GNewsRec [70] is a hybrid approach which considers graph information of users and news as well as news topic categories. It also uses the same architecture with DAN to learn text-based news representations, and uses a two-layer graph neural network (GNN) to learn graph-based news representations from a heterogeneous user-news-topic graph. These methods can exploit the high-order information on graphs to enhance news modeling. However, it is difficult for these methods to handle newly generated news with few connections to existing nodes on the old graph used for training. To help better understand the relatedness and differences between the methods reviewed above, we summarize the information and models they used for learning news representations in Table 3. Next, we provide several discussions on the aforementioned methods for news modeling.",
  "3.3 Discussions on News Modeling": "3.3.1 Feature-based News Modeling. In feature-based news modeling methods, mining textual information of news is critical for representing news content. Many methods incorporate BOW/TFIDF features or their variants to represent news texts, which are also popular in the NLP field. In addition, topic models like LDA are employed by various methods to extract topics from texts. This is probably because topic models are capable of mining the topic distributions of news articles and can also provide useful clues for inferring user interest on different topics. Moreover, since users may focus more on the entities or keywords in news, they are considered by many methods to summarize the content and topic of news, and can also be useful links to find similar news or map news on knowledge graphs. Especially, some methods also use ontology such as Wikipedia to extract entity features to represent them more accurately. Besides the texts of news, many methods utilize other information of news. For instance, the categories or clusters of news are popular news features to help model news content. In addition, several dynamic features of news are also widely employed in feature-based news modeling methods, such as popularity and recency. Since many users may pay more attention to popular events and news usually vanish quickly, incorporating news popularity and recency can help build more informative news representations. Besides, several environmental factors, such as locations and time are also utilized by several methods. This is because considering locations of news can provide news related to users' neighbors, and using the timestamps of news may be useful for providing time-aware news services. , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 15 Table 3. Comparison of different methods on news modeling. , Vol. 1, No. 1, Article . Publication date: February 2021. 16 Wu et al. A few methods also study incorporating other interesting features. For example, the sentiment information of news is useful for news understanding, because users may have different tastes on the sentiment of news. The bias of news may also need to be taken into consideration, because recommending news with biased opinions and facts may hurt user experience and the reputation of news platforms. Finally, although several non-personalized news recommendation methods have used news images to build news representations [127], few personalized ones consider the visual information of news, which is very useful for news modeling. Although feature-based news modeling methods have comprehensive coverage of various news information, they usually require a large amount of domain knowledge for feature design. In addition, handcrafted features are usually not optimal in representing the textual content of news due to the absence of the contexts and orders of words. 3.3.2 Deep Learning-based News Modeling. Among all the reviewed methods, only two methods, i.e., DNA [235] and DeepJoNN [237], directly incorporate the embeddings of news IDs. This is probably because of the short lifecycle of news articles and the quick generation of novel news, which make the coverage of news IDs in the training set very limited. Thus, it is very important to understand news from their content. News text modeling is critical for news understanding. Most methods use news titles to model news since news titles, because news titles usually have decisive influence on users' click behaviors. Several methods such as EBNR [144], NAML [203] and CPRS [213] use news bodies to enhance news representations, since news bodies are contain more detailed information of news. In existing methods, CNN is the most frequently used architecture for text modeling. This is because local contexts in news articles are important for modeling news content, and CNN is effective and efficient in capturing local contexts. In addition, since different news information may have different informativeness in modeling news content and user interest, attention mechanisms are also widely used to build news representations by selecting important features. With the success of Transformer in NLP, many methods also use Transformer-like architectures for news modeling, such as NRMS [207] and CPRS [213]. In addition, a few methods use pre-trained language or and visiolinguistic models to empower news modeling [214, 217]. These advanced NLP techniques can greatly improve news content understanding, which is very important for personalized news recommendation. However, these methods mainly aim to capture the semantic information of news and may not be aware of the knowledge and commonsense information encoded in news. To address this issue, many methods incorporate news entities into news modeling to learn knowledge-aware news representations [120]. Some methods such as DAN [248] directly use entity texts to represent entities, while several other methods like DKN [197] use knowledge graph embeddings to represent entities. These entity representations are usually combined with representations learned from news texts to better model news content. However, there are many new entities and concepts emerging in news and it may be difficult to accurately represent them with off-the-shelf knowledge bases. Several methods incorporate the topic categories of news into news modeling, because news topics are very useful for understanding news content and inferring user interest. Considering the scenarios that some news articles are not labeled with topic categories, some methods such as TANR [205] and CHAMELEON [46] also adopt auxiliary tasks by predicting news topic categories to encode topic information into news representations. In addition, a few methods study using other kinds of news features such as sentiment [212], popularity [23], recency [157], which can help better understand the characteristics of news. However, some additional news features (e.g., category and CTR) may be unavailable in certain scenarios, which limits the application of these methods. , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 17 Fig. 4. An example framework of user modeling. Clicked News News Model News Model News Model User Model ... ... ... Target User Additional User Features User Representation There are also a few methods that explore to enhance news modeling with graph information [53, 70]. These methods can incorporate the high-order information on user-news bipartite graphs [53, 71, 161, 170] or more complicated heterogeneous graphs [70, 167], which can provide useful contexts on understanding the characteristics of news for news recommendation. However, since the graphs used in these methods are static, they may have some difficulties in accurately representing newly published news. In summary, by reviewing news modeling techniques used in existing news recommendation methods, we can see that news modeling is still a quite challenging problem in news recommendation due to the variety, dynamic, and timeliness of online news information.",
  "4 USER MODELING": "User modeling is also a critical step in personalized news recommender systems to infer users' personal interests in news. It is usually important for user modeling algorithms to understand users from their behaviors [205]. An example user modeling framework in personalized news recommendation is shown in Fig. 4. We can see that user modeling is based on the modeling of news that users have interactions with, and it introduces additional user features to achieve better personalized user understanding. The techniques for user modeling in existing news recommendation methods can also be classified into feature-based ones and deep learning-based ones. Feature-based user modeling techniques mainly rely on manually designed user modeling rules or heuristic patterns to represent user interest. By contrast, deep learning-based methods usually focus on automatically finding useful patterns from user behaviors to infer user interest. The details of the two kinds of user modeling methods are introduced in the following sections.",
  "4.1 Feature-based User Modeling": "Feature-based user modeling methods use handcrafted features to represent users. Similar to news modeling, in CF-based methods users are also represented by their IDs [29, 168]. However, ID-based user modeling methods usually suffer from the data sparsity. Thus, most methods consider the behaviors of users such as news clicks to model their interest. An intuitive way is to use the features of clicked news to build user features. For example, Goossen et al. [58] used the CF-IDF features of clicked news to represent user interest. Capelle et al. [16] proposed to use the SF-IDF features of clicked news for user modeling. Garcin et al. [52] proposed to model users by aggregating the , Vol. 1, No. 1, Article . Publication date: February 2021. 18 Wu et al. LDA features of all clicked news into a user vector by averaging. However, it is difficult for these methods to model users accurately when their news click behaviors are sparse. Besides news features, many methods consider other supplementary information of users in user modeling. For instance, in the MONERS [104] recommender system, users are clustered into segments, and the preferences of user segments on news categories and news articles are used to represent users. In addition, the demographics of users, such as age, gender and profession, are also useful information for user modeling because users in different demographic groups usually have different preferences on news. Thus, user demographic features are incorporated by several methods [75, 104, 229]. For instance, Yeung et al. [229] proposed to use the age, gender, occupation status and social economic grade of users to help identify their different preferences on news in different categories. Chu et al. [25] used the age and gender categories of users to model their characteristics. Besides, the location information of users is also very useful for accurate user modeling, and it has been used by several location-aware news recommendation methods [43, 143]. However, some kinds of user features such as locations and demographics are privacy-sensitive, and many users may not provide their accurate personal information. Since news clicks may not necessarily indicate user interests, several methods also consider other kinds of user behaviors or feedback. For example, Gershman et al. [55] proposed to represent users by the news they carefully read (regarded as positive news), rejected, and scrolled (both are regarded as negative news). In addition, users' dwell time on clicked news is also an important indication of user interest, and Yi et al. [232] studied to use dwell time as the weights of clicked news for user modeling. Besides these user behaviors, several other kinds of user behavior information such as access patterns, are utilized by a few methods [109, 171] to capture the users' habits on news reading. Several methods also consider graph information (e.g., news-user graphs) in user modeling [56]. For example, Li et al. [108] proposed a news personalization method by using hypergraph to model various high-order interactions between different news information, where users are represented by subgraphs of the hypergraph. Garcin et al. [50] proposed to use context trees for user modeling. They constructed context trees based on the sequence of articles, the sequence of topics and the distribution of topics. Trevisiol et al. [192] proposed to build a browsing graph from the news browsing histories of users on Yahoo News. Joseph et al. [84] proposed to represent users by regarding the clicked news as subgraphs of a knowledge graph, which are constructed via entity linking. These methods can consider the high-order information on graphs to help understand user behaviors, which can improve user modeling. A few methods combine user IDs with other user features in user modeling [125]. For example, NewsWeeder [99] used user IDs and the bag-of-words features of clicked news to represent users. Claypool et al. [26] used user IDs and keywords of clicked news for user modeling Liu et al. [122] proposed to represent users using their IDs and user interest features predicted by a Bayesian model. These methods can mitigate the drawbacks of ID-based user modeling and meanwhile incorporate useful personal information encoded by user IDs. Considering the evolutionary characteristics of user interest, some methods model both longterm and short-term user interests [15, 112]. NewsDude [7] may be one of the earliest methods that consider long short-term user interests. In this approach, users are represented by a hybrid model, which models short-term interest of users based on recently browsed news, and models long-term user interest by sorting words of news in each category with respect to their TF-IDF values and selecting the top ranked words. Li et al. [111] proposed LOGO, which is a news recommendation method that models both long-term and short-term user interests. LOGO uses a weighted summation of the topic distributions of news clicked by users to indicate long-term user interest, and it uses the topic distribution of the latest clicked news as the short-term user interest. Viana et al. [193] , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 19 Table 4. Additional features used for user representation. *ID/textual features of clicked news are excluded because they are incorporated by most methods. proposed another news recommendation method based on long short-term user interest. In their method, the long-term interest of users is represented by the frequency of a specific tag being read by this user, and short-term interest is represented by several recently clicked news. Different from other methods that only consider short-term or long-term user interests, these methods can better model the evolution of user interests by capturing long short-term user interests. To help readers better understand feature-based user modeling methods in personalized news recommender systems, we summarize the additional user features (ID and news features are excluded) used in these methods in Table 4.",
  "4.2 Deep Learning-based User Modeling": "In recent years, many personalized news recommendation methods use deep learning techniques for user modeling to remove the need of manual feature engineering. Most existing methods infer user interests from historical news click behaviors. Several methods focus on aggregating the representations of historical clicked news [63]. For example, Khattar et al. [97] used the summation of clicked news representations weighted by an exponential discounting function, where more recent clicks gain higher weights. NAML [203] and KRED [121] learn user representations from the representations of clicked news using a news-level attention network, and AMM [240] also uses attention network to aggregate different information of clicked news and candidate news for user modeling. DKN [197] learns user representations from the representations of clicked news via a candidate-aware attention network, i.e., computing the attention weight of each clicked news according to its relevance to candidate news. The candidate-aware attention mechanism is also used by TEKGR [103] for user modeling. Liu et al. [119] use a simple time-decayed averaging of the embeddings of clicked news to build the user embedding. MM-Rec [217] uses a crossmodal candidate-aware attention network that selects clicked news based on their crossmodal relatedness with candidate news for user modeling. HieRec [160] uses a hierarchical user interest representation method that first models subtopic-level user interest from the news within the same subtopic, then aggregates subtopic-level interest representations into coarse-grained topic-level user interest representations, and finally synthesizes topic-level interest representations into an over interest representation. DebiasRec [230] uses a bias-aware user modeling module to learn debiased user interest representations by incorporating the influence of presentation bias information on click behaviors into attentive behavior aggregation. These methods can select important click behaviors for user modeling. However, the relations among different clicked news, which provide rich contexts of behaviors that are useful to user modeling, cannot be modeled by these methods. Therefore, many methods consider the contexts of news click behaviors. Recurrent neural network (RNN) is a popular choice to model the sequential dependency between different clicked news [96, 144, 165, 248]. For example, EBNR [144] learns representations of users from the representations of their browsed news via a GRU network. RA-DSSM [96] uses a bi-directional long short-term , Vol. 1, No. 1, Article . Publication date: February 2021. 20 Wu et al. memory (Bi-LSTM) network to process the historical news click sequence, and then use a newslevel attention network to form a user representation. DAN [248] learns user representations from clicked news using a combination of attentive LSTM and candidate-aware attention, which generate user historical sequential embedding and user interest embedding, respectively. The advantage of RNN-based user models is their strong ability in modeling user interest dynamics. However, they are somewhat weak in capturing the global interest information of users. In addition, as pointed by [216], news recommendation may not be suitable to be modeled as a conventional sequential recommendation problem because users have a strong preference on the diversity between past and future clicked news. Many other common deep models, such as CNN [239], self-attention [207] and co-attention [138], have also been applied in user modeling. For example, WE3CN [90] learns representations of users from the 3D representation tensors of their clicked news using a 3D CNN model. SFI [138] further introduces a hard selection mechanism to reduce the computational cost in 3D CNN-based user modeling. NRMS [207] learns contextual news representations by using a news-level multi-head self-attention network, and uses an additive attention network to form the user representation. This method is also adopted by many methods like FairRec [221], IMRec [226] and SentiRec [212], and the variant that uses 'CLS' token representation of Transformer is used by [241]. FIM [196] uses a fine-grained interest modeling method that can capture the word-level relatedness between news with a 3D CNN model. UniRec [218] learns the user embedding for news ranking with the NRMS [207] model, and then uses this embedding as the attention query to select a set of basis interest embeddings to aggregate them into a user embedding for news recall. KIM [156] uses a user-news co-encoder that models the interactions between candidate news and clicked news to collaboratively learn a candidate-aware user interest representation and a user-aware candidate news representation. PP-Rec [157] uses a popularity-aware user modeling method that first uses self-attention to model the contexts of user behaviors and then uses a content-popularity joint attention network that selects clicked news according to their content and popularity for user interest modeling. RMBERT [81] uses a reasoning memory network [45] to capture the sophisticated interactions between user behaviors and candidate news in user interest modeling. These methods can effectively capture the relations of different user behaviors to enhance user modeling. In recent years, graph neural networks have also been applied to model the contexts of user behaviors by capturing their high-order relations [136]. For example, CAGE [175] first uses a GCN model to capture the relations between different behaviors within a news session to refine the behavior representations, and then uses a GRU network to build user representations. User-asGraph [210] is probably the first work in news recommendation that represents each user with a personalized heterogeneous graph constructed from click behaviors, where the user modeling task is modeled as a graph pooling problem. It uses a heterogeneous graph pooling method named HG-Pool to iteratively summarize the personalized heterogeneous graph for learning user interest representations. EEG [243] models each user as an entity graph. It first uses a graph neural network to learn hidden entity representations, and then uses an attention network to aggregate them into an entity-based user representation. KOPRA [188] also models users as entity graphs and uses recurrent graph convolution to process the entity graphs. It models both long-term and short-term user interests with the entire graph and the subgraph inferred from recently clicked news, respectively. In addition, it introduces an entity neighbor pruning technique to select entity neighbors according to user interests. CNE-SUE [136] applies a GCN to different subgraphs of an entire user behavior graph to learn different interest representations for different behavior clusters. It further employs an intra-cluster attention mechanism to pool node representations and uses an intra-cluster attention mechanism to aggregate cluster representations. These methods can , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 21 usually capture the rich high-order relatedness between users' click behaviors to discover latent user interest. In addition to click behaviors, a few methods also consider the ID information of users [235, 237]. For example, NPA [204] uses a news-level personalized attention network to select important news according to user characteristics, where the embeddings of user IDs are used to generate the attention queries. LSTUR [2] learns short-term user interest embeddings by a GRU network, and models long-term user interests by the embeddings of user IDs. To fuse the two kinds of user representations, LSTUR explores two methods, i.e., concatenating two vectors together, or using the long-term user interest embedding to initialize the hidden state of the GRU network. This framework is further used by CUPMAR [190] and KG-LSTUP [185]. These methods can usually better serve active users with rich behaviors to tune their ID embeddings. However, they have some difficulties in handling cold-start users without well-tuned user embeddings. All the aforementioned methods mainly rely on the information of users' click behaviors. However, click behaviors are very noisy and may not necessarily indicate user interest, and it is difficult to comprehensively and accurately infer user interest from click feedback only. Thus, a few methods study incorporating other kinds of user information to enhance user interest modeling [238]. One major direction is adding context features to enhance user modeling. For example, CHAMELEON [31, 46] uses several user context features like time, device, location and referrer. It uses a UGRNN network to learn representations of users in a session, and the click score is evaluated by the cosine similarity between user and candidate news representations. The context features used in these methods can provide rich information for inferring users' current preferences to improve subsequent news recommendation. Another main direction is incorporating various kinds of user behaviors [133]. For example, NRHUB [206] considers heterogeneous user behaviors, including news clicks, search queries, and browsed webpages. It incorporates different kinds of user behaviors as different views of users by learning a user embedding from each kind of user behaviors separately, where a combination of CNN and attention network is used to learn behavior representations and a behavior attention network is used to learn a user embedding by selecting important user behaviors. The user embeddings from different views are aggregated into a unified one via a view attention network. The effectiveness of webpage browsing behaviors in user modeling for news recommendation is also studied by WG4Rec [176]. CPRS [213] considers users' click and reading behaviors in user modeling. It models the click preference of users from the titles of clicked news, and models their reading satisfaction from the body of clicked news as well as the personalized reading speed metric derived from dwell time and body length. NRNF [209] uses a dwell time threshold to divide click news into positive ones and negative ones. It uses separate Transformers and attention networks to learn positive and negative user interest representations. FeedRec [215] uses various kinds of user feedback including click, nonclick, finish, quick close, share and dislike to model user interest. It uses a heterogeneous Transformer to model the relatedness between all kinds of feedback and uses different homogeneous Transformers to model the interactions between the same kind of feedback. In addition, it uses a strong-to-weak attention network that uses the representations of strong feedback to distill real positive and negative user interest information from weak feedback. These methods can usually infer user interests more accurately by mining complementary information encoded in multiple kinds of user behaviors. There are also several methods that learn user representations on graphs that involve the collaborative information of users and news. For example, IGNN [161] learns content-based user representations using the average embedding of clicked news, and learns graph-based user representations from the user-news graph via a graph neural network. The content-based user representation is concatenated with graph-based user representation to form a unified one. GNewsRec [70] uses the , Vol. 1, No. 1, Article . Publication date: February 2021. 22 Wu et al. same architecture with DAN to learn short-term user representations, and uses a two-layer graph neural network (GNN) to learn long-term user representations from a heterogeneous user-newstopic graph. Both short-term and long-term user representations are concatenated to build a unified user representation. GERL [53] uses multi-head self-attention and additive attention networks to form content-based user representations from the click history. In addition, it uses a graph attention network to learn graph-based representations of users by capturing high-order information on the user-news graph, which are further combined with the content-based user representations. MVL [170] uses attention networks to learn user interest representations in a content view, and uses a graph attention network to model user interest from the user-news graph in a graph view. GNUD [71] uses a disentangled graph convolution network to learn user representations from the user-news graph. These methods can exploit the high-order information on graphs to enhance user modeling. GBAN [133] combines user embeddings learned by an LSTM and heterogeneous graph embeddings. It further introduces subgraph core and coritivity scores that measure the importance of a target user-news pair in the subgraph to enhance user representations. These methods can take the advantage of high-order interaction information between user and news as well as the associated meta features. However, it is challenging for them to accurately represent new users that do not participate in the model training. We summarize the user information and user modeling techniques used in these deep learningbased methods in Table 5. We then provide several discussions on the user modeling methods introduced in this section.",
  "4.3 Discussions on User Modeling": "4.3.1 Feature-based User Modeling. Most feature-based methods construct user profiles based on the collections of features extracted from the clicked news. Besides the news information, some methods leverage additional user features to facilitate user modeling. For example, the demographics of users (e.g., age, gender and profession) are used in several methods, since users with different demographics usually have different preferences on news. The location of users can be used to identify the news related to the user's neighborhood, and the access patterns of users can also help understand the news click behaviors of users. In addition, many methods use the tags or keywords of users to indicate user interest, and cluster users based on their characteristics. In this way, the recommender system can more effectively recommend news according to users' interest in different topics. Moreover, several methods incorporate user behaviors on other platforms, such as social media, search engines and e-commerce platforms. These behaviors can not only facilitate user interest modeling, but also has the potential to mitigate the problem of cold-start on the news platform if user data can be successfully aligned. However, feature-based user modeling methods usually require massive expertise for feature design and validation, and may not be optimal for representing user interests. 4.3.2 Deep Learning-based User Modeling. Deep learning-based user modeling methods usually aim to learn user representations from user behaviors without feature engineering. Many of them infer user interests merely from click behaviors, because click behaviors are implicit indications of users interest in news. However, click behaviors are usually noisy and they do not necessarily indicate real user interests. Thus, many methods consider other kinds of information in user modeling. For example, some methods such as NPA and LSTUR incorporate the IDs of users to better capture users' personal interest. CHAMELEON and DAINN consider the context features of users such as devices and user locations. CPRS, FeedRec and GBAN incorporate multiple kinds of user feedback on the news platform to consider user engagement information in user interest modeling. GERL and GNewsRec can exploit the high-order information on graphs to encode user , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 23 Table 5. Comparison of different methods on user modeling. representations. However, it is still difficult for these methods to accurately infer user interests when user behaviors on the news platforms are sparse. There are only two methods, i.e., NRHUB and WG4Rec, that consider users' behaviors on multiple platforms, which can still model users accurately even user behaviors on the news platform are sparse. However, there may exist some difficulties in linking user data on different platforms due to privacy reasons. , Vol. 1, No. 1, Article . Publication date: February 2021. 24 Wu et al. According to the summarization in Table 3, we can see that the model architectures used for user representation learning are diverse. Some methods utilize recurrent neural networks to capture the relatedness of news clicked by users, such as EBNR, DAN and CHAMELEON. With the great success of Transformer models, many methods also use self-attention or Transformer networks to model the global contexts of user behaviors. However, these sequential models cannot effectively model the high-order relations between user behaviors, which can provide useful contexts for user interest understanding. Instead of modeling user behaviors as a sequence, several methods like User-as-Graph model each user as a personalized graph, where the high-order relations between behaviors can be fully modeled. In addition, several works such as GERL and GNUD use graph neural networks to capture the high-order interactions between users and news on the global usernews graphs, which can also help better understand user interest by incorporating collaborative information. However, the computational cost of these graph-based architectures is usually much heavier than sequential models, and collaborative signals are usually not available for cold-start users and news. To select clicked news that is informative for inferring user interest, attention mechanisms are widely used by many methods. In some works such as NAML and KRED, the attention query is a global parameter vector, which is invariant with respect to different users. In the NPA method, the attention query is generated by the embedding of user ID, which can achieve personalized news selection. Both kinds of attention mechanisms are efficient in the online test phase because user representations can be prepared in advance [204]. However, the relatedness between candidate news and clicked news cannot be fully modeled, which may not be optimal in modeling user interests in a specific candidate news. Another kind of attention mechanism, i.e., candidate-aware attention, is also widely used by many methods such as DKN, DAN and KIM. In candidate-aware attention networks, the representation of candidate news is used as the attention query, and user representations can be dynamically constructed based on candidate news. However, they need to memorize the representations of all clicked news in the test phase, which may lead to some sacrifice in efficiency. Some methods study modeling multiple types of user interests. For example, LSTUR, GNewsRec and FedRec consider both long-term and short-term interests of users to better capture their interest dynamics. HieRec models the hierarchical structure of user interests, which can capture the user interests in different granularities. These methods can improve user interest understanding of user interests by taking different kinds of user interest into consideration. However, user interests are diverse and evolutional, which are still difficult to be comprehensively and accurately modeled by these methods. 4.3.3 Differences to User Modeling in General Recommendation. The user modeling techniques used for personalized news recommendation have close relations to the user modeling methods in general recommendation scenarios such as e-commerce [246] and movie recommendation [35]. For example, the core neural architectures such as RNN, CNN, self-attention and graph neural networks, are also widely used for sequential recommendation. In addition, several useful user modeling paradigms such as long short-term user interest modeling are also popular in other recommendation fields. However, by scrutinizing recent literature, we find there are several unique characteristics of user modeling in personalized news recommendation: (1) Short news lifecycles. Different from the common e-commerce recommendation scenarios where items can be actively interacted with for months or even years [247], most news articles have very short lifecycles (i.e., a few days). Thus, in news recommendation it is important to take this unique characteristic into consideration when designing user modeling algorithms. For example, in GNN-based methods for general recommendation, item nodes can be simply represented by ID , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 25 embeddings. However, in GNN-based news recommender, it is better to learn embeddings of news nodes from news content to handle uncovered news in user modeling [70]. In addition, the quick vanishment of old news de facto limits the exploitation of collaborative signals in user modeling due to the large fraction of cold news in the inference stage. (2) Fine-grained candidate-aware user modeling. In many recommendation tasks, items are mainly represented by their overall embeddings [183], and modeling feature interactions is important for candidate-aware user modeling [246]. By contrast, news articles have rich content and context information, and the interactions between user behaviors and candidate news can be modeled in a more fine-grained way (e.g., word-level interactions). Capturing the fine-grained relevance between user behaviors and candidate news is very important for understanding user interest in a specific candidate news article. Thus, fine-grained candidate-aware user modeling is a core technique used in many recent news recommendation methods. (3) User modeling as document modeling. Different from many recommendation scenarios where user behaviors are not associated with sufficient textual information [245], in news recommendation user behaviors are usually clicked news that contain rich texts. Thus, the user modeling problem in news recommendation can be formulated as a document modeling problem, where the texts of clicked news are embedded in user 'documents'. Several recent methods follow this setting and employ strong pre-trained language models to empower user modeling [81, 241]. The success of these PLM-based user modeling techniques indicates that there may not be a huge barrier between NLP and user modeling for news recommendation, which is a unique characteristic of the news recommendation field. (4) Potential strong temporal diversity preference. Different from general recommendation scenarios where users may prefer to click very similar items, in news recommendation users tend to click news that are somewhat different from the previously clicked ones [1] (i.e., preference on serendipity). As pointed by a recent study [216], it may not be very suitable to model news recommendation as a standard sequential recommendation task, and it is important to consider such temporal diversity preference in user modeling. The results show that many sequential models such as RNN [66] and casual self-attention [86] are inferior to standard self-attention that focus more on global context rather than sequential dependency. Further study on this unique phenomenon is needed to better understand user modeling mechanism in news recommendation. In summary, by reviewing user modeling techniques used in existing news recommendation methods, we argue that user modeling is also remained challenging due to many reasons, such as the noise and sparsity of user behaviors, the diverse and dynamic characteristics of user interests, and the difficulties in modeling user interests in a specific candidate news effectively and efficiently.",
  "5 PERSONALIZED RANKING": "On the basis of news and user modeling, news ranking aims to rank candidate news for personalized display according to users' personal interest. Common news ranking techniques can be divided into two categories, i.e., relevance-based and reinforcement learning-based. We introduce them in the following sections.",
  "5.1 Relevance-based Personalized Ranking": "Relevance-based news ranking methods usually rank candidate news with user interests based on their personalized relevance. In these methods, how to accurately measure the relevance between candidate news and user interest is a core problem. Many methods directly evaluate the user-news relevance based on the similarities of their final representations. For instance, Goossen et al. [58] computed the cosine similarities between the CF-IDF feature vectors of user and news to measure their relevance. Garcin et al. [52] used the similarities between the news topic vectors and the , Vol. 1, No. 1, Article . Publication date: February 2021. 26 Wu et al. user topic vector to evaluate their relevance. Okura et al. [144] used the inner product between news and user representations to predict the relevance scores. DFM [116] uses an inception module that combines neural networks with different depths to compute the relevance scores from news and user features. These methods usually employ two-tower architectures, which enable efficient inference by computing news and user features in advance. However, user interests are usually diverse, and candidate news may only match the user interests indicated by a part of the clicked news. These methods cannot fully consider the relatedness between candidate news and clicked news, and the matching between candidate news and user interest may not be very accurate. A few methods use fine-grained interest matching techniques to better model the relevance between users' interest and candidate news. For example, FIM [196] first multiplies together the word representations of candidate news and clicked news, and then uses a matching module with 3-D CNN networks to compute relevance scores by capturing the fine-grained relatedness between candidate news and clicked news. KIM [156] first uses a knowledge-aware news co-encoder to model the relatedness between words and entities in candidate news and clicked news, and further uses a user-news co-encoder to further help model the interactions between clicked news and candidate news for better relevance modeling. HieRec [160] has a hierarchical interest matching mechanism that matches candidate news with the fine-grained subtopic-level user interest, the coarse-grained topic-level user interest and the overall user interest. AMM [240] uses a multi-field matching scheme to model the interactions between each pair of views of a clicked news and a candidate news. These single-tower methods can more accurately evaluate the relevance between candidate news and user interest by modeling their fine-grained and multi-grained relatedness, which can help generate news ranking results that better target user interest. However, these methods usually have much larger computational costs in the inference stage than coarse-grained interest matching, which may hinder their application in some low-latency or low-resource scenarios. In most methods, candidate news with higher relevance to user interest will gain higher ranks. However, these methods may tend to recommend news that are similar to those previously clicked by users, which is also called the 'filter bubble' problem. Thus, some news ranking methods explore to recommend news that are somewhat different from previously clicked ones to introduce diversity and serendipity [1]. For example, Newsjunkie [47] is a system that ranks news articles based on their novelty in the context of the news that users previously clicked. SCENE [109] first ranks news articles based on their relevance to user interests, and then refines the ranking list based on news popularity and recency to form the final recommendation list. Different from the methods that are solely based on the relevance between candidate news and user interests, these methods have the potential to provide more diverse recommendations.",
  "5.2 Reinforcement Learning-based Personalized Ranking": "Different from relevance-based ranking methods that mainly aim to optimize the objectives (e.g., clicks) on current candidate news articles, reinforcement learning-based ranking methods usually aim to optimize the total reward in a long term [179, 244]. A representative reinforcement learningbased approach to personalized news recommendation is LinUCB [106], which models the problem of personalized news recommendation as a contextual bandit problem. In this method, LinUCB computes the payoff by a hybrid linear model, which means that some parameters are shared by all arms, while the others are not. LinUCB can outperform context-free bandit methods such as 𝜖 -greedy and Upper Confidence Bound (UCB), and it is computationally efficient because the block parameters in LinUCB have fixed dimensions and can be incrementally updated [106]. It is also latterly evaluated by [107] in an unbiased manner by estimating the per-trial payoff with log data directly rather than a simulator. In the CLEF NewsREEL 2017 challenge, Liang et al. [117] also developed a system based on LinUCB. The LinUCB model is used to help choose the appropriate , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 27 recommender from a pool of recommendation algorithms based on user and news features. Deep reinforcement learning is also explored in news recommendation [76, 179, 244]. For example, DRN [244] uses a Deep Q-Network (DQN) to estimate the policy reward, which is a weighted summation of click labels and the activeness of users that is computed based on their return time after recommendations. In addition, DRN applies the Dueling Bandit Gradient Descent [233] algorithm to eliminate the recommendation performance decline brought by classical exploration methods such as 𝜖 -greedy and UCB. Different from relevance-based ranking methods, reinforcement learning-based ranking methods have the ability of exploration, which can increase the diversity of recommendation results and further discover potential user interests.",
  "5.3 Discussions on Personalized Ranking": "In this section we provide some discussions on the news ranking methods in existing personalized news recommender systems. Relevance-based news ranking methods mainly need to accurately evaluate the relevance between candidate news and user interest for subsequent news ranking. Many methods model their overall relevance by evaluating the relevance between the unified representations of user interest and candidate news. However, candidate news usually can only match part of user interests, and directly match the overall user interest with candidate news may be suboptimal. A few methods explore to evaluate the relevance between user interest and candidate news in a fine-grained way by modeling the relatedness between candidate news and clicked news, which can improve the accuracy of relevance modeling for news ranking. However, these methods are much more time-consuming because the representations of users are dependent on candidate news and cannot be computed in advance. Moreover, pure relevance-based interest matching methods may tend to recommend news that are similar to previously clicked news, which is not beneficial for users to receive diverse news information. Thus, a few works explore to adjust the news ranking strategy by incorporating other factors such as news novelty, popularity and recency, which have the potential to make more diverse news recommendations and mitigate the filter bubble problem in news recommender systems. In relevance-based news ranking methods, candidate news is usually greedily matched with users, i.e., choosing the news in each impression that mostly satisfy the ranking policy on the current candidate news list. However, it may not be optimal in improving long-term user experience. In reinforcement learning-based methods, the ranking algorithm aims to find the optimal ranking policy to maximize the long-term reward. Thus, RL-based news ranking methods may be more suitable for exploring potential user interest and improving long-term user experience and engagement, while it may have some sacrifice in short-term news CTRs. In summary, news ranking in news recommendation also faces many challenges, including how to accurately and efficiently evaluate the relevance between candidate news and user interest indicated by user behaviors, how to mitigate the 'filter bubble' problem in news recommender systems, and how to explore potential user interests without hurting user experience.",
  "6 MODEL TRAINING": "Many personalized news recommendation methods exploit machine learning models for news modeling, user modeling and interest matching. Training these models is a necessary step in building an accurate news recommender system. In this section, we review the techniques used for model training in news recommendation.",
  "6.1 Training Methods": "In a few methods based on collaborative filtering, the news recommendation task is formulated as a rating prediction problem, i.e., predicting the ratings that users give to news [78]. To learn their , Vol. 1, No. 1, Article . Publication date: February 2021. 28 Wu et al. models, they usually use loss functions such as the mean squared error (MSE) computed between the predicted ratings and the gold ratings, which are further used to optimize the model [26]. However, explicit user feedback like rating is usually very sparse, which may be insufficient to train an accurate recommendation model. Since implicit feedback such as click is abundant, most methods use the click feedback of users as the prediction target. They formulate the news recommendation task as a click prediction task. Some methods simply classify whether a candidate news will be clicked by a target user [43, 55, 197]. However, these methods cannot exploit the relatedness between clicked and nonclicked samples. Thus, a few methods use contrastive training techniques to maximize the margin between the predicted click scores of clicked and nonclicked news. For example, PP-Rec [157] uses the Bayesian Personalized Ranking (BPR) loss for model training by comparing each clicked sample with an nonclicked one. However, the BPR loss can only exploit a small part of nonclicked samples. NPA [204] uses the InfoNCE [145] loss for model training. For each clicked sample (regarded as a positive sample), it randomly samples a certain number of nonclicked ones (regarded as negative samples) and jointly predicts their click scores. These click scores are further normalized by the softmax function to compute the posterior click probabilities, and the model aims to maximize the negative log-likelihood of the posterior click probability of positive samples. In this way, the model can exploit the information of more negative samples. Besides click feedback, a few methods also consider other kinds of feedback to construct training tasks. For example, CPRS [213] trains the recommendation model collaboratively in the click prediction task and an additional reading satisfaction prediction task, which aims to infer the personalized reading speed based on user interest and news body. FeedRec [215] trains the model in three tasks, including click prediction, dwell time prediction and finish prediction. GBAN [133] models the recommendation task as a future behavior classification problem to predict the behavior type of a user on a specific candidate (i.e., click, nonclick, like, follow, comment, and share). 2 These methods can encourage the model to optimize not only CTR but also user engagement, which can help learn engagement-aware news recommendation models. There are several methods that use additional news information to design auxiliary training tasks. For example, EBNR [144] uses autoencoder to learn news representations and it uses another weak supervision task by encouraging the embeddings of news in the same topic to be similar than the embeddings of news in different topics. TANR [205] uses an auxiliary news topic prediction task to help learn topic-aware news representations. SentiRec [212] uses a news sentiment orientation score prediction task to learn sentiment-bearing news representations. KRED [121] trains the model in various tasks including item recommendation, item-to-item recommendation, category classification, popularity prediction and local news detection. These methods can also effectively encode additional information into the recommendation model without taking it as the input. However, it is usually non-trivial to balance the main recommendation task and the auxiliary tasks.",
  "6.2 Training Environment": "Existing researches mainly focus on the model training methods while ignoring the implementation environment of model training, which is in fact important in developing real-world news recommender systems. In many existing methods, the news recommendation models are offline trained on centrally stored data with centralized computing resources [223]. This model training paradigm can help quick development of news recommender systems, but it also has several main drawbacks. First, user behavior data for model training is usually abundant and many recent 2 We argue that this setting is somewhat difficult to be implemented in real-world news recommender systems because it is not clear how to rank news accordingly and users may also have multiple types of behaviors on the same news. , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 29 news recommendation models are in large size [214], which require a large amount of computing resource to train accurate models. Although some recent works like [214] explore to train models in parallel on multiple GPUs, it is still insufficient to train huge models. Thus, distributed model learning with proper acceleration methods like data rearrangement and cache mechanisms may be required in industrial practice [224]. Second, the model learned on offline data only may also have some mismatches with the characteristics of recommendation scenarios [244]. Moreover, the distribution of user interest and news topics may also evolve, and it is shown in previous research that the performance of offline trained models may decline with time [204]. Thus, instead of re-training models periodically, online model training on streaming data is needed. Third, most existing news recommendation methods are trained on centrally stored user data, which may have some privacy risks because user data usually contains private user information. Several recent works like [158, 159, 231] explore to train news recommendation models based on decentralized data with federated learning techniques, which can better protect user privacy in model training.",
  "6.3 Discussions on Model Training": "Next, we provide some discussions on the model training techniques used in news recommendation methods. In some CF-based methods, news recommendation is modeled as a regression task where the ratings given by users are regarded as prediction targets. However, on news platforms explicit user feedback such as rating is usually scarce, which poses great challenges to model training. Therefore, most methods adopt implicit feedback to construct training tasks. Click feedback is one of the most widely used signals for model training because it can implicitly indicate user interests in news and help the model optimize the CTR of recommendation results. However, click signals also have some gaps with the real user interests [232], and increasing CTR only may lead to recommending clickbait news to users, which is actually harmful to user experience. Thus, a few methods incorporating other user engagement signals such as dwell time and finish into model training, which can help learn user engagement-aware recommendation model to improve user experience. Besides user feedback, some methods also consider using additional news information as auxiliary prediction objectives. By jointly training the model in both recommendation task and auxiliary tasks, the model can be aware of the additional news information. Since these methods do not take the additional features as the input, they can handle the scenarios where the additional features are unavailable. However, in multi-task learning based methods, it is difficult to choose the proper coefficients for weighting the loss functions of different tasks, and these coefficients may also be sensitive to the dataset characteristics. Another important problem in model training is designing effective strategies for constructing labeled training samples. In most methods the negative samples are randomly drawn from the entire news set or the impression list [218], which are further packed with the positive samples. However, researchers have found that randomly selected negative samples may be too easy for the model to distinguish, which is not beneficial for learning discriminative recommendation models [105]. It is also an interesting problem to study the influence of the number of negative samples on model training [208]. Besides, the environment for news recommendation model training is a less studied but important problem. Most researches are offline conducted by learning models on centralized data with centralized computing resources. As discussed in the previous section, this model training environment may pose many potential challenges like the limitation of centralized computing resources, the gaps between offline data and online applications, and the privacy concerns and risks of centralized model training, which need to be extensively studied in the future. In summary, model training is critical for news recommendation while it still has much room for improvement, such as designing more effective training tasks, choosing more representative , Vol. 1, No. 1, Article . Publication date: February 2021. 30 Wu et al. training samples, adaptively tuning the loss coefficients for multi-task learning, and building more effective, efficient and privacy-preserving environment for news recommendation model training. 6.3.1 A Bird's-eye View on Recent Approaches. To help readers better understand the details of recent news recommendation methods in terms of their news modeling, user modeling, ranking, and model training techniques, we illustrate a joint table that summarizes their details in these aspects. Due to the limitation of page sizes, we do not include it in the main content, and readers can refer to it in a public repository (https://github.com/wuch15/News-Rec-Survey).",
  "7 EVALUATION METRICS": "There are many metrics to quantitatively evaluate the performance of news recommender systems. Most metrics aim to measure the recommendation performance in terms of the ranking relevance. For methods that regard the task of news recommendation as a classification problem, the Area Under Curve (AUC) score is a widely used metric, which is formulated as follows:  where 𝑁 𝑝 and 𝑁 𝑛 are the numbers of positive and negative samples, respectively. 𝑝 𝑖 is the predicted score of the 𝑖 -th positive sample and 𝑛 𝑗 is the score of the 𝑗 -th negative sample. Another set of popular metrics are precision, recall and F1 scores, which are computed as:    where TP, FP and FN respectively denote true positive, false positive and false negative. For methods that model news recommendation as a regression task (e.g., predict the ratings of news), several common metrics for regression such as mean absolute error (MAE), mean squared error (MSE), rooted mean squared error (RMSE) and Pearson correlation coefficient (PCC) are used to indicate the recommendation performance, which are respectively formulated as follows:     where 𝑟 𝑖 and 𝑝 𝑖 are the real and predicted ratings of the 𝑖 -th sample, ¯ 𝑟 and ¯ 𝑝 respectively denote the arithmetic mean of the real and predicted ratings, and 𝜎 is the standard deviation. For methods that regard news recommendation as a ranking task, besides the AUC metric there are also several other metrics such as Average Precision (AP), Hit Ratio (HR), Mean Reciprocal Rank (MRR) and normalized Discounted Cummulative Gain (nDCG). Note that these metrics may be , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 31 applied to the top K recommendation lists, e.g., HR@K and nDCG@K. These metrics are respectively formulated as follows:     where 𝑟 𝑖 is a relevance score of news with the 𝑖 -th rank, which is 1 for clicked news and 0 for non-clicked news. There are several other metrics such as Click-Through Rate (CTR) and dwell time, which can be only used to measure the performance of online news recommenders. Besides the metrics for measuring ranking accuracy, there are several other objective or subjective metrics to evaluate news recommender systems in other aspects. In [47] the recommendation results are evaluated by novelty, which is subjectively judged by a group of human subjects by rating the news sets from most novel to least novel. In FeedRec [215], the recommendation results are further evaluated by a set of user engagement-related metrics, such as the average dwell time, finish ratio, dislike ratio and share ratio of the top ranked news. These metrics can help comprehensively evaluate the performance of news recommender systems and further improve user experience. A few methods also measure the diversity of recommendation results in different aspects. For example, in [244], an Intra-List Similarity (ILS) function is used to measure the diversity of recommendation results. More specifically, given a ranking list 𝐿 , its ILS score is calculated as follows:  where 𝑆 ( 𝑏 𝑖 , 𝑏 𝑗 ) represents the cosine similarity between the item 𝑏 𝑖 and 𝑏 𝑗 . A similar diversity metric ILAD is also used in [157, 160]. SentiRec [212] uses a set of sentiment diversity metrics to measure the sentiment difference between historical clicked news and candidate news, which are formulated as follows:  where 𝑁 is the number of candidate news in an impression, 𝑠 𝑐 𝑖 denotes the sentiment score of the 𝑖 -th ranked candidate news. Besides diversity, several fairness metrics are used to measure whether a news recommender system is fair to different groups of users or different news publishers. For example, FairRec [221] uses the accuracy of sensitive attribute (e.g., gender) prediction based on top recommendation results as the fairness metric, where a higher accuracy means more serious unfairness because , Vol. 1, No. 1, Article . Publication date: February 2021. 32 Wu et al. the recommendation results are more heavily influenced by sensitive attributes. [57] studies the news recommendation fairness to different groups of authors. It uses an Equity Attention for group fairness (EAGF) measurement and a Supplier Popularity Deviation (SPD) measurement for evaluating such kind of fairness, which if formulated as follows:  where 𝑔 is the set of author groups and 𝐿 ( 𝑖 ) is the set of recommended news belonging to the 𝑖 -th group, 𝐿 is the set of all recommended items, 𝐴 ( 𝑖 ) is the set of items in the training set belonging to the 𝑖 -th group, and 𝐴 is the whole set of items. A higher EAGF and a lower SPD score indicate better fairness. These metrics used in the two works can be used to measure user-side fairness and provider-side fairness, respectively. With the development of privacy-preserving news recommendation methods based on federated learning, a few measurements can be used to evaluate the degree of privacy protection in news recommendation. For example, in FedRec [158] the privacy protection ability of the model can be directly indicated by the privacy budget of model gradients. In addition, privacy protection can also be measured by conducting membership inference attack on user behavior histories to guess whether a behavior belongs to a target user [159]. These metrics can indicate whether private user information encoded in exchanged models results is well-protected.",
  "8 DATASET, COMPETITION AND BENCHMARK": "Many works in the news recommendation field are based on proprietary datasets, such as those collected from Google News [29], Yahoo's news [144], Bing news [116] and MSN news [204]. There are only a few publicly available datasets for the research on personalized news recommendation, which are respectively introduced as follows. The first one is the plista [91] dataset. It is constructed by collecting the 70,353 news articles from 13 German news portals as well as 1,095,323 news click logs of users. In the CLEF 2017 NewsREEL task, the organizers publish a new version of the plista dataset, which records users' interactions with news from eight publishers in February 2016. This dataset contains 2 million notifications, 58 thousand news updates, and 168 million recommendation requests. The language used in the plista datasets is German since it is mainly based on the news websites and users in German speaking world. Note that the number of users is not provided. The second one is the Adressa [61] dataset, which was constructed by collecting the news logs of the Adresseavisen website in three months. It has a full version with logs in 10 weeks and a small version with logs in one week. The small version contains 561,733 users, 11,207 articles and 2,286,835 clicks, and the full version contains 3,083,438 users, 48,486 articles and 27,223,576 clicks. The news articles in Adressa are written in Norwegian. The third one is the Globo [31] dataset, which is retrieved from the Globo news portal in Brazil. This dataset contains about 314,000 users, 46,000 news articles and 3 million news clicks. This dataset is in Portuguese, and there is no original news text in this dataset, and it only provides the embeddings of words generated by a neural model that is pre-trained in a news metadata classification task. , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 33 Table 6. Comparisons of the five public datasets for news recommendation. The fourth one is a Yahoo! 3 dataset for session-based news recommendation. It contains 14,180 news articles and 34,022 click events. In this dataset, no news text is provided and the number of users is also unknown because there is no information about user ID. The fifth one is the MIND [223] 4 dataset, which is a large-scale English dataset for news recommendation. This dataset is recently released by MSN News, which contains the real news logs of 1 million users in 6 weeks (from October 12 to November 22, 2019). It involves 161,013 news articles, 15,777,377 impressions and 24,155,470 news clicks. We present a comparison of the volume, textual information and leaderboard information of these datasets in Table 6. We can see that only the MIND dataset is associated with a public leaderboard. In fact, many researches conducted on other datasets such as Adressa use different dataset preprocessing methods [70, 248], making it difficult to make head-to-head comparisons between the results reported in different papers. On the contrary, on the MIND dataset the training, validation and test samples are given, and the evaluation metrics are consistent. Thus, MIND can serve as a standard testbed for news recommendation research. Based on the datasets introduced above, several competitions and benchmarks on personalized news recommendation have been established. One representative one is the NEWSREEL challenge held from 2013 to 2017 (in 2013 the challenge is named NRS). 5 There are usually two tasks in the NEWSREEL challenge. The first one is news recommendation in a living lab, which are conducted on an operating news recommendation service. The goal of recommendation algorithms in this task is achieving high news CTRs. The second one is offline evaluation of news recommendation methods in a simulated environment. This task is performed based on the plista dataset, and the goal is to predict which news articles a visitor would read in the future. In the 2017 edition of NewsREEL 87 participants are registered [92], and two systems achieved CTRs higher than 2% in the online evaluation task. Another recent competition is the MIND News Recommendation Competition 6 , which is conducted on the MIND dataset. The goal of this challenge is to predict the click scores of candidate news based on user interests and rank candidate news in each impression. This challenge attracted more than 200 registered participants and the top submission achieved 71.33% in terms of AUC. The leaderboard of this challenge opens after the challenge, and researchers can submit their predictions on the test set to obtain the official evaluation scores. The current top result on this leaderboard is 73.04% in terms of AUC, which is achieved by a recommender named 'UniUM-Fastformer-Pretrain' based on the techniques in [214] and [219]. The MIND dataset, challenge and the public leaderboard can form a good benchmark to facilitate research and engineering on personalized news recommendation. 3 https://webscope.sandbox.yahoo.com/catalog.php?datatype=l 4 https://msnews.github.io/ 5 https://www.newsreelchallenge.org/ 6 https://msnews.github.io/competition.html , Vol. 1, No. 1, Article . Publication date: February 2021. 34 Wu et al.",
  "9 RESPONSIBLE PERSONALIZED NEWS RECOMMENDATION": "Although personalized news recommendation techniques have achieved notable success in targeting user interest, they still have several issues that may affect user experience and even lead to potential negative social impacts. There are several critical problems in developing more responsible personalized news recommender systems, including privacy protection, debiasing and fairness, diversity, and content quality, which are discussed in the following sections, respectively.",
  "9.1 Privacy Protection": "Most existing personalized news recommender systems rely on centralized storage of users' behavior data for user modeling and model training. However, user behaviors are usually privacy sensitive, and centrally storing them may lead to users' privacy concerns and further risks on data leakage [115]. There are only a few works that study the privacy preservation problem in news recommendation [32, 158]. For example, FedRec [158] may be the first attempt to learning privacy-preserving news recommendation model. Instead of collecting and storing user behavior data in a central server, in FedRec users' news click data are locally stored on user devices. FedRec uses a federated learning based framework to collaboratively learn news recommendation model. Each client keeps a local copy of the model and locally computes the model updates based on local data. The local model updates are uploaded to a central server that coordinates a number of user clients for model training. The server aggregates the local gradients into a global one to update its maintained global model, and distributes the updated global model to user devices for local update. In addition, to further protect user privacy, FedRec applies local differential privacy (LDP) techniques to perturb the local model gradients. Since the protected model gradients usually contain much less private information, user privacy can be better protected. However, FedRec is only a framework for privacy-preserving news recommendation model training, and privacy-preserving online serving is still a challenging problem. Uni-FedRec [159] is an improved version of FedRec that considers both privacy-preserving training and serving. It has a recall stage to generate dozens of candidates from the news pool in the server and a ranking stage to locally rank candidate news. In the recall stage, Uni-FedRec generates multiple user embeddings to better cover user interest. Instead of sending the original user embedding learned by the user model, it decomposes each user embedding into a linear combination of several basis user embeddings, and the combination weights are protected by LDP before sending to the server. The server reconstructs user embeddings to retrieve candidate news and send them to clients for local ranking. This framework can be used for both model training and serving in a privacy preserving way. However, there are still considerable communication costs in this framework. Efficient-FedRec [231] further studies how to reduce the communication costs of federated news recommendation model learning. It decomposes the whole model into a heavy news model and a light-weight user model, where the news model is placed on the server while the user model is kept by clients. The hidden news representations inferred by the news model on the server are distributed to clients in the model training. This method provides the potential of incorporating big models such as BERT in federated news recommendation. Although existing works on privacy-preserving news recommendation have made notable progresses, there are still many challenges in this field, such as the huge performance sacrifice of differential privacy mechanism, the difficulty of involving some context features (e.g., CTR) and collaborative information in GNN, and the difficulty of real-world deployment of federated news recommender systems. , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 35",
  "9.2 Debiasing": "User behavior data usually encodes various kinds of biases. Some kinds of biases are related to news. For example, click behaviors are influenced by the positions and sizes of news displayed on the webpages (i.e., presentation bias) [230]. In addition, popular news may have higher chances to be clicked than unpopular news (i.e., popularity bias) [157]. These types of bias information may affect the accuracy of user interest modeling and model training. A few works explore to eliminate the influence of certain kinds of bias information to improve personalized news recommendation. For instance, DebiasRec [230] aims to reduce the influence of position and size biases on news recommendation. It uses a bias-aware user modeling method to learn debiased user interest representations, and uses a bias-aware click prediction method that decomposes the overall click score into a bias score and a bias-independent user preference score. PP-Rec [157] uses a popularity-aware user modeling method to learn calibrated user interest representations, and it separately models the popularity of news and users' personal preference on news, which can help better model personalized user interest. These methods mainly aim to infer debiased user interest from biased user data. However, without any prior knowledge about unbiased data distribution, the bias information usually cannot be fully eliminated. In addition, many kinds of bias such as exposure and selection biases are rarely studied in the news recommendation field. Thus, it is important for future research to understand how different biases affect user behaviors and the recommendation model as well as how to eliminate their effect in model training and evaluation.",
  "9.3 Fairness": "Making fair recommendations is an important problem in responsible news recommendation. Researchers have studied various kinds of fairness problems in recommendation, such as provider-side fairness and consumer-side fairness [12]. In personalized news recommendation, a representative kind of unfairness is brought by the biases related to sensitive user attributes, such as genders and professions. Users with the same sensitive attributes may have similar patterns in news click behaviors, e.g., fashion news are more preferred by female users. The model may capture these biases and produce biased recommendation results, e.g., tend to only recommend fashion news to female users. This will lead to the unfairness problem that some users cannot obtain their interested news information, which is harmful to user experience. To address this problem, FairRec [221] uses a decomposed adversarial learning framework with independent user models to learn a bias-aware user embedding and a bias-free user embedding. The bias-aware user embedding mainly aims to capture bias information related to sensitive user attributes, and the bias-free user embedding aims to model bias-independent user interest. Both embeddings are regularized to be orthogonal thereby the bias-free user embedding can contain less bias information. The bias-free user embedding is further used for making fair news recommendations. By learning user embeddings that are agnostic to the sensitive user attributes, the unfairness brought by the bias information related to sensitive user attributes can be effectively mitigated. However, adversarial learning based methods are usually brittle and it is difficult to tune their hyperparameters to fully remove the bias information. In addition, many other genres of fairness (e.g., provider-side fairness) are less studied in news recommendation. In summary, there are many types of fairness to be improved in news recommendation and it is non-trivial to make both fair and accurate news recommendations.",
  "9.4 Diversity": "Diversity is critical for personalized news recommendation [124, 155, 169]. Users may not prefer to click news with homogeneous information and improving the information variety is important for improving user experience and engagement [6]. However, most existing news recommendation , Vol. 1, No. 1, Article . Publication date: February 2021. 36 Wu et al. methods focus on optimizing recommendation accuracy while ignoring recommendation diversity, and it is shown in [157, 160, 212] that many existing news recommendation methods cannot make sufficiently diverse recommendations. There are only a few methods that consider the diversity of news recommendation. Some methods aim to recommend news that are diverse from previously clicked news [47, 212], and several other works explore to diversify the top news recommendation list [46, 109]. However, there is still no work on promoting both kinds of diversity in news recommendation. In addition, many diversity-aware news recommendation methods rely on reranking strategies to improve recommendation diversity, which may not be optimal for achieving a good tradeoff between recommendation accuracy and diversity. Thus, further research on learning unified diversity-aware news recommendation models is important for improving the quality of online news services.",
  "9.5 Content Moderation": "The moderation of news content in news recommendation is a rarely studied problem. In fact, some news articles published online are clickbaits, fake news or containing misinformation. In addition, some news may encode adversarial clues [33] or contain low-quality or even harmful content (e.g., racialism and hate speech). Recommending these news will damage user experience and the reputation of news platforms, and may even lead to negative societal impact [101]. Although online news platforms can perform manual moderation on news content quality, the huge amount of online news information makes it too difficult or even impossible to filter all news articles with harmful and useless content. Thus, it is important to design news recommendation algorithms that can avoid recommending news with low-quality content. Researchers have found that news with high ratios of short reading dwell time (e.g., less than 10 seconds) are probably clickbaits [209]. In addition, user behaviors such as comments and sharing on social media may also provide rich clues for detecting news that contain misinformation and harmful content [4, 177]. Thus, incorporating the various user feedback has the potential to help recommend news with high-quality content, which can improve the responsibility of news recommendation algorithms.",
  "10 FUTURE DIRECTION AND CONCLUSION": "By comprehensively reviewing existing news recommendation techniques in different aspects, we can see that personalized news recommendation techniques have achieved substantial progress over the past years. However, there remain many challenges and unresolved problems. Thus, in this section we raise several potential directions that worth exploring in the future.",
  "10.1 Deep News Understanding": "News modeling is at the heart of personalized news recommendation. It can be improved in the following aspects. First, text understanding is a core problem in news modeling, and existing methods may not be capable of understanding the textual content of news deeply. Thus, using more advanced NLP techniques (e.g., knowledge-aware PLMs) may help better understand news texts and improve news modeling. Second, besides textual information, news also contain rich multimodal information such as images, videos and slides. The multimodal news content can provide complementary information on news understanding. Thus, using multimodal content modeling techniques has the potential to improve the comprehensiveness of news understanding. Third, there are many useful factors for news modeling that are not covered by news content, such as publisher, popularity and recency. A unified framework is required to incorporate various kinds of news information (e.g., property features and context features) and meanwhile effectively model the relatedness between different features. Further research on these directions can help understand news more accurately and deeply to empower subsequent user modeling and news ranking. , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 37",
  "10.2 Universal User Modeling": "User modeling is critical for understanding users' interest in news. However, it is difficult to model the dynamic and diverse user interest accurately and comprehensively for news recommendation. To tackle this problem, a universal user modeling framework that can model various kinds of user interest is needed. We argue that this framework should satisfy the following requirements. First, the user modeling framework needs to comprehensively infer user interest from multiple kinds of user behaviors and feedback. This is because click behaviors are very noisy and may be sparse for some users, and it is insufficient to model user interests solely from click behaviors. Fortunately, different kinds of user behaviors and feedback (e.g., read and dislike) can provide rich complementary information like user engagement, and incorporating them in a unified framework can better support user modeling. Second, the framework needs to model the diverse and multi-grained user interest. Since a single user embedding may be insufficient to comprehensively model user interests, it may be a promising way to represent user interest with more sophisticated structures such as embedding sets and graphs to improve the understanding of user interest. Third, the framework needs to capture the dynamics of user interests. Since user interest usually evolves with time, it is important to understand user interest in different periods and further model their inherent relations. To meet this end, using more advanced sequence modeling techniques may help improve user interest modeling in personalized news recommendation.",
  "10.3 Effective and Efficient Personalized Ranking": "News ranking is an essential step to make personalized news recommendations. There are mainly three research directions to improve news ranking. First, most existing personalized ranking methods are mainly based the coarse-grained relevance between candidate news and user interest, which may not be optimal for accurately targeting user interest. Although a few methods can model the fine-grained relatedness between user and news, they are inefficient and may not be suitable for scenarios with limited computation resources and latency tolerance. Thus, developing both effective and efficient personalized ranking methods is important for improving online news recommendation. Second, ranking news solely based on relevance may lead to the filter bubble problem. It is important to design more sophisticated news ranking strategies to achieve a good tradeoff between accuracy and diversity. Third, most existing news ranking methods are greedy, i.e., only consider the current ranking list in the ranking policy. However, they may not be optimal for achieving good user engagement in the long-term. Thus, designing proper news ranking strategies to optimize long-term rewards may be beneficial for user experience.",
  "10.4 Hyperbolic Representation Learning for News Recommendation": "In most existing news recommendation methods, news and users representations are learned in Euclidean space. Matching functions such as inner product and cosine similarity are widely used for computing relevance scores for news ranking. However, representation learning in Euclidean space is ineffective in capturing the hierarchical structure of data, while hyperbolic representation learning is much better at it. There are many inherent hierarchical data structures in personalized news recommendation, such as different levels of user interests, news topics, and commonsense knowledge encoded by knowledge graphs. Thus, news recommendation with hyperbolic representation learning may be a promising solution. There are several existing neural architectures in hyperbolic space, such as hyperbolic attention [60] and hyperbolic GCN [20], which can serve as the core model components in news recommendation. In addition, there have been several successful applications of hyperbolic representation learning to CF-based recommendation [184, 194] and knowledge graph embedding [19, 198], which can provide useful guidance of collaborative signal , Vol. 1, No. 1, Article . Publication date: February 2021. 38 Wu et al. modeling and knowledge exploitation in news recommendation. Future research on hyperbolic representation learning may create a new direction to overcome several drawbacks of current user/news modeling and personalized ranking techniques conducted in Euclidean space.",
  "10.5 Unified Model Training": "Model training techniques are also important for learning effective and robust personalized news recommendation models. There are four potential directions for future works to improve model training. First, most methods only use click signals for model training, which may be inaccurate because click signals are usually noisy and biased. In addition, the supervision signals in specific tasks may also be insufficient [220]. Thus, a unified framework to incorporate various kinds of supervised and self-supervised training signals and objectives for collaborative model learning can effectively improve the model quality. Second, although several methods explore to use multi-task learning frameworks to incorporate multiple objectives into model training, they need to manually tune the loss coefficients of different tasks in model training, which usually require much human effort and may be sensitive to the characteristics of datasets. Thus, a self-adaptive multi-task learning framework to automatically tune hyperparameters like loss coefficients can reduce the developing effort and improve the model generality. Third, many methods use randomly selected negative samples for model training, which may be noisy and less informative. Thus, using more effective negative sampling can help train more robust and accurate news recommendation models. Fourth, offline trained models may have gaps with the online scenarios and may suffer from the performance decline with time. Thus, it is important to incorporate both offline and online learning techniques to help the model better adapt to the latest online serving requirements.",
  "10.6 News Recommendation in Social Context": "On some news platforms, users may have social interactions with other users in many ways, such as leaving comments, replies, and sharing to their social media blogs like Twitter. The social interactions among users concerning certain news can usually reflect their opinions, preferences, and satisfaction on the recommended news [200], which can provide rich complementary information to user modeling. In addition, users' discussions and dissemination behaviors can also help understand the content, quality and authenticity of news [177]. Besides, they can help recognize breaking news and adjust recommendation results accordingly [153]. Therefore, the social contexts of news recommendation play an important role. However, they are usually neglected by news recommendation researches in recent years. In future researches, it is an interesting topic to study the impacts of users' online social interactions on the accuracy, timeliness and quality of news personalization.",
  "10.7 Privacy-preserving News Recommendation": "In recent years, the ethical issues of intelligent systems have attracted much attention from both the academia and public. Developing more responsible news recommender systems can help better serve users of online news services with smaller risks. One important direction for improving the responsibility of personalized news recommendation is user privacy protection. Although a few works like [158] explore to use federated learning techniques to train news recommendation models in a privacy-preserving way, there are still many challenges in developing a privacy-preserving news recommender system. First, given a model learned in a federated way, it is still challenging to deploy it online to serve users efficiently. Second, there may also be potential privacy risks during the training and serving of news recommendation models, and canonical differential privacy techniques usually lead to a heavy sacrifice on model utility. Third, the data isolation problem in federated learning framework settings makes it difficult to exploit some context features like , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 39 CTR and collaborative information in GNN. Thus, further researches on developing more effective, efficient and privacy-preserving news recommendation methods are needed.",
  "10.8 Secure and Robust News Recommendation": "Existing researches on news recommendation focus on building algorithms in a trusted environment. However, in real-world scenarios there may be various kinds of threats brought by malicious users and platforms. For example, existing news recommendation methods are vulnerable to poisoning attacks, which aim to promote certain items, trigger certain backdoors, or degrade the recommender system performance. In addition, news recommender systems may be sensitive to adversarial samples. When news recommender systems are trained in the federated learning framework, the threats from the untrusted outside environment become even more serious. Unfortunately, although the security and robustness of personalized news recommender systems are critical, researches on this problem are rather limited. Future studies on secure and robust news recommendation are important for the stability and reliability of online news platforms.",
  "10.9 Diversity-aware News Recommendation": "Besides accuracy, diversity in news recommendation also has decisive influence on user experience. There are three main research directions to improve the diversity of news recommendation. The first one is temporal-spatial diversity-aware news recommendation, which aims to recommend news that are diverse from each other and meanwhile diverse from historical clicked news. This can help the recommendation results better satisfy users' preference on information variety. The second one is personalizing the diversity in news recommendation. Different users may have different preferences on the tradeoff between accuracy and diversity, and it may be better to consider their personalized preference to improve user experience. The third one is fine-grained diversity, which aims to not only diversify the content and topic of news, but also many other factors like publishers, locations, opinions and emotions. It has the potential to make higher-quality diversity-aware news recommendations.",
  "10.10 Bias-free News Recommendation": "Debiasing is another important problem in improving the responsibility of news recommendation. The biases encoded by user behavior data will propagate to the recommendation model and may further be amplified in the loops of recommendation. Thus, designing effective methods to eliminate the influence of the various kinds of biases on recommendation results is important for making high-quality news recommendations. There are several potential research directions in this field. First, it is important to understand the influence of different kinds of biases on user behaviors and the recommendation model, which can help the subsequent debiasing. Second, different users may be influenced by the same bias information in different ways, and considering the personalized preference of users on bias information can help better eliminate the effects of biases. Third, there are various kinds of biases in news recommendation. A unified debiasing framework that can simultaneously reduce the effects of different biases can greatly improve the accuracy and robustness of news recommendation algorithms.",
  "10.11 Fairness-aware News Recommendation": "Fairness is an essential but often ignored factor in personalized news recommendation. A fair news recommender system is required to provide fair recommendation services to different groups of users and give fair chances to news from different providers to be recommended. Future research on fair news recommendation can be conducted in the following three directions. First, it is important to reduce the consumer-side unfairness related to sensitive user attributes. Although adversarial , Vol. 1, No. 1, Article . Publication date: February 2021. 40 Wu et al. learning techniques are mature solutions to this problem, they are usually brittle and difficult to tune. Thus, more robust and effective methods are required to remove the biases introduced by sensitive user attributes. Second, different news providers and publishers are diverse in their characteristics, such as topic preference and reputation. Thus, it is non-trivial to properly balance the recommendation chances of news from different providers and publishers to achieve better providerside fairness. Third, there are different types of fairness in the personalized news recommendation scenario, and it is very challenging to simultaneously achieve multi-side fairness without a heavy sacrifice of recommendation accuracy.",
  "10.12 Content Moderation in News Recommendation": "The moderation of news content is important for online news platforms to avoid recommending news with low quality or harmful content to users and mitigate their impact on users and society. However, this issue is rarely studied and cannot be resolved by most existing news recommendation methods. There are three key research directions on this problem. First, it is essential to understand the generation and spreading mechanism of harmful news as well as their impact on users, which can help news platforms better defend toxic content. Second, it may be useful to incorporate content moderation techniques like fake news detection [177] and clickbait detection [211] into news recommendation to adjust the recommendation results according to the quality of news content. Third, without the assistance of additional tasks and resources, we can learn content quality-aware news recommendation models with the guidance of certain kinds of user feedback such as comments and dislikes, which is expected to help recommend high-quality news to users.",
  "10.13 Societal Impact of News Recommendation": "News recommender systems can generate societal impact when they serve a certain number of users. They may imperceptibly influence the opinions and views of users when displaying personalized news content [134]. Thus, it is valuable for further research to identify and analyze the societal impact of personalized news recommendation algorithms, such as their influence on political events, economic activities and psychological health. In addition, research on how to reduce the potential negative societal impact of personalized news recommendation methods can help avoid their risky behaviors and better serve online users.",
  "Conclusion": "Finally, we present a conclusion to this survey paper. In this survey, we conduct a comprehensive overview of the personalized news recommendation field, including the technologies involved in different core modules of a personalized news recommender, the dataset and metrics for performance evaluation, the key points for developing responsible personalized news recommender systems, and potential directions to be explored in the future. Different from existing survey papers that follow the conventional taxonomy of news recommendation methods, in this paper we provide a novel perspective to understand personalized news recommendation from its key problems and the associated techniques and challenges. In addition, this is the first survey paper that comprehensively covers both traditional and up-to-date deep learning techniques for personalized news recommendation, which can provide rich insights for extending the frontier of this field. We hope this paper can facilitate future research on personalized news recommendation as well as related fields in NLP and data mining.",
  "ACKNOWLEDGMENTS": "This work was supported by the National Natural Science Foundation of China under Grant numbers U1936208, U1936216, 61862002, and U1705261. , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 41",
  "REFERENCES": "[1] Himan Abdollahpouri, Edward C Malthouse, Joseph A Konstan, Bamshad Mobasher, and Jeremy Gilbert. 2021. Toward the next generation of news recommender systems. In Companion Proceedings of WWW . 402-406. [2] Mingxiao An, Fangzhao Wu, Chuhan Wu, Kun Zhang, Zheng Liu, and Xing Xie. 2019. Neural news recommendation with long-and short-term user representations. In ACL . 336-345. [3] Xiao Bai, B Barla Cambazoglu, Francesco Gullo, Amin Mantrach, and Fabrizio Silvestri. 2017. Exploiting search history of users for news personalization. Information Science 385 (2017), 125-137. [4] Michele Banko, Brendon MacKeen, and Laurie Ray. 2020. A unified taxonomy of harmful content. In WOAH@EMNLP . 125-137. [5] Mariella Bastian, Natali Helberger, and Mykola Makhortykh. 2021. Safeguarding the Journalistic DNA: Attitudes towards the Role of Professional Values in Algorithmic News Recommender Designs. Digital Journalism 9, 6 (2021), 835-863. [6] Abraham Bernstein, Claes de Vreese, Natali Helberger, Wolfgang Schulz, Katharina Zweig, Christian Baden, Michael A Beam, Marc P Hauer, Lucien Heitz, Pascal Jürgens, et al. 2020. Diversity in news recommendations. arXiv preprint arXiv:2005.09495 (2020). [7] Daniel Billsus and Michael J Pazzani. 2000. User modeling for adaptive news access. User Modeling and User-adapted Interaction 10, 2-3 (2000), 147-180. [8] Toine Bogers and Antal Van den Bosch. 2007. Comparing and evaluating information retrieval algorithms for news recommendation. In Recsys . 141-144. [9] Antoine Bordes, Nicolas Usunier, Alberto Garcia-Duran, Jason Weston, and Oksana Yakhnenko. 2013. Translating embeddings for modeling multi-relational data. In NIPS . 1-9. [10] Hugo L Borges and Ana C Lorena. 2010. A survey on recommender systems for news data. In Smart Information and Knowledge Management . Springer, 129-151. [11] Emma Brocken, Aron Hartveld, Emma de Koning, Thomas van Noort, Frederik Hogenboom, Flavius Frasincar, and Tarmo Robal. 2019. Bing-CF-IDF+: A Semantics-Driven News Recommender System. In CAiSE . Springer, 32-47. [12] Robin Burke. 2017. Multisided fairness for recommendation. arXiv preprint arXiv:1707.00093 (2017). [13] Sirian Caldarelli, Davide Feltoni Gurini, Alessandro Micarelli, and Giuseppe Sansonetti. 2016. A Signal-Based Approach to News Recommendation.. In UMAP (Extended Proceedings) . [14] Iván Cantador and Pablo Castells. 2009. Semantic contextualisation in a news recommender system. (2009). [15] Iván Cantador, Pablo Castells, and Alejandro Bellogín. 2011. An enhanced semantic layer for hybrid recommender systems: Application to news recommendation. Int. Journal on Semantic Web and Inf. Syst. 7, 1 (2011), 44-78. [16] Michel Capelle, Flavius Frasincar, Marnix Moerland, and Frederik Hogenboom. 2012. Semantics-based news recommendation. In WIMS . 1-9. [17] Michel Capelle, Frederik Hogenboom, Alexander Hogenboom, and Flavius Frasincar. 2013. Semantic news recommendation using wordnet and bing similarities. In SAC . 296-302. [18] Michel Capelle, Marnix Moerland, Frederik Hogenboom, Flavius Frasincar, and Damir Vandic. 2015. Bing-SF-IDF+ a hybrid semantics-driven news recommender. In SAC . 732-739. [19] Ines Chami, Adva Wolf, Da-Cheng Juan, Frederic Sala, Sujith Ravi, and Christopher Ré. 2020. Low-Dimensional Hyperbolic Knowledge Graph Embeddings. In ACL . 6901-6914. [20] Ines Chami, Zhitao Ying, Christopher Ré, and Jure Leskovec. 2019. Hyperbolic graph convolutional neural networks. NeurIPS 32 (2019), 4868-4879. [21] Cheng Chen, Xiangwu Meng, Zhenghua Xu, and Thomas Lukasiewicz. 2017. Location-aware personalized news recommendation with deep semantic analysis. IEEE Access 5 (2017), 1624-1638. [22] Wei Chen, Li-jun Zhang, Chun Chen, and Jia-jun Bu. 2009. A hybrid phonic web news recommender system for pervasive access. In Proc. of the WRI Int. Conf. on Commun. and Mobile Comput. , Vol. 3. IEEE, 122-126. [23] Sungmin Cho, Hongjun Lim, Keunchan Park, Sungjoo Yoo, and Eunhyeok Park. 2021. On the Overlooked Significance of Underutilized Contextual Features in Recent News Recommendation Models. arXiv preprint arXiv:2112.14370 (2021). [24] Qianfeng Chu, Gongshen Liu, Huanrong Sun, and Cheng Zhou. 2019. Next News Recommendation via KnowledgeAware Sequential Model. In CCL . Springer, 221-232. [25] Wei Chu and Seung-Taek Park. 2009. Personalized recommendation on dynamic content using predictive bilinear models. In WWW . 691-700. [26] Mark Claypool, Anuja Gokhale, Tim Miranda, Paul Murnikov, Dmitry Netes, and Matthew Sartin. 1999. Combing content-based and collaborative filters in an online newspaper. In Recommender Systems@SIGIR . [27] F Corsini and MA Larson. 2016. CLEF NewsREEL 2016: Image based Recommendation. In CLEF . 593-605. [28] Asghar Darvishy, Hamidah Ibrahim, Fatimah Sidi, and Aida Mustapha. 2020. HYPNER: A Hybrid Approach for Personalized News Recommendation. IEEE Access 8 (2020), 46877-46894. , Vol. 1, No. 1, Article . Publication date: February 2021. 42 Wu et al. , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 43 [57] Alireza Gharahighehi, Celine Vens, and Konstantinos Pliakos. 2021. Fair multi-stakeholder news recommender system with hypergraph ranking. Information Processing & Management 58, 5 (2021), 102663. [58] Frank Goossen, Wouter IJntema, Flavius Frasincar, Frederik Hogenboom, and Uzay Kaymak. 2011. News personalization using the CF-IDF semantic recommender. In WIMS . 1-12. [59] Wanrong Gu, Shoubin Dong, Zhizhao Zeng, and Jinchao He. 2014. An effective news recommendation method for microblog user. The Scientific World Journal 2014 (2014). [60] Caglar Gulcehre, Misha Denil, Mateusz Malinowski, Ali Razavi, Razvan Pascanu, Karl Moritz Hermann, Peter Battaglia, Victor Bapst, David Raposo, Adam Santoro, et al. 2018. Hyperbolic attention networks. arXiv preprint arXiv:1805.09786 (2018). [61] Jon Atle Gulla, Lemei Zhang, Peng Liu, Özlem Özgöbek, and Xiaomeng Su. 2017. The Adressa dataset for news recommendation. In WI . 1042-1048. [62] Kunni Han. 2020. Personalized News Recommendation and Simulation Based on Improved Collaborative Filtering Algorithm. Complexity 2020 (2020). [63] Songqiao Han, Hailiang Huang, and Jiangwei Liu. 2021. Neural news recommendation with event extraction. arXiv preprint arXiv:2111.05068 (2021). [64] Mahboobeh Harandi and Jon Atle Gulla. 2015. Survey of User Profiling in News Recommender Systems. In INRA@ECML PKDD . 20-26. [65] Jonathan Hendrickx, Annelien Smets, and Pieter Ballon. 2021. News Recommender Systems and News Diversity, Two of a Kind? A Case Study from a Small Media Market. Journalism and Media 2, 3 (2021), 515-528. [66] Balázs Hidasi, Alexandros Karatzoglou, Linas Baltrunas, and D Tikk. 2016. Session-based recommendations with recurrent neural networks. In ICLR . [67] Frederik Hogenboom, Michel Capelle, and Marnix Moerland. 2013. News Recommendation using Semantics with the Bing-SF-IDF Approach. In ER . Springer, 160-169. [68] Frederik Hogenboom, Michel Capelle, Marnix Moerland, and Flavius Frasincar. 2014. Bing-SF-IDF+ semantics-driven news recommendation. In WWW . 291-292. [69] Cheng-Kang Hsieh, Longqi Yang, Honghao Wei, Mor Naaman, and Deborah Estrin. 2016. Immersive recommendation: News and event recommendations using personal digital traces. In WWW . 51-62. [70] Linmei Hu, Chen Li, Chuan Shi, Cheng Yang, and Chao Shao. 2020. Graph neural news recommendation with long-term and short-term interest modeling. Information Processing & Management 57, 2 (2020), 102142. [71] Linmei Hu, Siyong Xu, Chen Li, Cheng Yang, Chuan Shi, Nan Duan, Xing Xie, and Ming Zhou. 2020. Graph neural news recommendation with unsupervised preference disentanglement. In ACL . 4255-4264. [72] Po-Sen Huang, Xiaodong He, Jianfeng Gao, Li Deng, Alex Acero, and Larry Heck. 2013. Learning deep structured semantic models for web search using clickthrough data. In CIKM . 2333-2338. [73] Clayton Hutto and Eric Gilbert. 2014. Vader: A parsimonious rule-based model for sentiment analysis of social media text. In ICWSM , Vol. 8. [74] Andreea Iana, Mehwish Alam, and Heiko Paulheim. 2021. A Survey On Knowledge-Aware News Recommender Systems. (2021). [75] Ilija Ilievski and Sujoy Roy. 2013. Personalized news recommendation based on implicit feedback. In Proceedings of the international news recommender systems workshop and challenge . 10-15. [76] Rania Islambouli, Sandy Ingram, and Denis Gillet. 2021. A User Centered News Recommendation System. In Proceedings of the 4th Workshop on Human Factors in Hypertext . 15-16. [77] Guoliang Ji, Shizhu He, Liheng Xu, Kang Liu, and Jun Zhao. 2015. Knowledge graph embedding via dynamic mapping matrix. In ACL-IJCNLP . 687-696. [78] Youchun Ji, Wenxing Hong, Yali Shangguan, Huan Wang, and Jing Ma. 2016. Regularized singular value decomposition in news recommendation system. In ICCSE . IEEE, 621-626. [79] Zhenyan Ji, Mengdan Wu, Jirui Liu, and José Enrique Armendáriz Íñigo. 2021. Attention-Based Graph Neural Network for News Recommendation. In IJCNN . IEEE, 1-8. [80] Zhenyan Ji, Mengdan Wu, Hong Yang, and José Enrique Armendáriz Íñigo. 2021. Temporal sensitive heterogeneous graph neural network for news recommendation. Future Generation Computer Systems (2021). [81] Qinglin Jia, Jingjie Li, Qi Zhang, Xiuqiang He, and Jieming Zhu. 2021. RMBERT: News Recommendation via Recurrent Reasoning Memory Network over BERT. In SIGIR . 1773-1777. [82] Nirmal Jonnalagedda and Susan Gauch. 2013. Personalized news recommendation using twitter. In WI-IAT , Vol. 3. IEEE, 21-25. [83] Nirmal Jonnalagedda, Susan Gauch, Kevin Labille, and Sultan Alfarhood. 2016. Incorporating popularity in a personalized news recommender system. PeerJ 2 (2016). [84] Kevin Joseph and Hui Jiang. 2019. Content based News Recommendation via Shortest Entity Distance over Knowledge Graphs. In Companion Proceedings of WWW . 690-699. , Vol. 1, No. 1, Article . Publication date: February 2021. 44 Wu et al. , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 45 , Vol. 1, No. 1, Article . Publication date: February 2021. 46 Wu et al. , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 47 , Vol. 1, No. 1, Article . Publication date: February 2021. 48 Wu et al. , Vol. 1, No. 1, Article . Publication date: February 2021. Personalized News Recommendation: Methods and Challenges 49 , Vol. 1, No. 1, Article . Publication date: February 2021.",
  "keywords_parsed": [
    "None"
  ]
}