{
  "Recall-Augmented Ranking: Enhancing Click-Through Rate Prediction Accuracy with Cross-Stage Data": "Junjie Huang Shanghai Jiao Tong University Shanghai, China huangjunjie2019@sjtu.edu.cn Guohao Cai Huawei Noah's Ark Lab Shenzhen, China caiguohao1@huawei.com Jieming Zhu Huawei Noah's Ark Lab Shenzhen, China jiemingzhu@ieee.org",
  "Zhenhua Dong": "Huawei Noah's Ark Lab Shenzhen, China dongzhenhua@huawei.com Ruiming Tang Huawei Noah's Ark Lab Shenzhen, China tangruiming@huawei.com",
  "Weinan Zhang": "Shanghai Jiao Tong University Shanghai, China wnzhang@sjtu.edu.cn Yong Yu Shanghai Jiao Tong University Shanghai, China yyu@sjtu.edu.cn",
  "ABSTRACT": "Click-through rate (CTR) prediction plays an indispensable role in online platforms. Numerous models have been proposed to capture users' shifting preferences by leveraging user behavior sequences. However, these historical sequences often suffer from severe homogeneity and scarcity compared to the extensive item pool. Relying solely on such sequences for user representations is inherently restrictive, as user interests extend beyond the scope of items they have previously engaged with. To address this challenge, we propose a data-driven approach to enrich user representations. We recognize user profiling and recall items as two ideal data sources within the cross-stage framework, encompassing the u2u (user-touser) and i2i (item-to-item) aspects respectively. In this paper, we propose a novel architecture named Recall-Augmented Ranking (RAR). RAR consists of two key sub-modules, which synergistically gather information from a vast pool of look-alike users and recall items, resulting in enriched user representations. Notably, RAR is orthogonal to many existing CTR models, allowing for consistent performance improvements in a plug-and-play manner. Extensive experiments are conducted, which verify the efficacy and compatibility of RAR against the SOTA methods.",
  "CCS CONCEPTS": "",
  "Â· Information systems â†’ Recommender systems .": "",
  "KEYWORDS": "Recommender systems, Cross-stage, CTR prediction",
  "ACMReference Format:": "Junjie Huang, Guohao Cai, Jieming Zhu, Zhenhua Dong, Ruiming Tang, Weinan Zhang, and Yong Yu. 2024. Recall-Augmented Ranking: Enhancing WWW'24 Companion, May 13-17, 2024, Singapore, Singapore Â© 2024 Copyright held by the owner/author(s). Publication rights licensed to ACM. This is the author's version of the work. It is posted here for your personal use. Not for redistribution. The definitive Version of Record was published in Companion Proceedings of the ACM Web Conference 2024 (WWW '24 Companion), May 13-17, 2024, Singapore, Singapore , https://doi.org/10.1145/3589335.3651551. Figure 1: An illustrated example for motivations of RAR. ...  ... User Behavior Sequence Item Pool Possible Recommendation Result of Existing Models Desired Recommendation Result Click-Through Rate Prediction Accuracy with Cross-Stage Data . In Companion Proceedings of the ACM Web Conference 2024 (WWW '24 Companion), May 13-17, 2024, Singapore, Singapore. ACM, New York, NY, USA, 4 pages. https://doi.org/10.1145/3589335.3651551",
  "1 INTRODUCTION": "Recommender systems have been widely deployed to save users from information overload. Among them, CTR prediction is an essential task, which is to predict the probability that a user will click on an item under a particular context, enhancing both user experience and platform revenue. Recently, many models have been proposed to extract user interest based on historical behavior sequences. However, items in user behavior sequences often exhibit homogeneity and scarcity versus the large-scale item pool, which is detailed in Section 2. Moreover, existing models often rely on target attention mechanisms, assigning higher scores to repetitive, similar items, reinforcing a cycle of homogeneity. In Figure 1, we provide an example. When a user buys lipstick, existing models often suggest similar products. However, the user might prefer exploring related items such as perfume or earrings, seeking variety beyond her initial purchase, even without previous interactions with these items. Therefore, we aim to enrich user representations from a data-driven perspective, incorporating diverse sources of information to enhance accuracy. WWW'24 Companion, May 13-17, 2024, Singapore, Singapore Junjie Huang et al. Moreover, CTR predictions traditionally focus on single useritem interactions and often overlook the interrelationships across various users and items, resulting in inadequate long-tail modeling. On the contrary, the recall stage inherently generates similar user-item lists, providing cross-instance modeling capability. We recognize user profiling and recall items as two ideal data sources within the cross-stage framework, encompassing the u2u and i2i aspects respectively. In this paper, we are interested in how to leverage these cross-stage data to enhance CTR prediction accuracy rather than how to construct the two sets. In this paper, we propose a novel architecture named RecallAugemented Ranking (RAR) to enhance model accuracy based on cross-stage data. RAR consists of two key components: the CrossStage User & Item Selection Module and the Co-Interaction Module. These sub-modules efficiently gather information from a broad spectrum of look-alike users and recall items, thereby enriching user representations. Note that the Co-Interaction Module is a setto-set modeling, which has not been previously explored in CTR prediction task. In summary, the contributions of the paper are as follows: Â· We shed light on the limitations of relying solely on user behavior sequences to model user preferences. To address this inadequacy, we propose a novel architecture RAR, which leverages cross-stage data to enrich user representation. Â· RAR contains two extra data sources, namely the look-alike user set and recall item set. It is the first work that incorporates set-toset modeling into CTR prediction to the best of our knowledge. Â· RAR serves as a framework capable of enhancing the performance of numerous existing CTR prediction models. Comprehensive experiments show RAR's outperformance, effectiveness and compatibility with a wide variety of models.",
  "2 BACKGROUND": "Â· Motivation of RAR: We provide an analysis of user behavior in Taobao 1 . Figure 2(a) illustrates the scarcity of user historical sequences, with the majority of users having interacted with only a minuscule fraction of the total number of available items. Figure 2(b) highlights user behavior's homogeneity, with most activity of a specific user concentrated in four to five categories out of thousands. Furthermore, traditional CTR models focus on single user-item interactions, yet overlook broader interrelationships. Conversely, the recall stage facilitates cross-instance modeling by linking similar user-item lists. Â· Cascade Ranking System and User Profiling: In modern information retrieval applications, a cascade ranking system is often used to balance the efficiency and effectiveness. The system includes a variety of rankers. Each stage selects the top-k items it receives and feeds them to the next stage. Among them, recall and ranking are two common stages. Besides, look-alike methods have become a core component of online advertising and marketing, which are intended to identify similar users from a small user set. 1 https://tianchi.aliyun.com/dataset/649 Figure 2: Observations of scarcity and homogeneity of user behavior sequence in Taobao dataset. 0.000 0.010 0.020 0.030 0.040 0.050 0.060 0.070 Ratio of Clicked Items to Total Items in Taobao 0 20000 40000 60000 80000 Number of Users (a) Scarcity of User Behavior Sequence 1 2 3 4 5 6 7 8 9 10 11 12 13 Category ID of a Specific User Behavior Sequence 0 20 40 60 Number of Clicks (b) Homogeneity of User Behavior Sequence in Taobao",
  "Table 1: Notations and descriptions": "",
  "3 APPROACH": "",
  "3.1 Cross-Stage User/Item Selection Module": "The Cross-Stage User/Item Selection Module select the most similar users and relevant items. The selection process can be abstracted into two steps and we take the selection of recall items as an example. First, similarity is measured between the target item and each recall item by similarity function ğ‘“ (Â·) . Then top-k relevant recall items can be selected based on the similarity score, which can be formalized in Equation 1, 2. We conclude the key notations and the descriptions in Table 1.   Anintuitive idea is using the embedding and search k-nearest neighbor by inner product. However, the huge number of multiplications makes real-world deployment impractical. Considering the selection complexity, we use the SimHash function in our experiment. SimHash, leveraging locality-sensitive properties, ensures similar outputs for similar inputs through random projection and signed axes, simplifying embeddings to binary fingerprints. This process is detailed in Equation 3, 4, where ğ’† ğ‘– ğ‘˜ stands for the embedding of the ğ‘˜ ğ‘¡â„ recall item and ğ‘š is the ğ‘š ğ‘¡â„ hash function in the hash function set. It reduces storage and speeds up selection by using hamming distance for efficient comparison.   Recall-Augmented Ranking: Enhancing Click-Through Rate Prediction Accuracy with Cross-Stage Data WWW'24 Companion, May 13-17, 2024, Singapore, Singapore Figure 3: RAR applied in existing CTR prediction models. Cross-Stage User Selection Module Look-alike Users Recall Items Co-Interaction Module Enriched User Representation Base Model User Profile Target Item Original User Representation Context Recall-Augmented Ranking (RAR) Cross-Stage Item Selection Module",
  "3.2 Co-Interaction Module": "Co-Interaction Module provides a fine-grained set-to-set modeling. It improves upon the simplistic equal weighting of all selected recall items, which overlooks hierarchical information. We introduce a matching matrix to assess user-item interest compatibility. The matching score is represented as high-level latent vectors' inner product, as is shown in Equation 5. Then we compute the matching matrix in Equation 6, where ğ‘†ğ‘–ğ‘”ğ‘šğ‘œğ‘–ğ‘‘ (Â·) is used to map the matching scores to (0,1).   To provide the model with a clearer indication of which recall items are more important, the signal ğ‘¦ ğ‘’ğ‘ ğ‘¢ğ‘– is utilized to supervise the training of the matching matrix. As the exposed signal is very sparse and we define ğ‘¦ ğ‘’ğ‘ ğ‘¢ğ‘– in Equation 8.   Finally, the matching matrix is averaged by row and by column to obtain the item and user weighting vector. We obtain user common interest ğ‘£ ğ‘ ğ‘¢ğ‘– and user diverse interest ğ‘£ ğ‘‘ ğ‘¢ğ‘– by multiplying weighting vectors with corresponding embeddings. Then user enriched representation ğ‘£ ğ‘’ğ‘›ğ‘Ÿ ğ‘¢ is obtained by concatenating ğ‘£ ğ‘ ğ‘¢ğ‘– and ğ‘£ ğ‘‘ ğ‘¢ğ‘– .",
  "3.3 Objective function": "The loss function of RAR can be represented by Equation 12, where L ğ‘ğ‘™ğ‘˜ aims to predict CTR accurately and L ğ‘’ğ‘ aims to provide a clearer indication to the model of which recall items are most important. ğ›¼ âˆˆ [ 0 , 1 ] is a tunable parameter for balancing the two losses. Both two losses are cross-entropy loss and supervise the training process in a point-wise manner. All modules of RAR are trained jointly by minimizing the joint loss function on the training dataset.",
  "3.4 Complexity Analysis": "We analyze the efficiency of the RAR in this section. Co-Interaction Module first gets the matching matrix and weighting scores by multiplying the embedding vectors of selected look-alike users and recall items, followed by a weighted sum using the weighting vectors. Therefore, three matrix multiplications are needed, and the time complexity is ğ‘‚ ( ğµ Â· ğ‘˜ ğ‘™ Â· ğ‘˜ ğ‘Ÿ Â· ğ‘‘ ) . As for the selection module, the time complexity depends on the selection method utilized. Since conducting ğ‘‹ğ‘‚ğ‘… and counting the number of bits in 1 in SimHash can be accomplished in ğ‘‚ ( 1 ) , the overall time complexity of RAR is ğ‘‚ ( ğµ Â· ( ğ‘™ + ğ‘Ÿ ) Â· ğ‘‘ + ğµ Â· ğ‘˜ ğ‘™ Â· ğ‘˜ ğ‘Ÿ Â· ğ‘‘ ) , where ğ‘‘ = ğ‘€ğ‘ğ‘¥ ( ğ‘‘ 1 , ğ‘‘ 2 ) . Since ğ‘˜ ğ‘™ << ğ‘™ , ğ‘˜ ğ‘Ÿ << ğ‘Ÿ , it can be approximated as ğ‘‚ ( ğµ Â· ( ğ‘™ + ğ‘Ÿ ) Â· ğ‘‘ ) .",
  "4 EXPERIMENTS": "",
  "4.1 Experimental Setup": "Datasets. Weconduct experiments on three public datasets. KKBox is a challenge dataset for music recommendation. Movielens contains users' tagging records on movies. CandiCTR-Pub is a publicly available industrial dataset that is both practical and large-scale. Apart from CandiCTR-Pub, which already includes recall item sets, we manually construct recall item sets and look-alike user sets for KKBox and MovieLens by employing a pretrained matching model(e.g., DSSM) for inner product calculations between user-item and user-user pairs. Our implementation builds upon FuxiCTR and follow the public benchmark [5] and previous works [1-3]. Base models. We consider both high-order feature interaction and ensemble models. We choose IPNN, WDL, DeepFM, DCN, xDeepFM, AutoInt+, DeepIM, DCN-V2 as our base models, which has been evaluated in the BARS benchmark; see references in [4, 5]. Baselines. FRNet [2] learns context-aware feature representations by capturing cross-feature relationships, becoming the new SOTA. CIM [3] encodes all candidate items into a context vector by transformer to characterize users' implicit awareness. Metrics. We apply the most popular metrics AUC and gAUC (weighted sum AUC, grouped by users) to evaluate the performance.",
  "4.2 Performance Evaluation with SOTA Models": "We evaluate RAR on existing models, including many SOTA methods, which is shown in Table 2. RAR notably surpasses other methods, with xDeepFM+RAR improving AUC by up to 4.7% across datasets, demonstrating the efficacy of using cross-stage data for richer user representations.",
  "4.3 Ablation Study": "We investigate the effectiveness of different components of RAR in Table 3. Three typical base models are selected to ensure generalizability and fairness. Â· Removing the channel of look-alike users: RAR-user replaces the channel of look-alike users with the target user only. Table 3 shows a 2.6% gAUC and 2.5% AUC increase over raw CTR models, highlighting the benefit of incorporating recall items into ranking models for diversified user representations. However, RAR-user's comparison to RAR indicates further potential by leveraging user common interest introduced by look-alike users. WWW'24 Companion, May 13-17, 2024, Singapore, Singapore Junjie Huang et al. Table 2: Overall performance comparison against the stateof-the-art models on three datasets. Â· Removing the User and Item Selection Module: RAR-select , removing the Cross-Stage Selection Module, truncates the lookalike user set and recall item set to match RAR's scale. Table 3 reveals a 0.4% gAUC and 2.3% AUC boost over base CTR models, which indicates the importance of a careful selection for further accuracy improvement. Â· RemovingtheCo-InteractionModule:RAR-aux-wght , omitting the Co-Interaction Module and related losses, uses simple sumpooling for user interest representation and shows weaker performance. RAR-wght , dropping weighting vectors but keeping auxiliary loss, significantly outperforms RAR-aux-wght, highlighting the auxiliary loss's role in guiding hierachical information of recall items. RAR's superiority over RAR-wght underscores the value of both matching loss and weighting vectors.",
  "4.4 Training Efficiency": "We present a wall-time comparison of RAR and CIM, the latter of which has proven effective in a real-world search advertising system. Findings detailed in Table 4 reveal that CIM_short, utilizing a truncated context input of 50 recall items, exhibits the least time consumption, whereas CIM_long, processing the full set of Table 3: Ablation study of RAR on CandiCTR-Pub. Table 4: Wall time comparison of the training and inference time of RAR and CIM on CandiCTR-Pub. 305 recall items, incurs the most time. RAR's selection modules effectively filter noise from extensive recall pools and look-alike user sets without reducing information. Additionally, as Section 4.2 demonstrates, the performance gain of RAR is substantial.",
  "5 CONCLUSION": "In this paper, we first shed light on the limitations of relying solely on homogeneous user behavior sequences to model user preferences and then we propose a novel architecture called RAR which utilizes cross-stage data to improve the cross-instance modeling capability of the models. RAR consists of two key sub-modules, which synergistically gather information from a vast pool of look-alike users and recall items, resulting in enriched user representations. RAR is a general framework that demonstrates great performance and compatibility through our in-depth experiments.",
  "ACKNOWLEDGMENTS": "The Shanghai Jiao Tong University team is partially supported by National Natural Science Foundation of China (62177033). We also gratefully acknowledge the support of MindSpore 2 , which is a new deep learning computing framework used for this research.",
  "REFERENCES": "[1] Jianghao Lin, Yanru Qu, Wei Guo, Xinyi Dai, Ruiming Tang, Yong Yu, and Weinan Zhang. 2023. MAP: A Model-agnostic Pretraining Framework for Click-through Rate Prediction. In Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining . 1384-1395. [2] Fangye Wang, Yingxu Wang, Dongsheng Li, Hansu Gu, Tun Lu, Peng Zhang, and Ning Gu. 2022. Enhancing CTR prediction with context-aware feature representation learning. In Proceedings of the 45th International ACM SIGIR Conference on Research and Development in Information Retrieval . 343-352. [3] Kaifu Zheng, Lu Wang, Yu Li, Xusong Chen, Hu Liu, Jing Lu, Xiwei Zhao, Changping Peng, Zhangang Lin, and Jingping Shao. 2022. Implicit User Awareness Modeling via Candidate Items for CTR Prediction in Search Ads. In Proceedings of the ACM Web Conference 2022 . 246-255. [4] Jieming Zhu, Jinyang Liu, Shuai Yang, Qi Zhang, and Xiuqiang He. 2021. Open benchmarking for click-through rate prediction. In Proceedings of the 30th ACM International Conference on Information & Knowledge Management . 2759-2769. [5] Jieming Zhu, Kelong Mao, Quanyu Dai, Liangcai Su, Rong Ma, Jinyang Liu, Guohao Cai, Zhicheng Dou, Xi Xiao, and Rui Zhang. 2022. BARS: Towards Open Benchmarking for Recommender Systems. In Proceedings of the 45th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR) . 2 https://www.mindspore.cn/",
  "keywords_parsed": [
    "Recommender systems",
    " Cross-stage",
    " CTR prediction"
  ]
}