{
  "Unified Vision-Language Representation Modeling for E-Commerce Same-style Products Retrieval": "Ben Chen, Linbo Jin, Xinxin Wang, Dehong Gao*, Wen Jiang, Wei Ning Alibaba Group Hangzhou, Zhejiang, China {chenben.cb,yuyi.jlb,rooney.wxx,dehong.gdh,wen.jiangw,wei.ningw}@alibaba-inc.com",
  "ABSTRACT": "Same-style products retrieval plays an important role in e-commerce platforms, aiming to identify the same products which may have different text descriptions or images. It can be used for similar products retrieval from different suppliers or duplicate products detection of one supplier. Common methods use the image as the detected object, but they only consider the visual features and overlook the attribute information contained in the textual descriptions, and perform weakly for products in image less important industries like machinery, hardware tools and electronic component, even if an additional text matching module is added. In this paper, we propose a unified vision-language modeling method for e-commerce same-style products retrieval, which is designed to represent one product with its textual descriptions and visual contents. It contains one sampling skill to collect positive pairs from user click logs with category and relevance constrained, and a novel contrastive loss unit to model the image, text, and image+text representations into one joint embedding space. It is capable of cross-modal productto-product retrieval, as well as style transfer and user-interactive search. Offline evaluations on annotated data demonstrate its superior retrieval performance, and online testings show it can attract more clicks and conversions. Moreover, this model has already been deployed online for similar products retrieval in alibaba.com, the largest B2B e-commerce platform in the world.",
  "CCS CONCEPTS": "Â· Information systems â†’ Multimedia and multimodal retrieval .",
  "KEYWORDS": "Same-style products retrieval, Vision-language representation, Contrastive loss, User interactive search",
  "ACMReference Format:": "Ben Chen, Linbo Jin, Xinxin Wang, Dehong Gao*, Wen Jiang, Wei Ning. 2022. Unified Vision-Language Representation Modeling for E-Commerce Same-style Products Retrieval. In Proceedings of The Web Conference 2023 (WWW'23). ACM, New York, NY, USA, 5 pages. https://doi.org/XXXXXXX. XXXXXXX Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. WWW'23, April 01- May 04, 2022, Austin, USA Â© 2022 Association for Computing Machinery. ACM ISBN 978-x-xxxx-xxxx-x/YY/MM...$15.00 https://doi.org/XXXXXXX.XXXXXXX Figure 1: The overview of the similar products retrieval platform in alibaba.com, where \"From more suppliers\" means the same-style products from different suppliers. Spot alike 58.98 57.18 icon click turn tab Similar producis 58.98 con 57.56 59.10 S14 00 56.99 59.99 Veriticd",
  "1 INTRODUCTION": "S ameS tyle P roducts R etrieval (SSPR) is an important task in ecommerce search system, with the aim to identify products which are the same but released by suppliers with different images and titles. It is an essential requirement for the similar products retrieval and duplicate products detection. Specifically, buyers want to view more of the same products from different suppliers, so that they can find the favorite with lower price and better quality, and we should provide this access when they are searching. While for suppliers, they tend to deliver same products for hacking more traffic, so an efficient duplicate products detection skill is in need to suppress this behavior for better users' experience and platform health. Existing methods for SSPR mainly consider the visual attributes such as product shape, style and color. They usually adopt an imageto-image matching model to score the images similarity of all candidate products, and then select the ones whose score is greater than a certain threshold as the same products. But these image-based methods overlook the textual attributes (specific mode, material, brand e.t.c.) contained in the textual descriptions, and perform weakly for products in image less important industries, e.g. machinery, hardware tools and electronic component. Some supplementary measures will adopt an additional text-to-text matching model to further filter products with irrelevant attributes. However, suppliers may add some unrelated keywords into the title for more exposures, and these keywords will mislead the model to make wrong judgments. Therefore, to accurately distinguish the same products, we should equally consider the image and textual descriptions, and utilize both visual and textual features to model the product. WWW'23, April 01- May 04, 2022, Austin, USA Ben et al. Figure 2: User-interactive search cases with proposed model. Amugwithowldesign + \"3D frog\" words can search the frog shape mugs, and a red dress + \"white\" get the white dresses. 3D white frog In recent years, more and more vision-language pre-training (VLP) models [4, 6, 7, 9, 11, 14] have emerged to explore how to align the representations of different modals. They try to map the textual and visual features into one joint embedding space based on the self-attention mechanism [2, 15], and achieve impressive performance in many cross-modal tasks like text-image retrieval, image captioning, visual question answering. However, These VLP models mainly focus on text and image matching but pay less attention to the image+text to image+text matching for SSPR, of which the key challenge is the alignment of image, text and image+text presentations to reduces interference of irrelevant attributes. To accurately represent one product with its textual description and visual content, this paper propose an unified vision-language representation method. It consists of three types of contrastive loss, with the aim to reduce the representation discrepancy of the product image, text, and image+text from different perspectives. The integrated objective function unit combining these losses can effectively model these three representations into a joint embedding space, and make the key features involved in image and text dominate the generation of embeddings. This method is applied in the fine-tune stage, and can easily adapt to various VLP models with less burden. In addition, In order to collect enough data to train an effective model, we also propose an intuitive training data sampling technique, which can gather high reliable positive pairs from user click logs by constraining categories and relevances. We execute extensive offline evaluations on annotated samestyle data for product (image, text, image+text) to product (image, text, image + text) retrieval, and the significant performance boosts demonstrate the proposed method's effectiveness for cross-modal representation. Online tests also prove that it can improve the same-style products coverage rate, and attract more clicks and conversions. This method has already been deployed online for similar products retrieval in alibaba.com, the largest B2B e-commerce platform in the world, as seen in Figure 1. Moreover, it also shows the potential for applications like style transfer and user-interactive search (shown in Figure 2).",
  "2 METHOD": "",
  "2.1 Query-Item Click Graph": "For training an effective model to retrieval the same-style products, one primary shortcoming is the lack of high-reliable training data. Because the manual annotation samples are accurate but expensive, while online available data is noisy and can not cover all categories. Here we collect reliable samples from user query-item click log, and impose category and relevance restrictions to ensure the accuracy of data. This sampling skill is based on a basic cognition that the query reflect user's intents and their click behaviors indicates their attention to different products. Two samples with deeper click level in the same query should have higher similarity. In alibaba.com, the user's click behavior can be divided into 5 levels: page-click ( ğ‘ ) â‰¤ add-to-cart ( ğ‘ ) â‰¤ contact-supplier ( ğ‘  ) â‰¤ order ( ğ‘œ ) â‰¤ pay ( ğ‘ ). We construct the query-item click graph with query nodes containing the search texts and the item nodes composed of <image, title, keywords, brand>. Then we use the sum of different click level scores as weight to build a co-clicking edge between query ğ‘ ğ‘– and item node ğ‘ ğ‘– pairs. Click level score is represented as a coefficient ğ€ multiply the click number and final weight is:  For deeper clicks, this coefficient should be set larger to alleviate the effect of < ğ‘ ğ‘– , ğ‘ ğ‘– > pairs which users click by mistake.",
  "2.2 Constrained Graph Sampling": "After constructing the click graph, we use the weighted sampling strategy to generate training samples. Specifically, we collect no more than 4 items of one query according to the weight from large to small, and build positive sample in pairs. In addition, we set three constraints to ensure the sampling accuracy: Query contains at least two words and one core keyword . Some users have no clear search intents and will enter query with ambiguous semantics, e.g. dress, sport shoes. These queries cover a relatively broad category and the items clicked by users are also scattered. So we select the query with at least two words, and one core keyword that clearly represents the user's needs. Two items must be of same sub-category . E-commerce platform has a hierarchical and fine-grained category structure, and one category contains dozens of sub-categories. For example, \"woman dress\" contains 20 sub-categories like \"evening dress\", \"career dress\", \"casual dress\", and \"casual dress\". A query \"red long dress with vneck\" will retrieval items cross these categories. To collect samestyle ones, we should keep two items of same sub-category. Image-text pairs should have high similarity . Deep click levels limitation can not entirely guarantee that two items are of same-style. So we compute image similarity with embedding outputted from Resnet50 [5] and text similarity with embedding outputted from Bert [2] for each pairs, and eliminate those pairs with image similarity or text similarity values lower than 0.7. After the constrained sampling, we select those pairs that contain at least one core keyword in common as the final training samples. This operation is also designed to reduce the sampling error.",
  "2.3 Contrastive Loss Unit": "The basic architecture of vision-language pre-training (VLP) models is usually composed of a visual embedding module, a textual embedding module and a fusion encoder [16, 17]. Of these architectures the image is usually encoded with an off-the-shelf ResNet [5], or Faster-RCNN [13], or Visual Transformer [3] model. While textual embeddings are generated by dividing the text description Unified Vision-Language Representation Modeling for E-Commerce Same-style Products Retrieval WWW'23, April 01- May 04, 2022, Austin, USA Figure 3: The overview of proposed contrastive loss unit. We mainly show the PPM construction method for brevity. into a sequence of word tokens and then fed into one transformer model [1, 2, 10]. Then an encoder will fuse both embeddings to create a contextual interacted multimodal representation. As for the training objectives, common VLP models use image+text contrastive loss (ITC) to align the embedding space of text and image, while adopt binary classification image+text matching loss (ITM) for learning a multimodal representation to predict whether image and text is in pair, as well as some additional objectives like language modeling loss to enhance the embedding learning [4, 7, 8, 12]. However, they pay less attention to the feature alignment at the item (image+text) level. Here we further consider how to generate one multimodal representation used for image+text to image+text matching in same-style products retrieval, and proposed a novel contrastive loss unit acting in the fine-tune stage. It contains three types of objectives: product to product matching losses ( PPM ), product self-distinctiveness losses ( PDC ) and product locality consistency losses ( PLC ). They are designed to learn a cross-modal aligned representation from different perspectives, and all contribute to model image, text, and image+text into one joint embedding space. Given an item-item pair of same-style, we take the left item as trigger item ğ‘¡ ğ‘– , and the right item as recall item ğ‘Ÿ ğ‘– , where the subscript ğ‘– indicates the ğ‘– -th pair in dataset. The multimodal image+text embeddings ğ‘¡ ğ‘š ğ‘– , ğ‘Ÿ ğ‘š ğ‘– are the average of all embeddings of the last layer. The single image visual embeddings ğ‘¡ ğ‘£ ğ‘– , ğ‘Ÿ ğ‘£ ğ‘– and textual embeddings ğ‘¡ ğ‘¡ ğ‘– , ğ‘Ÿ ğ‘¡ ğ‘– are the average of corresponding embeddings of the last layer, with the masked text description and image are replaced with the all-zero sequences to simulate single modal inputs. Finally, all these embeddings are normalized. Product to product matching losses (PPM) . This objective aims to align the representations of trigger item and recall item into one joint embedding space. We assume that if two items are of same-style, the multimodal image+text embeddings of one should have the high similarity to the other. Furthermore, the image, text description (text, keywords, brand, e.t.c) of the trigger item should also be aligned to the multimodal embeddings of the recall item, making the key features involved in image and text dominate the generation of embeddings. Specifically, during fine-tuning stage, each items < ğ‘¡ ğ‘– , ğ‘Ÿ ğ‘– > of samestyle are taken as positive sample pair, while the trigger item ğ‘¡ ğ‘– and recall item ğ‘Ÿ ğ‘— from other trigger item in the same batch combine the negative sample pair < ğ‘¡ ğ‘– , ğ‘Ÿ ğ‘— >. We compute the similarity score between three embeddings of trigger item and image+text embeddings of the recall item as the follows:  Then we use hinge loss to guide item pairs of same-style to have greater similarity values compared with those of different styles:  where ğ‘ is the batch size, ğ›¼ 1 is the margin value. It lets cross-modal embeddings of positive pairs be closer than those of negative pairs. Product self-distinctiveness losses (PDC) . PDC is designed to ensure that three modal embeddings of one item should have the smaller distance than the multimodal embeddings between trigger item and recall item. In other words, the similarity values between ğ‘¡ ğ‘£ ğ‘– , ğ‘¡ ğ‘¡ ğ‘– and ğ‘¡ ğ‘š ğ‘– should larger than those between ğ‘¡ ğ‘š ğ‘– and ğ‘Ÿ ğ‘š ğ‘— .  where ğ›¼ 2 is the margin value. This objective is similar to PPM, but it is one effective way to reduce representation discrepancy of three modals from another perspective. Product locality consistency losses (PLC) . PLC tries to align the embedding of image, text, and image+text to reduces interference of irrelevant attributes. That is, three normalized embeddings of one trigger item should be as consistent as possible. It can be described as the mean square error (MSE) of the similarity values ğ‘  ğ‘š â†” ğ‘š ğ‘– ğ‘— , ğ‘  ğ‘£ â†” ğ‘š ğ‘– ğ‘— , and ğ‘  ğ‘¡ â†” ğ‘š ğ‘– ğ‘— should smaller than a certain value:  where ğ›¼ 3 is the margin value. This computation is relatively large, and we can compute only top 10 pairs for each trigger item, where the rank list is arranged according to ğ‘  ğ‘¡ â†” ğ‘š ğ‘– ğ‘— from large to small. So the total loss is formulated as follows:  As a side note, the pairs in the same batch should keep the same sub-category but belong to different same-style. This operation drives the model to focus on hard samples, and learn the finegrained difference between styles.",
  "3 EXPERIMENTS": "In this section, we conduct comprehensive evaluations on annotated same-style data offline and A/B test online to verify the feasibility of proposed method. Dataset. We collect a large scale of training samples from user click log by the sampling skills detailed above, with the coefficient ğ€ set as (1,2,2,5,5). It contains 4 million trigger-recall item pairs of 20 industries and 4000 sub-categories. Since there is no public evaluation data, here we collect 5196 manually annotated pairs covering 15 industries and 973 sub-categories for the offline testing. WWW'23, April 01- May 04, 2022, Austin, USA Ben et al. Table 1: Comparison with different methods on manual annotated data. R@n is the abbreviation of Recall@n . Table 2: Ablation experiment results of different losses with same inputs. R@n is the abbreviation of Recall@n . Implementation details. We use tiny FashionBert (L2-H128A6) [4] as the base pre-trained model. It is an economical and efficient model and have been online applied in the item recall stage of many search platforms. The image is split into 4 Ã— 4 patches, and passes through ResNet-50 to generate 16 tokens. The maximum text sequence length is set to 50 with the special [CLS] on the head, so the total token length is 66. Learning rate is set as 3e-4, the batch size is 256 and the margin values ğ›¼ 1 , 2 , 3 is set as (0.3, 0.2, 0 . 05 2 ). All the evaluated models are trained within 5 epochs and we adopt the early-stopping strategy.",
  "3.1 Offline evaluation.": "For the fair comparison with same model structure and parameters, we fine-tune two baseline models with only image (base v-v) and text (base t-t) as the inputs while the corresponding objectives are set to be image-image and text-text hinge loss, then use the outputs (visual embeddings, textual embeddings) of trigger and recall items to compute the similarities. We abbreviate the proposed model as eSSPR for short. eSSPR v-v / t-t / m-m denote that we fine-tune pre-trained model with image + text as the inputs and ğ¿ ğ‘¡ğ‘œğ‘¡ğ‘ğ‘™ as the loss function, and we compute the similarities with only image, only text and image+text as the inputs to generate corresponding embeddings. For all evaluations we adopt Mean Reciprocal Ranking (MRR) and recall@K as the metrics, which are widely used in search and recommendation systems. All data presented are the average values of the metrics for all testing pairs. The results are shown in Table 1, we can see that eSSPR mm outperforms two baseline method with large improvements, demonstrating the effectiveness of the proposed unified visionlanguage representation method. Furthermore, even if we only use unimodal features (text or image), the model eSSPR t-t (v-v) achieves a higher performance than base t-t (v-v), which proves that the contrastive loss unit contributes to make the key features involved in image and text dominate the generation of embeddings. In order to verify the feasibility of proposed loss unit, we provide additional ablation experiments, which are exhibited in Table 2. The ğ¿ ğ‘ğ‘ğ‘ ğ‘’ is the hinge loss of image+text embeddings for trigger items ( ğ‘¡ ğ‘š ğ‘– ) and recall items ( ğ‘Ÿ ğ‘š ğ‘– ). We find that ğ¿ ğ‘ƒğ‘ƒğ‘€ have the better performance than ğ¿ ğ‘ğ‘ğ‘ ğ‘’ . Combined with the results of unimodal models in Table 1, we believe that ğ¿ ğ‘ƒğ‘ƒğ‘€ can make the representation of image, text and image+text mutually enhance each other. ğ¿ ğ‘ƒğ‘ƒğ‘€ + ğ‘ƒğ¿ğ¶ and ğ¿ ğ‘ƒğ‘ƒğ‘€ + ğ‘ƒğ·ğ¶ improve MRR and recall rate significantly, and ğ¿ ğ‘¡ğ‘œğ‘¡ğ‘ğ‘™ achieves the best results among them. These comparisons verify the contrastive loss unit is capable of boosting the performance substantially.",
  "3.2 Online Experiments.": "We lauched the proposed model in our similar products retrieval platform, which is used in the search, homepage recommender and you-shopping-history recommender modules in alibaba.com (shown in Figure 1). We compare the experimental performance of SCR (same-style products coverage rate), CTR (click through rate) and CVR (average conversion rate) before and after the launch. As shown in Table 3, the SCR, CTR and CVR metrics increase + 64 . 9%, + 2 . 51%, + 2 . 31% respectively. The results verified that the proposed unified vision-language representation method can attract more clicks and conversions for increasing the industry revenue. Table 3: Online results for A/B testing . More cross-modal retrieval results, the annotated testing data cases, corresponding codes and the application demo of proposed methods in alibaba.com are attached in the appendix. All of them will be released to public through the official repository, as well as the adaptive testings for modern dual-stream models like CLIP [12] and Align [8].",
  "4 CONCLUSION": "Same-style products retrieval (SSPR) provides one channel for users to compare more same products with lower price or higher quality. To identify the same products which may have different text descriptions and images, we proposed a unified vision-language representation method for same-style products retrieval. It contains a reliable training samples construction technique, and a novel contrastive loss unit acts in the fine-tune stage to model the product image, text, and image+text representation into one joint embedding space. Extensive experiments on offline annotated item pairs demonstrates its superior performance for the same products retrieval. Online testings have verified that it can attract more clicks and conversions in the similar product recommendation in alibaba.com. In the further, we will focus on its extended applications likes style transfer and user-interactive search, and also study how to make the more fine-grained alignment of multimodal features for e-commerce platform. Unified Vision-Language Representation Modeling for E-Commerce Same-style Products Retrieval WWW'23, April 01- May 04, 2022, Austin, USA",
  "REFERENCES": "[1] Alexis Conneau, Kartikay Khandelwal, Naman Goyal, Vishrav Chaudhary, Guillaume Wenzek, Francisco GuzmÃ¡n, Edouard Grave, Myle Ott, Luke Zettlemoyer, and Veselin Stoyanov. 2019. Unsupervised cross-lingual representation learning at scale. arXiv preprint arXiv:1911.02116 (2019). [2] Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies . Association for Computational Linguistics, Minneapolis, Minnesota, 4171-4186. [3] Alexey Dosovitskiy, Lucas Beyer, Alexander Kolesnikov, Dirk Weissenborn, Xiaohua Zhai, Thomas Unterthiner, Mostafa Dehghani, Matthias Minderer, Georg Heigold, Sylvain Gelly, et al. 2020. An image is worth 16x16 words: Transformers for image recognition at scale. arXiv preprint arXiv:2010.11929 (2020). [4] Dehong Gao, Linbo Jin, Ben Chen, Minghui Qiu, Peng Li, Yi Wei, Yi Hu, and Hao Wang. 2020. Fashionbert: Text and image matching with adaptive loss for crossmodal retrieval. In Proceedings of the 43rd International ACM SIGIR Conference on Research and Development in Information Retrieval . 2251-2260. [5] Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2016. Deep residual learning for image recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition . 770-778. [6] Gen Li, Nan Duan, Yuejian Fang, Ming Gong, and Daxin Jiang. 2020. Unicodervl: A universal encoder for vision and language by cross-modal pre-training. In Proceedings of the AAAI Conference on Artificial Intelligence , Vol. 34. 11336-11344. [7] Junnan Li, Dongxu Li, Caiming Xiong, and Steven Hoi. 2022. Blip: Bootstrapping language-image pre-training for unified vision-language understanding and generation. arXiv preprint arXiv:2201.12086 (2022). [8] Junnan Li, Ramprasaath Selvaraju, Akhilesh Gotmare, Shafiq Joty, Caiming Xiong, and Steven Chu Hong Hoi. 2021. Align before fuse: Vision and language representation learning with momentum distillation. Advances in Neural Information Processing Systems (2021). [9] Xiujun Li, Xi Yin, Chunyuan Li, Pengchuan Zhang, Xiaowei Hu, Lei Zhang, Lijuan Wang, Houdong Hu, Li Dong, Furu Wei, Yejin Choi, and Jianfeng Gao. 2020. Oscar: Object-Semantics Aligned Pre-training for Vision-Language Tasks. In Computer Vision - ECCV 2020 . Springer International Publishing, Cham, 121-137. [10] Yinhan Liu, Myle Ott, Naman Goyal, Jingfei Du, Mandar Joshi, Danqi Chen, Omer Levy, Mike Lewis, Luke Zettlemoyer, and Veselin Stoyanov. 2019. Roberta: A robustly optimized bert pretraining approach. arXiv preprint arXiv:1907.11692 (2019). [11] Jiasen Lu, Dhruv Batra, Devi Parikh, and Stefan Lee. 2019. ViLBERT: Pretraining Task-Agnostic Visiolinguistic Representations for Vision-and-Language Tasks. In Advances in Neural Information Processing Systems , Vol. 32. Curran Associates, Inc. [12] Alec Radford, Jong Wook Kim, Chris Hallacy, Aditya Ramesh, Gabriel Goh, Sandhini Agarwal, Girish Sastry, Amanda Askell, Pamela Mishkin, Jack Clark, et al. 2021. Learning transferable visual models from natural language supervision. In International Conference on Machine Learning . PMLR, 8748-8763. [13] Shaoqing Ren, Kaiming He, Ross Girshick, and Jian Sun. 2015. Faster r-cnn: Towards real-time object detection with region proposal networks. Advances in neural information processing systems 28 (2015). [14] Weijie Su, Xizhou Zhu, Yue Cao, Bin Li, Lewei Lu, Furu Wei, and Jifeng Dai. 2019. Vl-bert: Pre-training of generic visual-linguistic representations. arXiv preprint arXiv:1908.08530 (2019). [15] Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Å ukasz Kaiser, and Illia Polosukhin. 2017. Attention is All you Need. In Advances in Neural Information Processing Systems , Vol. 30. Curran Associates, Inc. https://proceedings.neurips.cc/paper/2017/file/ 3f5ee243547dee91fbd053c1c4a845aa-Paper.pdf [16] Licheng Yu, Jun Chen, Animesh Sinha, Mengjiao MJ Wang, Hugo Chen, Tamara L Berg, and Ning Zhang. 2022. CommerceMM: Large-Scale Commerce MultiModal Representation Learning with Omni Retrieval. arXiv preprint arXiv:2202.07247 (2022). [17] Tan Yu, Xiaokang Li, Jianwen Xie, Ruiyang Yin, Qing Xu, and Ping Li. 2021. MixBERT for image-ad relevance scoring in advertising. In Proceedings of the 30th ACM International Conference on Information & Knowledge Management . 3597-3602.",
  "keywords_parsed": [
    "Same-style products retrieval",
    "Vision-language representation",
    "Contrastive loss",
    "User interactive search"
  ],
  "references_parsed": [
    {
      "ref_id": "b1",
      "title": "Unsupervised cross-lingual representation learning at scale"
    },
    {
      "ref_id": "b2",
      "title": "BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding"
    },
    {
      "ref_id": "b3",
      "title": "An image is worth 16x16 words: Transformers for image recognition at scale"
    },
    {
      "ref_id": "b4",
      "title": "Fashionbert: Text and image matching with adaptive loss for crossmodal retrieval"
    },
    {
      "ref_id": "b5",
      "title": "Deep residual learning for image recognition"
    },
    {
      "ref_id": "b6",
      "title": "Unicodervl: A universal encoder for vision and language by cross-modal pre-training"
    },
    {
      "ref_id": "b7",
      "title": "Blip: Bootstrapping language-image pre-training for unified vision-language understanding and generation"
    },
    {
      "ref_id": "b8",
      "title": "Align before fuse: Vision and language representation learning with momentum distillation"
    },
    {
      "ref_id": "b9",
      "title": "Oscar: Object-Semantics Aligned Pre-training for Vision-Language Tasks"
    },
    {
      "ref_id": "b10",
      "title": "Roberta: A robustly optimized bert pretraining approach"
    },
    {
      "ref_id": "b11",
      "title": "ViLBERT: Pretraining Task-Agnostic Visiolinguistic Representations for Vision-and-Language Tasks"
    },
    {
      "ref_id": "b12",
      "title": "Learning transferable visual models from natural language supervision"
    },
    {
      "ref_id": "b13",
      "title": "Faster r-cnn: Towards real-time object detection with region proposal networks"
    },
    {
      "ref_id": "b14",
      "title": "Vl-bert: Pre-training of generic visual-linguistic representations"
    },
    {
      "ref_id": "b15",
      "title": "Attention is All you Need"
    },
    {
      "ref_id": "b16",
      "title": "CommerceMM: Large-Scale Commerce MultiModal Representation Learning with Omni Retrieval"
    },
    {
      "ref_id": "b17",
      "title": "MixBERT for image-ad relevance scoring in advertising"
    }
  ]
}